snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
/********************************************************************
 *
 * Standard register and bit definitions for the Texas Instruments
 * MSP430 microcontroller.
 *
 * This file supports assembler and C/EC++ development for
 * msp430f5521 devices.
 *
 * Copyright 1996-2015 IAR Systems AB.
 *
 *
 *
 ********************************************************************/

#ifndef __IO430F5521
#define __IO430F5521

#ifdef  __IAR_SYSTEMS_ICC__

#include "intrinsics.h"
#ifndef _SYSTEM_BUILD
#pragma system_include
#endif
#endif

#if (((__TID__ >> 8) & 0x7F) != 0x2b)     /* 0x2b = 43 dec */
#error io430f5521.h file for use with ICC430/A430 only
#endif

#if __REGISTER_MODEL__ == __REGISTER_MODEL_REG20__
#define __ACCESS_20BIT_REG__  void __data20 * volatile
#else
#define __ACCESS_20BIT_REG__  volatile unsigned short  /* only short access from C is allowed in small memory model */
#endif


#define __MSP430_HAS_MSP430XV2_CPU__  /* Definition to show that it has MSP430XV2 CPU */


#ifdef __IAR_SYSTEMS_ICC__
#pragma language=save
#pragma language=extended


#ifdef __cplusplus
#define __READ    /* not supported */
#else
#define __READ    const
#endif


/*-------------------------------------------------------------------------
 *   Standard Bits
 *-------------------------------------------------------------------------*/

#define BIT0                (0x0001)
#define BIT1                (0x0002)
#define BIT2                (0x0004)
#define BIT3                (0x0008)
#define BIT4                (0x0010)
#define BIT5                (0x0020)
#define BIT6                (0x0040)
#define BIT7                (0x0080)
#define BIT8                (0x0100)
#define BIT9                (0x0200)
#define BITA                (0x0400)
#define BITB                (0x0800)
#define BITC                (0x1000)
#define BITD                (0x2000)
#define BITE                (0x4000)
#define BITF                (0x8000)

/*-------------------------------------------------------------------------
 *   Status register bits
 *-------------------------------------------------------------------------*/

#define C                   (0x0001)
#define Z                   (0x0002)
#define N                   (0x0004)
#define V                   (0x0100)
#define GIE                 (0x0008)
#define CPUOFF              (0x0010)
#define OSCOFF              (0x0020)
#define SCG0                (0x0040)
#define SCG1                (0x0080)

/* Low Power Modes coded with Bits 4-7 in SR */

#define LPM0_bits           (CPUOFF)
#define LPM1_bits           (SCG0+CPUOFF)
#define LPM2_bits           (SCG1+CPUOFF)
#define LPM3_bits           (SCG1+SCG0+CPUOFF)
#define LPM4_bits           (SCG1+SCG0+OSCOFF+CPUOFF)


#define LPM0      __bis_SR_register(LPM0_bits)     /* Enter Low Power Mode 0 */
#define LPM0_EXIT __bic_SR_register_on_exit(LPM0_bits) /* Exit Low Power Mode 0 */
#define LPM1      __bis_SR_register(LPM1_bits)     /* Enter Low Power Mode 1 */
#define LPM1_EXIT __bic_SR_register_on_exit(LPM1_bits) /* Exit Low Power Mode 1 */
#define LPM2      __bis_SR_register(LPM2_bits)     /* Enter Low Power Mode 2 */
#define LPM2_EXIT __bic_SR_register_on_exit(LPM2_bits) /* Exit Low Power Mode 2 */
#define LPM3      __bis_SR_register(LPM3_bits)     /* Enter Low Power Mode 3 */
#define LPM3_EXIT __bic_SR_register_on_exit(LPM3_bits) /* Exit Low Power Mode 3 */
#define LPM4      __bis_SR_register(LPM4_bits)     /* Enter Low Power Mode 4 */
#define LPM4_EXIT __bic_SR_register_on_exit(LPM4_bits) /* Exit Low Power Mode 4 */



/*-------------------------------------------------------------------------
 *   ADC12
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short ADC12CTL0;   /* ADC12+ Control 0 */

  struct
  {
    unsigned short ADC12SC         : 1; /* ADC12 Start Conversion */
    unsigned short ADC12ENC        : 1; /* ADC12 Enable Conversion */
    unsigned short ADC12TOVIE      : 1; /* ADC12 Timer Overflow interrupt enable */
    unsigned short ADC12OVIE       : 1; /* ADC12 Overflow interrupt enable */
    unsigned short ADC12ON         : 1; /* ADC12 On/enable */
    unsigned short ADC12REFON      : 1; /* ADC12 Reference on */
    unsigned short ADC12REF2_5V    : 1; /*  */
    unsigned short ADC12MSC        : 1; /* ADC12 Multiple SampleConversion */
    unsigned short ADC12SHT00      : 1; /* ADC12 Sample Hold 0 Select Bit: 0 */
    unsigned short ADC12SHT01      : 1; /* ADC12 Sample Hold 0 Select Bit: 1 */
    unsigned short ADC12SHT02      : 1; /* ADC12 Sample Hold 0 Select Bit: 2 */
    unsigned short ADC12SHT03      : 1; /* ADC12 Sample Hold 0 Select Bit: 3 */
    unsigned short ADC12SHT10      : 1; /* ADC12 Sample Hold 1 Select Bit: 0 */
    unsigned short ADC12SHT11      : 1; /* ADC12 Sample Hold 1 Select Bit: 1 */
    unsigned short ADC12SHT12      : 1; /* ADC12 Sample Hold 1 Select Bit: 2 */
    unsigned short ADC12SHT13      : 1; /* ADC12 Sample Hold 1 Select Bit: 3 */
  } ADC12CTL0_bit;

  struct
  {
    unsigned char ADC12CTL0_L;
    unsigned char ADC12CTL0_H;
  };
} @0x0700;

enum {
  ADC12SC         = 0x0001,
  ADC12ENC        = 0x0002,
  ADC12TOVIE      = 0x0004,
  ADC12OVIE       = 0x0008,
  ADC12ON         = 0x0010,
  ADC12REFON      = 0x0020,
  ADC12REF2_5V    = 0x0040,
  ADC12MSC        = 0x0080,
  ADC12SHT00      = 0x0100,
  ADC12SHT01      = 0x0200,
  ADC12SHT02      = 0x0400,
  ADC12SHT03      = 0x0800,
  ADC12SHT10      = 0x1000,
  ADC12SHT11      = 0x2000,
  ADC12SHT12      = 0x4000,
  ADC12SHT13      = 0x8000
};

__no_init volatile union
{
  unsigned short ADC12CTL1;   /* ADC12+ Control 1 */

  struct
  {
    unsigned short ADC12BUSY       : 1; /* ADC12 Busy */
    unsigned short ADC12CONSEQ0    : 1; /* ADC12 Conversion Sequence Select Bit: 0 */
    unsigned short ADC12CONSEQ1    : 1; /* ADC12 Conversion Sequence Select Bit: 1 */
    unsigned short ADC12SSEL0      : 1; /* ADC12 Clock Source Select Bit: 0 */
    unsigned short ADC12SSEL1      : 1; /* ADC12 Clock Source Select Bit: 1 */
    unsigned short ADC12DIV0       : 1; /* ADC12 Clock Divider Select Bit: 0 */
    unsigned short ADC12DIV1       : 1; /* ADC12 Clock Divider Select Bit: 1 */
    unsigned short ADC12DIV2       : 1; /* ADC12 Clock Divider Select Bit: 2 */
    unsigned short ADC12ISSH       : 1; /* ADC12 Invert Sample Hold Signal */
    unsigned short ADC12SHP        : 1; /* ADC12 Sample/Hold Pulse Mode */
    unsigned short ADC12SHS0       : 1; /* ADC12 Sample/Hold Source Bit: 0 */
    unsigned short ADC12SHS1       : 1; /* ADC12 Sample/Hold Source Bit: 1 */
    unsigned short ADC12CSTARTADD0 : 1; /* ADC12 Conversion Start Address Bit: 0 */
    unsigned short ADC12CSTARTADD1 : 1; /* ADC12 Conversion Start Address Bit: 1 */
    unsigned short ADC12CSTARTADD2 : 1; /* ADC12 Conversion Start Address Bit: 2 */
    unsigned short ADC12CSTARTADD3 : 1; /* ADC12 Conversion Start Address Bit: 3 */
  } ADC12CTL1_bit;

  struct
  {
    unsigned char ADC12CTL1_L;
    unsigned char ADC12CTL1_H;
  };
} @0x0702;

enum {
  ADC12BUSY       = 0x0001,
  ADC12CONSEQ0    = 0x0002,
  ADC12CONSEQ1    = 0x0004,
  ADC12SSEL0      = 0x0008,
  ADC12SSEL1      = 0x0010,
  ADC12DIV0       = 0x0020,
  ADC12DIV1       = 0x0040,
  ADC12DIV2       = 0x0080,
  ADC12ISSH       = 0x0100,
  ADC12SHP        = 0x0200,
  ADC12SHS0       = 0x0400,
  ADC12SHS1       = 0x0800,
  ADC12CSTARTADD0 = 0x1000,
  ADC12CSTARTADD1 = 0x2000,
  ADC12CSTARTADD2 = 0x4000,
  ADC12CSTARTADD3 = 0x8000
};

