snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short ADC12CTL2;   /* ADC12+ Control 2 */

  struct
  {
    unsigned short ADC12REFBURST   : 1; /* ADC12+ Reference Burst */
    unsigned short ADC12REFOUT     : 1; /* ADC12+ Reference Out */
    unsigned short ADC12SR         : 1; /* ADC12+ Sampling Rate */
    unsigned short ADC12DF         : 1; /* ADC12+ Data Format */
    unsigned short ADC12RES0       : 1; /* ADC12+ Resolution Bit: 0 */
    unsigned short ADC12RES1       : 1; /* ADC12+ Resolution Bit: 1 */
    unsigned short                : 1;
    unsigned short ADC12TCOFF      : 1; /* ADC12+ Temperature Sensor Off */
    unsigned short ADC12PDIV       : 1; /* ADC12+ predivider 0:/1   1:/4 */
  } ADC12CTL2_bit;

  struct
  {
    unsigned char ADC12CTL2_L;
    unsigned char ADC12CTL2_H;
  };
} @0x0704;

enum {
  ADC12REFBURST   = 0x0001,
  ADC12REFOUT     = 0x0002,
  ADC12SR         = 0x0004,
  ADC12DF         = 0x0008,
  ADC12RES0       = 0x0010,
  ADC12RES1       = 0x0020,
  ADC12TCOFF      = 0x0080,
  ADC12PDIV       = 0x0100
};

__no_init volatile union
{
  unsigned short ADC12IFG;   /* ADC12+ Interrupt Flag */

  struct
  {
    unsigned short ADC12IFG0       : 1; /* ADC12 Memory 0 Interrupt Flag */
    unsigned short ADC12IFG1       : 1; /* ADC12 Memory 1 Interrupt Flag */
    unsigned short ADC12IFG2       : 1; /* ADC12 Memory 2 Interrupt Flag */
    unsigned short ADC12IFG3       : 1; /* ADC12 Memory 3 Interrupt Flag */
    unsigned short ADC12IFG4       : 1; /* ADC12 Memory 4 Interrupt Flag */
    unsigned short ADC12IFG5       : 1; /* ADC12 Memory 5 Interrupt Flag */
    unsigned short ADC12IFG6       : 1; /* ADC12 Memory 6 Interrupt Flag */
    unsigned short ADC12IFG7       : 1; /* ADC12 Memory 7 Interrupt Flag */
    unsigned short ADC12IFG8       : 1; /* ADC12 Memory 8 Interrupt Flag */
    unsigned short ADC12IFG9       : 1; /* ADC12 Memory 9 Interrupt Flag */
    unsigned short ADC12IFG10      : 1; /* ADC12 Memory 10 Interrupt Flag */
    unsigned short ADC12IFG11      : 1; /* ADC12 Memory 11 Interrupt Flag */
    unsigned short ADC12IFG12      : 1; /* ADC12 Memory 12 Interrupt Flag */
    unsigned short ADC12IFG13      : 1; /* ADC12 Memory 13 Interrupt Flag */
    unsigned short ADC12IFG14      : 1; /* ADC12 Memory 14 Interrupt Flag */
    unsigned short ADC12IFG15      : 1; /* ADC12 Memory 15 Interrupt Flag */
  } ADC12IFG_bit;

  struct
  {
    unsigned char ADC12IFG_L;
    unsigned char ADC12IFG_H;
  };
} @0x070A;

enum {
  ADC12IFG0       = 0x0001,
  ADC12IFG1       = 0x0002,
  ADC12IFG2       = 0x0004,
  ADC12IFG3       = 0x0008,
  ADC12IFG4       = 0x0010,
  ADC12IFG5       = 0x0020,
  ADC12IFG6       = 0x0040,
  ADC12IFG7       = 0x0080,
  ADC12IFG8       = 0x0100,
  ADC12IFG9       = 0x0200,
  ADC12IFG10      = 0x0400,
  ADC12IFG11      = 0x0800,
  ADC12IFG12      = 0x1000,
  ADC12IFG13      = 0x2000,
  ADC12IFG14      = 0x4000,
  ADC12IFG15      = 0x8000
};

__no_init volatile union
{
  unsigned short ADC12IE;   /* ADC12+ Interrupt Enable */

  struct
  {
    unsigned short ADC12IE0        : 1; /* ADC12 Memory 0 Interrupt Enable */
    unsigned short ADC12IE1        : 1; /* ADC12 Memory 1 Interrupt Enable */
    unsigned short ADC12IE2        : 1; /* ADC12 Memory 2 Interrupt Enable */
    unsigned short ADC12IE3        : 1; /* ADC12 Memory 3 Interrupt Enable */
    unsigned short ADC12IE4        : 1; /* ADC12 Memory 4 Interrupt Enable */
    unsigned short ADC12IE5        : 1; /* ADC12 Memory 5 Interrupt Enable */
    unsigned short ADC12IE6        : 1; /* ADC12 Memory 6 Interrupt Enable */
    unsigned short ADC12IE7        : 1; /* ADC12 Memory 7 Interrupt Enable */
    unsigned short ADC12IE8        : 1; /* ADC12 Memory 8 Interrupt Enable */
    unsigned short ADC12IE9        : 1; /* ADC12 Memory 9 Interrupt Enable */
    unsigned short ADC12IE10       : 1; /* ADC12 Memory 10 Interrupt Enable */
    unsigned short ADC12IE11       : 1; /* ADC12 Memory 11 Interrupt Enable */
    unsigned short ADC12IE12       : 1; /* ADC12 Memory 12 Interrupt Enable */
    unsigned short ADC12IE13       : 1; /* ADC12 Memory 13 Interrupt Enable */
    unsigned short ADC12IE14       : 1; /* ADC12 Memory 14 Interrupt Enable */
    unsigned short ADC12IE15       : 1; /* ADC12 Memory 15 Interrupt Enable */
  } ADC12IE_bit;

  struct
  {
    unsigned char ADC12IE_L;
    unsigned char ADC12IE_H;
  };
} @0x070C;

enum {
  ADC12IE0        = 0x0001,
  ADC12IE1        = 0x0002,
  ADC12IE2        = 0x0004,
  ADC12IE3        = 0x0008,
  ADC12IE4        = 0x0010,
  ADC12IE5        = 0x0020,
  ADC12IE6        = 0x0040,
  ADC12IE7        = 0x0080,
  ADC12IE8        = 0x0100,
  ADC12IE9        = 0x0200,
  ADC12IE10       = 0x0400,
  ADC12IE11       = 0x0800,
  ADC12IE12       = 0x1000,
  ADC12IE13       = 0x2000,
  ADC12IE14       = 0x4000,
  ADC12IE15       = 0x8000
};

__no_init volatile union
{
  unsigned short ADC12IV;   /* ADC12+ Interrupt Vector Word */
  struct
  {
    unsigned char ADC12IV_L;
    unsigned char ADC12IV_H;
  };
} @0x070E;

__no_init volatile union
{
  unsigned short ADC12MEM0;   /* ADC12 Conversion Memory 0 */
  struct
  {
    unsigned char ADC12MEM0_L;
    unsigned char ADC12MEM0_H;
  };
} @0x0720;

__no_init volatile union
{
  unsigned short ADC12MEM1;   /* ADC12 Conversion Memory 1 */
  struct
  {
    unsigned char ADC12MEM1_L;
    unsigned char ADC12MEM1_H;
  };
} @0x0722;

__no_init volatile union
{
  unsigned short ADC12MEM2;   /* ADC12 Conversion Memory 2 */
  struct
  {
    unsigned char ADC12MEM2_L;
    unsigned char ADC12MEM2_H;
  };
} @0x0724;

__no_init volatile union
{
  unsigned short ADC12MEM3;   /* ADC12 Conversion Memory 3 */
  struct
  {
    unsigned char ADC12MEM3_L;
    unsigned char ADC12MEM3_H;
  };
} @0x0726;

__no_init volatile union
{
  unsigned short ADC12MEM4;   /* ADC12 Conversion Memory 4 */
  struct
  {
    unsigned char ADC12MEM4_L;
    unsigned char ADC12MEM4_H;
  };
} @0x0728;

