snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short ADC12MEM5;   /* ADC12 Conversion Memory 5 */
  struct
  {
    unsigned char ADC12MEM5_L;
    unsigned char ADC12MEM5_H;
  };
} @0x072A;

__no_init volatile union
{
  unsigned short ADC12MEM6;   /* ADC12 Conversion Memory 6 */
  struct
  {
    unsigned char ADC12MEM6_L;
    unsigned char ADC12MEM6_H;
  };
} @0x072C;

__no_init volatile union
{
  unsigned short ADC12MEM7;   /* ADC12 Conversion Memory 7 */
  struct
  {
    unsigned char ADC12MEM7_L;
    unsigned char ADC12MEM7_H;
  };
} @0x072E;

__no_init volatile union
{
  unsigned short ADC12MEM8;   /* ADC12 Conversion Memory 8 */
  struct
  {
    unsigned char ADC12MEM8_L;
    unsigned char ADC12MEM8_H;
  };
} @0x0730;

__no_init volatile union
{
  unsigned short ADC12MEM9;   /* ADC12 Conversion Memory 9 */
  struct
  {
    unsigned char ADC12MEM9_L;
    unsigned char ADC12MEM9_H;
  };
} @0x0732;

__no_init volatile union
{
  unsigned short ADC12MEM10;   /* ADC12 Conversion Memory 10 */
  struct
  {
    unsigned char ADC12MEM10_L;
    unsigned char ADC12MEM10_H;
  };
} @0x0734;

__no_init volatile union
{
  unsigned short ADC12MEM11;   /* ADC12 Conversion Memory 11 */
  struct
  {
    unsigned char ADC12MEM11_L;
    unsigned char ADC12MEM11_H;
  };
} @0x0736;

__no_init volatile union
{
  unsigned short ADC12MEM12;   /* ADC12 Conversion Memory 12 */
  struct
  {
    unsigned char ADC12MEM12_L;
    unsigned char ADC12MEM12_H;
  };
} @0x0738;

__no_init volatile union
{
  unsigned short ADC12MEM13;   /* ADC12 Conversion Memory 13 */
  struct
  {
    unsigned char ADC12MEM13_L;
    unsigned char ADC12MEM13_H;
  };
} @0x073A;

__no_init volatile union
{
  unsigned short ADC12MEM14;   /* ADC12 Conversion Memory 14 */
  struct
  {
    unsigned char ADC12MEM14_L;
    unsigned char ADC12MEM14_H;
  };
} @0x073C;

__no_init volatile union
{
  unsigned short ADC12MEM15;   /* ADC12 Conversion Memory 15 */
  struct
  {
    unsigned char ADC12MEM15_L;
    unsigned char ADC12MEM15_H;
  };
} @0x073E;


__no_init volatile union
{
  unsigned char ADC12MCTL0;   /* ADC12 Memory Control 0 */

  struct
  {
    unsigned char ADC12INCH0      : 1; /* ADC12 Input Channel Select Bit 0 */
    unsigned char ADC12INCH1      : 1; /* ADC12 Input Channel Select Bit 1 */
    unsigned char ADC12INCH2      : 1; /* ADC12 Input Channel Select Bit 2 */
    unsigned char ADC12INCH3      : 1; /* ADC12 Input Channel Select Bit 3 */
    unsigned char ADC12SREF0      : 1; /* ADC12 Select Reference Bit 0 */
    unsigned char ADC12SREF1      : 1; /* ADC12 Select Reference Bit 1 */
    unsigned char ADC12SREF2      : 1; /* ADC12 Select Reference Bit 2 */
    unsigned char ADC12EOS        : 1; /* ADC12 End of Sequence */
  }ADC12MCTL0_bit;
} @0x0710;


enum {
  ADC12INCH0      = 0x0001,
  ADC12INCH1      = 0x0002,
  ADC12INCH2      = 0x0004,
  ADC12INCH3      = 0x0008,
  ADC12SREF0      = 0x0010,
  ADC12SREF1      = 0x0020,
  ADC12SREF2      = 0x0040,
  ADC12EOS        = 0x0080
};


__no_init volatile union
{
  unsigned char ADC12MCTL1;   /* ADC12 Memory Control 1 */

  struct
  {
    unsigned char ADC12INCH0      : 1; /* ADC12 Input Channel Select Bit 0 */
    unsigned char ADC12INCH1      : 1; /* ADC12 Input Channel Select Bit 1 */
    unsigned char ADC12INCH2      : 1; /* ADC12 Input Channel Select Bit 2 */
    unsigned char ADC12INCH3      : 1; /* ADC12 Input Channel Select Bit 3 */
    unsigned char ADC12SREF0      : 1; /* ADC12 Select Reference Bit 0 */
    unsigned char ADC12SREF1      : 1; /* ADC12 Select Reference Bit 1 */
    unsigned char ADC12SREF2      : 1; /* ADC12 Select Reference Bit 2 */
    unsigned char ADC12EOS        : 1; /* ADC12 End of Sequence */
  }ADC12MCTL1_bit;
} @0x0711;


/*
enum {
  ADC12INCH0      = 0x0001,
  ADC12INCH1      = 0x0002,
  ADC12INCH2      = 0x0004,
  ADC12INCH3      = 0x0008,
  ADC12SREF0      = 0x0010,
  ADC12SREF1      = 0x0020,
  ADC12SREF2      = 0x0040,
  ADC12EOS        = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL2;   /* ADC12 Memory Control 2 */

  struct
  {
    unsigned char ADC12INCH0      : 1; /* ADC12 Input Channel Select Bit 0 */
    unsigned char ADC12INCH1      : 1; /* ADC12 Input Channel Select Bit 1 */
    unsigned char ADC12INCH2      : 1; /* ADC12 Input Channel Select Bit 2 */
    unsigned char ADC12INCH3      : 1; /* ADC12 Input Channel Select Bit 3 */
    unsigned char ADC12SREF0      : 1; /* ADC12 Select Reference Bit 0 */
    unsigned char ADC12SREF1      : 1; /* ADC12 Select Reference Bit 1 */
    unsigned char ADC12SREF2      : 1; /* ADC12 Select Reference Bit 2 */
    unsigned char ADC12EOS        : 1; /* ADC12 End of Sequence */
  }ADC12MCTL2_bit;
} @0x0712;


/*
enum {
  ADC12INCH0      = 0x0001,
  ADC12INCH1      = 0x0002,
  ADC12INCH2      = 0x0004,
  ADC12INCH3      = 0x0008,
  ADC12SREF0      = 0x0010,
  ADC12SREF1      = 0x0020,
  ADC12SREF2      = 0x0040,
  ADC12EOS        = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL3;   /* ADC12 Memory Control 3 */

  struct
  {
    unsigned char ADC12INCH0      : 1; /* ADC12 Input Channel Select Bit 0 */
    unsigned char ADC12INCH1      : 1; /* ADC12 Input Channel Select Bit 1 */
    unsigned char ADC12INCH2      : 1; /* ADC12 Input Channel Select Bit 2 */
    unsigned char ADC12INCH3      : 1; /* ADC12 Input Channel Select Bit 3 */
    unsigned char ADC12SREF0      : 1; /* ADC12 Select Reference Bit 0 */
    unsigned char ADC12SREF1      : 1; /* ADC12 Select Reference Bit 1 */
    unsigned char ADC12SREF2      : 1; /* ADC12 Select Reference Bit 2 */
    unsigned char ADC12EOS        : 1; /* ADC12 End of Sequence */
  }ADC12MCTL3_bit;
} @0x0713;


/*
enum {
  ADC12INCH0      = 0x0001,
  ADC12INCH1      = 0x0002,
  ADC12INCH2      = 0x0004,
  ADC12INCH3      = 0x0008,
  ADC12SREF0      = 0x0010,
  ADC12SREF1      = 0x0020,
  ADC12SREF2      = 0x0040,
  ADC12EOS        = 0x0080,
};

*/

