snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned char ADC12MCTL4;   /* ADC12 Memory Control 4 */

  struct
  {
    unsigned char ADC12INCH0      : 1; /* ADC12 Input Channel Select Bit 0 */
    unsigned char ADC12INCH1      : 1; /* ADC12 Input Channel Select Bit 1 */
    unsigned char ADC12INCH2      : 1; /* ADC12 Input Channel Select Bit 2 */
    unsigned char ADC12INCH3      : 1; /* ADC12 Input Channel Select Bit 3 */
    unsigned char ADC12SREF0      : 1; /* ADC12 Select Reference Bit 0 */
    unsigned char ADC12SREF1      : 1; /* ADC12 Select Reference Bit 1 */
    unsigned char ADC12SREF2      : 1; /* ADC12 Select Reference Bit 2 */
    unsigned char ADC12EOS        : 1; /* ADC12 End of Sequence */
  }ADC12MCTL4_bit;
} @0x0714;


/*
enum {
  ADC12INCH0      = 0x0001,
  ADC12INCH1      = 0x0002,
  ADC12INCH2      = 0x0004,
  ADC12INCH3      = 0x0008,
  ADC12SREF0      = 0x0010,
  ADC12SREF1      = 0x0020,
  ADC12SREF2      = 0x0040,
  ADC12EOS        = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL5;   /* ADC12 Memory Control 5 */

  struct
  {
    unsigned char ADC12INCH0      : 1; /* ADC12 Input Channel Select Bit 0 */
    unsigned char ADC12INCH1      : 1; /* ADC12 Input Channel Select Bit 1 */
    unsigned char ADC12INCH2      : 1; /* ADC12 Input Channel Select Bit 2 */
    unsigned char ADC12INCH3      : 1; /* ADC12 Input Channel Select Bit 3 */
    unsigned char ADC12SREF0      : 1; /* ADC12 Select Reference Bit 0 */
    unsigned char ADC12SREF1      : 1; /* ADC12 Select Reference Bit 1 */
    unsigned char ADC12SREF2      : 1; /* ADC12 Select Reference Bit 2 */
    unsigned char ADC12EOS        : 1; /* ADC12 End of Sequence */
  }ADC12MCTL5_bit;
} @0x0715;


/*
enum {
  ADC12INCH0      = 0x0001,
  ADC12INCH1      = 0x0002,
  ADC12INCH2      = 0x0004,
  ADC12INCH3      = 0x0008,
  ADC12SREF0      = 0x0010,
  ADC12SREF1      = 0x0020,
  ADC12SREF2      = 0x0040,
  ADC12EOS        = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL6;   /* ADC12 Memory Control 6 */

  struct
  {
    unsigned char ADC12INCH0      : 1; /* ADC12 Input Channel Select Bit 0 */
    unsigned char ADC12INCH1      : 1; /* ADC12 Input Channel Select Bit 1 */
    unsigned char ADC12INCH2      : 1; /* ADC12 Input Channel Select Bit 2 */
    unsigned char ADC12INCH3      : 1; /* ADC12 Input Channel Select Bit 3 */
    unsigned char ADC12SREF0      : 1; /* ADC12 Select Reference Bit 0 */
    unsigned char ADC12SREF1      : 1; /* ADC12 Select Reference Bit 1 */
    unsigned char ADC12SREF2      : 1; /* ADC12 Select Reference Bit 2 */
    unsigned char ADC12EOS        : 1; /* ADC12 End of Sequence */
  }ADC12MCTL6_bit;
} @0x0716;


/*
enum {
  ADC12INCH0      = 0x0001,
  ADC12INCH1      = 0x0002,
  ADC12INCH2      = 0x0004,
  ADC12INCH3      = 0x0008,
  ADC12SREF0      = 0x0010,
  ADC12SREF1      = 0x0020,
  ADC12SREF2      = 0x0040,
  ADC12EOS        = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL7;   /* ADC12 Memory Control 7 */

  struct
  {
    unsigned char ADC12INCH0      : 1; /* ADC12 Input Channel Select Bit 0 */
    unsigned char ADC12INCH1      : 1; /* ADC12 Input Channel Select Bit 1 */
    unsigned char ADC12INCH2      : 1; /* ADC12 Input Channel Select Bit 2 */
    unsigned char ADC12INCH3      : 1; /* ADC12 Input Channel Select Bit 3 */
    unsigned char ADC12SREF0      : 1; /* ADC12 Select Reference Bit 0 */
    unsigned char ADC12SREF1      : 1; /* ADC12 Select Reference Bit 1 */
    unsigned char ADC12SREF2      : 1; /* ADC12 Select Reference Bit 2 */
    unsigned char ADC12EOS        : 1; /* ADC12 End of Sequence */
  }ADC12MCTL7_bit;
} @0x0717;


/*
enum {
  ADC12INCH0      = 0x0001,
  ADC12INCH1      = 0x0002,
  ADC12INCH2      = 0x0004,
  ADC12INCH3      = 0x0008,
  ADC12SREF0      = 0x0010,
  ADC12SREF1      = 0x0020,
  ADC12SREF2      = 0x0040,
  ADC12EOS        = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL8;   /* ADC12 Memory Control 8 */

  struct
  {
    unsigned char ADC12INCH0      : 1; /* ADC12 Input Channel Select Bit 0 */
    unsigned char ADC12INCH1      : 1; /* ADC12 Input Channel Select Bit 1 */
    unsigned char ADC12INCH2      : 1; /* ADC12 Input Channel Select Bit 2 */
    unsigned char ADC12INCH3      : 1; /* ADC12 Input Channel Select Bit 3 */
    unsigned char ADC12SREF0      : 1; /* ADC12 Select Reference Bit 0 */
    unsigned char ADC12SREF1      : 1; /* ADC12 Select Reference Bit 1 */
    unsigned char ADC12SREF2      : 1; /* ADC12 Select Reference Bit 2 */
    unsigned char ADC12EOS        : 1; /* ADC12 End of Sequence */
  }ADC12MCTL8_bit;
} @0x0718;


/*
enum {
  ADC12INCH0      = 0x0001,
  ADC12INCH1      = 0x0002,
  ADC12INCH2      = 0x0004,
  ADC12INCH3      = 0x0008,
  ADC12SREF0      = 0x0010,
  ADC12SREF1      = 0x0020,
  ADC12SREF2      = 0x0040,
  ADC12EOS        = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL9;   /* ADC12 Memory Control 9 */

  struct
  {
    unsigned char ADC12INCH0      : 1; /* ADC12 Input Channel Select Bit 0 */
    unsigned char ADC12INCH1      : 1; /* ADC12 Input Channel Select Bit 1 */
    unsigned char ADC12INCH2      : 1; /* ADC12 Input Channel Select Bit 2 */
    unsigned char ADC12INCH3      : 1; /* ADC12 Input Channel Select Bit 3 */
    unsigned char ADC12SREF0      : 1; /* ADC12 Select Reference Bit 0 */
    unsigned char ADC12SREF1      : 1; /* ADC12 Select Reference Bit 1 */
    unsigned char ADC12SREF2      : 1; /* ADC12 Select Reference Bit 2 */
    unsigned char ADC12EOS        : 1; /* ADC12 End of Sequence */
  }ADC12MCTL9_bit;
} @0x0719;


/*
enum {
  ADC12INCH0      = 0x0001,
  ADC12INCH1      = 0x0002,
  ADC12INCH2      = 0x0004,
  ADC12INCH3      = 0x0008,
  ADC12SREF0      = 0x0010,
  ADC12SREF1      = 0x0020,
  ADC12SREF2      = 0x0040,
  ADC12EOS        = 0x0080,
};

*/

