snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned char ADC12MCTL10;   /* ADC12 Memory Control 10 */

  struct
  {
    unsigned char ADC12INCH0      : 1; /* ADC12 Input Channel Select Bit 0 */
    unsigned char ADC12INCH1      : 1; /* ADC12 Input Channel Select Bit 1 */
    unsigned char ADC12INCH2      : 1; /* ADC12 Input Channel Select Bit 2 */
    unsigned char ADC12INCH3      : 1; /* ADC12 Input Channel Select Bit 3 */
    unsigned char ADC12SREF0      : 1; /* ADC12 Select Reference Bit 0 */
    unsigned char ADC12SREF1      : 1; /* ADC12 Select Reference Bit 1 */
    unsigned char ADC12SREF2      : 1; /* ADC12 Select Reference Bit 2 */
    unsigned char ADC12EOS        : 1; /* ADC12 End of Sequence */
  }ADC12MCTL10_bit;
} @0x071A;


/*
enum {
  ADC12INCH0      = 0x0001,
  ADC12INCH1      = 0x0002,
  ADC12INCH2      = 0x0004,
  ADC12INCH3      = 0x0008,
  ADC12SREF0      = 0x0010,
  ADC12SREF1      = 0x0020,
  ADC12SREF2      = 0x0040,
  ADC12EOS        = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL11;   /* ADC12 Memory Control 11 */

  struct
  {
    unsigned char ADC12INCH0      : 1; /* ADC12 Input Channel Select Bit 0 */
    unsigned char ADC12INCH1      : 1; /* ADC12 Input Channel Select Bit 1 */
    unsigned char ADC12INCH2      : 1; /* ADC12 Input Channel Select Bit 2 */
    unsigned char ADC12INCH3      : 1; /* ADC12 Input Channel Select Bit 3 */
    unsigned char ADC12SREF0      : 1; /* ADC12 Select Reference Bit 0 */
    unsigned char ADC12SREF1      : 1; /* ADC12 Select Reference Bit 1 */
    unsigned char ADC12SREF2      : 1; /* ADC12 Select Reference Bit 2 */
    unsigned char ADC12EOS        : 1; /* ADC12 End of Sequence */
  }ADC12MCTL11_bit;
} @0x071B;


/*
enum {
  ADC12INCH0      = 0x0001,
  ADC12INCH1      = 0x0002,
  ADC12INCH2      = 0x0004,
  ADC12INCH3      = 0x0008,
  ADC12SREF0      = 0x0010,
  ADC12SREF1      = 0x0020,
  ADC12SREF2      = 0x0040,
  ADC12EOS        = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL12;   /* ADC12 Memory Control 12 */

  struct
  {
    unsigned char ADC12INCH0      : 1; /* ADC12 Input Channel Select Bit 0 */
    unsigned char ADC12INCH1      : 1; /* ADC12 Input Channel Select Bit 1 */
    unsigned char ADC12INCH2      : 1; /* ADC12 Input Channel Select Bit 2 */
    unsigned char ADC12INCH3      : 1; /* ADC12 Input Channel Select Bit 3 */
    unsigned char ADC12SREF0      : 1; /* ADC12 Select Reference Bit 0 */
    unsigned char ADC12SREF1      : 1; /* ADC12 Select Reference Bit 1 */
    unsigned char ADC12SREF2      : 1; /* ADC12 Select Reference Bit 2 */
    unsigned char ADC12EOS        : 1; /* ADC12 End of Sequence */
  }ADC12MCTL12_bit;
} @0x071C;


/*
enum {
  ADC12INCH0      = 0x0001,
  ADC12INCH1      = 0x0002,
  ADC12INCH2      = 0x0004,
  ADC12INCH3      = 0x0008,
  ADC12SREF0      = 0x0010,
  ADC12SREF1      = 0x0020,
  ADC12SREF2      = 0x0040,
  ADC12EOS        = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL13;   /* ADC12 Memory Control 13 */

  struct
  {
    unsigned char ADC12INCH0      : 1; /* ADC12 Input Channel Select Bit 0 */
    unsigned char ADC12INCH1      : 1; /* ADC12 Input Channel Select Bit 1 */
    unsigned char ADC12INCH2      : 1; /* ADC12 Input Channel Select Bit 2 */
    unsigned char ADC12INCH3      : 1; /* ADC12 Input Channel Select Bit 3 */
    unsigned char ADC12SREF0      : 1; /* ADC12 Select Reference Bit 0 */
    unsigned char ADC12SREF1      : 1; /* ADC12 Select Reference Bit 1 */
    unsigned char ADC12SREF2      : 1; /* ADC12 Select Reference Bit 2 */
    unsigned char ADC12EOS        : 1; /* ADC12 End of Sequence */
  }ADC12MCTL13_bit;
} @0x071D;


/*
enum {
  ADC12INCH0      = 0x0001,
  ADC12INCH1      = 0x0002,
  ADC12INCH2      = 0x0004,
  ADC12INCH3      = 0x0008,
  ADC12SREF0      = 0x0010,
  ADC12SREF1      = 0x0020,
  ADC12SREF2      = 0x0040,
  ADC12EOS        = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL14;   /* ADC12 Memory Control 14 */

  struct
  {
    unsigned char ADC12INCH0      : 1; /* ADC12 Input Channel Select Bit 0 */
    unsigned char ADC12INCH1      : 1; /* ADC12 Input Channel Select Bit 1 */
    unsigned char ADC12INCH2      : 1; /* ADC12 Input Channel Select Bit 2 */
    unsigned char ADC12INCH3      : 1; /* ADC12 Input Channel Select Bit 3 */
    unsigned char ADC12SREF0      : 1; /* ADC12 Select Reference Bit 0 */
    unsigned char ADC12SREF1      : 1; /* ADC12 Select Reference Bit 1 */
    unsigned char ADC12SREF2      : 1; /* ADC12 Select Reference Bit 2 */
    unsigned char ADC12EOS        : 1; /* ADC12 End of Sequence */
  }ADC12MCTL14_bit;
} @0x071E;


/*
enum {
  ADC12INCH0      = 0x0001,
  ADC12INCH1      = 0x0002,
  ADC12INCH2      = 0x0004,
  ADC12INCH3      = 0x0008,
  ADC12SREF0      = 0x0010,
  ADC12SREF1      = 0x0020,
  ADC12SREF2      = 0x0040,
  ADC12EOS        = 0x0080,
};

*/

__no_init volatile union
{
  unsigned char ADC12MCTL15;   /* ADC12 Memory Control 15 */

  struct
  {
    unsigned char ADC12INCH0      : 1; /* ADC12 Input Channel Select Bit 0 */
    unsigned char ADC12INCH1      : 1; /* ADC12 Input Channel Select Bit 1 */
    unsigned char ADC12INCH2      : 1; /* ADC12 Input Channel Select Bit 2 */
    unsigned char ADC12INCH3      : 1; /* ADC12 Input Channel Select Bit 3 */
    unsigned char ADC12SREF0      : 1; /* ADC12 Select Reference Bit 0 */
    unsigned char ADC12SREF1      : 1; /* ADC12 Select Reference Bit 1 */
    unsigned char ADC12SREF2      : 1; /* ADC12 Select Reference Bit 2 */
    unsigned char ADC12EOS        : 1; /* ADC12 End of Sequence */
  }ADC12MCTL15_bit;
} @ 0x071F;


/*
enum {
  ADC12INCH0      = 0x0001,
  ADC12INCH1      = 0x0002,
  ADC12INCH2      = 0x0004,
  ADC12INCH3      = 0x0008,
  ADC12SREF0      = 0x0010,
  ADC12SREF1      = 0x0020,
  ADC12SREF2      = 0x0040,
  ADC12EOS        = 0x0080
};
*/



#define __MSP430_HAS_ADC12_PLUS__     /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_ADC12_PLUS__ 0x0700
#define ADC12_A_BASE __MSP430_BASEADDRESS_ADC12_PLUS__
#define ADC12MEM_           ADC12MEM  /* ADC12 Conversion Memory */
#ifndef __IAR_SYSTEMS_ICC__
#define ADC12MEM            ADC12MEM0 /* ADC12 Conversion Memory (for assembler) */
#else
#define ADC12MEM            ((int*) &ADC12MEM0) /* ADC12 Conversion Memory (for C) */
#endif
#define ADC12MCTL_          ADC12MCTL /* ADC12 Memory Control */
#ifndef __IAR_SYSTEMS_ICC__
#define ADC12MCTL           ADC12MCTL0 /* ADC12 Memory Control (for assembler) */
#else
#define ADC12MCTL           ((char*) &ADC12MCTL0) /* ADC12 Memory Control (for C) */
#endif
/* ADC12CTL0 Control Bits */
#define ADC12SC_L           (0x0001u)  /* ADC12 Start Conversion */
#define ADC12ENC_L          (0x0002u)  /* ADC12 Enable Conversion */
#define ADC12TOVIE_L        (0x0004u)  /* ADC12 Timer Overflow interrupt enable */
#define ADC12OVIE_L         (0x0008u)  /* ADC12 Overflow interrupt enable */
#define ADC12ON_L           (0x0010u)  /* ADC12 On/enable */
#define ADC12REFON_L        (0x0020u)  /* ADC12 Reference on */
#define ADC12REF2_5V_L      (0x0040u)  /* ADC12 Ref 0:1.5V / 1:2.5V */
#define ADC12MSC_L          (0x0080u)  /* ADC12 Multiple SampleConversion */
/* ADC12CTL0 Control Bits */
#define ADC12SHT00_H        (0x0001u)  /* ADC12 Sample Hold 0 Select Bit: 0 */
#define ADC12SHT01_H        (0x0002u)  /* ADC12 Sample Hold 0 Select Bit: 1 */
#define ADC12SHT02_H        (0x0004u)  /* ADC12 Sample Hold 0 Select Bit: 2 */
#define ADC12SHT03_H        (0x0008u)  /* ADC12 Sample Hold 0 Select Bit: 3 */
#define ADC12SHT10_H        (0x0010u)  /* ADC12 Sample Hold 1 Select Bit: 0 */
#define ADC12SHT11_H        (0x0020u)  /* ADC12 Sample Hold 1 Select Bit: 1 */
#define ADC12SHT12_H        (0x0040u)  /* ADC12 Sample Hold 1 Select Bit: 2 */
#define ADC12SHT13_H        (0x0080u)  /* ADC12 Sample Hold 1 Select Bit: 3 */

#define ADC12SHT0_0         (0*0x100u)  /* ADC12 Sample Hold 0 Select Bit: 0 */
#define ADC12SHT0_1         (1*0x100u)  /* ADC12 Sample Hold 0 Select Bit: 1 */
#define ADC12SHT0_2         (2*0x100u)  /* ADC12 Sample Hold 0 Select Bit: 2 */
#define ADC12SHT0_3         (3*0x100u)  /* ADC12 Sample Hold 0 Select Bit: 3 */
#define ADC12SHT0_4         (4*0x100u)  /* ADC12 Sample Hold 0 Select Bit: 4 */
#define ADC12SHT0_5         (5*0x100u)  /* ADC12 Sample Hold 0 Select Bit: 5 */
#define ADC12SHT0_6         (6*0x100u)  /* ADC12 Sample Hold 0 Select Bit: 6 */
#define ADC12SHT0_7         (7*0x100u)  /* ADC12 Sample Hold 0 Select Bit: 7 */
#define ADC12SHT0_8         (8*0x100u)  /* ADC12 Sample Hold 0 Select Bit: 8 */
#define ADC12SHT0_9         (9*0x100u)  /* ADC12 Sample Hold 0 Select Bit: 9 */
#define ADC12SHT0_10        (10*0x100u) /* ADC12 Sample Hold 0 Select Bit: 10 */
#define ADC12SHT0_11        (11*0x100u) /* ADC12 Sample Hold 0 Select Bit: 11 */
#define ADC12SHT0_12        (12*0x100u) /* ADC12 Sample Hold 0 Select Bit: 12 */
#define ADC12SHT0_13        (13*0x100u) /* ADC12 Sample Hold 0 Select Bit: 13 */
#define ADC12SHT0_14        (14*0x100u) /* ADC12 Sample Hold 0 Select Bit: 14 */
#define ADC12SHT0_15        (15*0x100u) /* ADC12 Sample Hold 0 Select Bit: 15 */

#define ADC12SHT1_0         (0*0x1000u)  /* ADC12 Sample Hold 1 Select Bit: 0 */
#define ADC12SHT1_1         (1*0x1000u)  /* ADC12 Sample Hold 1 Select Bit: 1 */
#define ADC12SHT1_2         (2*0x1000u)  /* ADC12 Sample Hold 1 Select Bit: 2 */
#define ADC12SHT1_3         (3*0x1000u)  /* ADC12 Sample Hold 1 Select Bit: 3 */
#define ADC12SHT1_4         (4*0x1000u)  /* ADC12 Sample Hold 1 Select Bit: 4 */
#define ADC12SHT1_5         (5*0x1000u)  /* ADC12 Sample Hold 1 Select Bit: 5 */
#define ADC12SHT1_6         (6*0x1000u)  /* ADC12 Sample Hold 1 Select Bit: 6 */
#define ADC12SHT1_7         (7*0x1000u)  /* ADC12 Sample Hold 1 Select Bit: 7 */
#define ADC12SHT1_8         (8*0x1000u)  /* ADC12 Sample Hold 1 Select Bit: 8 */
#define ADC12SHT1_9         (9*0x1000u)  /* ADC12 Sample Hold 1 Select Bit: 9 */
#define ADC12SHT1_10        (10*0x1000u) /* ADC12 Sample Hold 1 Select Bit: 10 */
#define ADC12SHT1_11        (11*0x1000u) /* ADC12 Sample Hold 1 Select Bit: 11 */
#define ADC12SHT1_12        (12*0x1000u) /* ADC12 Sample Hold 1 Select Bit: 12 */
#define ADC12SHT1_13        (13*0x1000u) /* ADC12 Sample Hold 1 Select Bit: 13 */
#define ADC12SHT1_14        (14*0x1000u) /* ADC12 Sample Hold 1 Select Bit: 14 */
#define ADC12SHT1_15        (15*0x1000u) /* ADC12 Sample Hold 1 Select Bit: 15 */
/* ADC12CTL1 Control Bits */
#define ADC12BUSY_L         (0x0001u)    /* ADC12 Busy */
#define ADC12CONSEQ0_L      (0x0002u)    /* ADC12 Conversion Sequence Select Bit: 0 */
#define ADC12CONSEQ1_L      (0x0004u)    /* ADC12 Conversion Sequence Select Bit: 1 */
#define ADC12SSEL0_L        (0x0008u)    /* ADC12 Clock Source Select Bit: 0 */
#define ADC12SSEL1_L        (0x0010u)    /* ADC12 Clock Source Select Bit: 1 */
#define ADC12DIV0_L         (0x0020u)    /* ADC12 Clock Divider Select Bit: 0 */
#define ADC12DIV1_L         (0x0040u)    /* ADC12 Clock Divider Select Bit: 1 */
#define ADC12DIV2_L         (0x0080u)    /* ADC12 Clock Divider Select Bit: 2 */
/* ADC12CTL1 Control Bits */
#define ADC12ISSH_H         (0x0001u)    /* ADC12 Invert Sample Hold Signal */
#define ADC12SHP_H          (0x0002u)    /* ADC12 Sample/Hold Pulse Mode */
#define ADC12SHS0_H         (0x0004u)    /* ADC12 Sample/Hold Source Bit: 0 */
#define ADC12SHS1_H         (0x0008u)    /* ADC12 Sample/Hold Source Bit: 1 */
#define ADC12CSTARTADD0_H   (0x0010u)    /* ADC12 Conversion Start Address Bit: 0 */
#define ADC12CSTARTADD1_H   (0x0020u)    /* ADC12 Conversion Start Address Bit: 1 */
#define ADC12CSTARTADD2_H   (0x0040u)    /* ADC12 Conversion Start Address Bit: 2 */
#define ADC12CSTARTADD3_H   (0x0080u)    /* ADC12 Conversion Start Address Bit: 3 */

#define ADC12CONSEQ_0        (0*2u)      /* ADC12 Conversion Sequence Select: 0 */
#define ADC12CONSEQ_1        (1*2u)      /* ADC12 Conversion Sequence Select: 1 */
#define ADC12CONSEQ_2        (2*2u)      /* ADC12 Conversion Sequence Select: 2 */
#define ADC12CONSEQ_3        (3*2u)      /* ADC12 Conversion Sequence Select: 3 */

#define ADC12SSEL_0          (0*8u)      /* ADC12 Clock Source Select: 0 */
#define ADC12SSEL_1          (1*8u)      /* ADC12 Clock Source Select: 1 */
#define ADC12SSEL_2          (2*8u)      /* ADC12 Clock Source Select: 2 */
#define ADC12SSEL_3          (3*8u)      /* ADC12 Clock Source Select: 3 */

#define ADC12DIV_0           (0*0x20u)   /* ADC12 Clock Divider Select: 0 */
#define ADC12DIV_1           (1*0x20u)   /* ADC12 Clock Divider Select: 1 */
#define ADC12DIV_2           (2*0x20u)   /* ADC12 Clock Divider Select: 2 */
#define ADC12DIV_3           (3*0x20u)   /* ADC12 Clock Divider Select: 3 */
#define ADC12DIV_4           (4*0x20u)   /* ADC12 Clock Divider Select: 4 */
#define ADC12DIV_5           (5*0x20u)   /* ADC12 Clock Divider Select: 5 */
#define ADC12DIV_6           (6*0x20u)   /* ADC12 Clock Divider Select: 6 */
#define ADC12DIV_7           (7*0x20u)   /* ADC12 Clock Divider Select: 7 */

#define ADC12SHS_0           (0*0x400u)  /* ADC12 Sample/Hold Source: 0 */
#define ADC12SHS_1           (1*0x400u)  /* ADC12 Sample/Hold Source: 1 */
#define ADC12SHS_2           (2*0x400u)  /* ADC12 Sample/Hold Source: 2 */
#define ADC12SHS_3           (3*0x400u)  /* ADC12 Sample/Hold Source: 3 */

#define ADC12CSTARTADD_0     (0*0x1000u) /* ADC12 Conversion Start Address: 0 */
#define ADC12CSTARTADD_1     (1*0x1000u) /* ADC12 Conversion Start Address: 1 */
#define ADC12CSTARTADD_2     (2*0x1000u) /* ADC12 Conversion Start Address: 2 */
#define ADC12CSTARTADD_3     (3*0x1000u) /* ADC12 Conversion Start Address: 3 */
#define ADC12CSTARTADD_4     (4*0x1000u) /* ADC12 Conversion Start Address: 4 */
#define ADC12CSTARTADD_5     (5*0x1000u) /* ADC12 Conversion Start Address: 5 */
#define ADC12CSTARTADD_6     (6*0x1000u) /* ADC12 Conversion Start Address: 6 */
#define ADC12CSTARTADD_7     (7*0x1000u) /* ADC12 Conversion Start Address: 7 */
#define ADC12CSTARTADD_8     (8*0x1000u) /* ADC12 Conversion Start Address: 8 */
#define ADC12CSTARTADD_9     (9*0x1000u) /* ADC12 Conversion Start Address: 9 */
#define ADC12CSTARTADD_10    (10*0x1000u) /* ADC12 Conversion Start Address: 10 */
#define ADC12CSTARTADD_11    (11*0x1000u) /* ADC12 Conversion Start Address: 11 */
#define ADC12CSTARTADD_12    (12*0x1000u) /* ADC12 Conversion Start Address: 12 */
#define ADC12CSTARTADD_13    (13*0x1000u) /* ADC12 Conversion Start Address: 13 */
#define ADC12CSTARTADD_14    (14*0x1000u) /* ADC12 Conversion Start Address: 14 */
#define ADC12CSTARTADD_15    (15*0x1000u) /* ADC12 Conversion Start Address: 15 */
/* ADC12CTL2 Control Bits */
#define ADC12REFBURST_L     (0x0001u)    /* ADC12+ Reference Burst */
#define ADC12REFOUT_L       (0x0002u)    /* ADC12+ Reference Out */
#define ADC12SR_L           (0x0004u)    /* ADC12+ Sampling Rate */
#define ADC12DF_L           (0x0008u)    /* ADC12+ Data Format */
#define ADC12RES0_L         (0x0010u)    /* ADC12+ Resolution Bit: 0 */
#define ADC12RES1_L         (0x0020u)    /* ADC12+ Resolution Bit: 1 */
#define ADC12TCOFF_L        (0x0080u)    /* ADC12+ Temperature Sensor Off */
/* ADC12CTL2 Control Bits */
#define ADC12PDIV_H         (0x0001u)    /* ADC12+ predivider 0:/1   1:/4 */

#define ADC12RES_0          (0x0000u)    /* ADC12+ Resolution : 8 Bit */
#define ADC12RES_1          (0x0010u)    /* ADC12+ Resolution : 10 Bit */
#define ADC12RES_2          (0x0020u)    /* ADC12+ Resolution : 12 Bit */
#define ADC12RES_3          (0x0030u)    /* ADC12+ Resolution : reserved */

#define ADC12INCH_0         (0x0000u)    /* ADC12 Input Channel 0 */
#define ADC12INCH_1         (0x0001u)    /* ADC12 Input Channel 1 */
#define ADC12INCH_2         (0x0002u)    /* ADC12 Input Channel 2 */
#define ADC12INCH_3         (0x0003u)    /* ADC12 Input Channel 3 */
#define ADC12INCH_4         (0x0004u)    /* ADC12 Input Channel 4 */
#define ADC12INCH_5         (0x0005u)    /* ADC12 Input Channel 5 */
#define ADC12INCH_6         (0x0006u)    /* ADC12 Input Channel 6 */
#define ADC12INCH_7         (0x0007u)    /* ADC12 Input Channel 7 */
#define ADC12INCH_8         (0x0008u)    /* ADC12 Input Channel 8 */
#define ADC12INCH_9         (0x0009u)    /* ADC12 Input Channel 9 */
#define ADC12INCH_10        (0x000Au)    /* ADC12 Input Channel 10 */
#define ADC12INCH_11        (0x000Bu)    /* ADC12 Input Channel 11 */
#define ADC12INCH_12        (0x000Cu)    /* ADC12 Input Channel 12 */
#define ADC12INCH_13        (0x000Du)    /* ADC12 Input Channel 13 */
#define ADC12INCH_14        (0x000Eu)    /* ADC12 Input Channel 14 */
#define ADC12INCH_15        (0x000Fu)    /* ADC12 Input Channel 15 */

#define ADC12SREF_0         (0*0x10u)    /* ADC12 Select Reference 0 */
#define ADC12SREF_1         (1*0x10u)    /* ADC12 Select Reference 1 */
#define ADC12SREF_2         (2*0x10u)    /* ADC12 Select Reference 2 */
#define ADC12SREF_3         (3*0x10u)    /* ADC12 Select Reference 3 */
#define ADC12SREF_4         (4*0x10u)    /* ADC12 Select Reference 4 */
#define ADC12SREF_5         (5*0x10u)    /* ADC12 Select Reference 5 */
#define ADC12SREF_6         (6*0x10u)    /* ADC12 Select Reference 6 */
#define ADC12SREF_7         (7*0x10u)    /* ADC12 Select Reference 7 */

#define ADC12IE0_L          (0x0001u)  /* ADC12 Memory 0 Interrupt Enable */
#define ADC12IE1_L          (0x0002u)  /* ADC12 Memory 1 Interrupt Enable */
#define ADC12IE2_L          (0x0004u)  /* ADC12 Memory 2 Interrupt Enable */
#define ADC12IE3_L          (0x0008u)  /* ADC12 Memory 3 Interrupt Enable */
#define ADC12IE4_L          (0x0010u)  /* ADC12 Memory 4 Interrupt Enable */
#define ADC12IE5_L          (0x0020u)  /* ADC12 Memory 5 Interrupt Enable */
#define ADC12IE6_L          (0x0040u)  /* ADC12 Memory 6 Interrupt Enable */
#define ADC12IE7_L          (0x0080u)  /* ADC12 Memory 7 Interrupt Enable */

#define ADC12IE8_H          (0x0001u)  /* ADC12 Memory 8 Interrupt Enable */
#define ADC12IE9_H          (0x0002u)  /* ADC12 Memory 9 Interrupt Enable */
#define ADC12IE10_H         (0x0004u)  /* ADC12 Memory 10 Interrupt Enable */
#define ADC12IE11_H         (0x0008u)  /* ADC12 Memory 11 Interrupt Enable */
#define ADC12IE12_H         (0x0010u)  /* ADC12 Memory 12 Interrupt Enable */
#define ADC12IE13_H         (0x0020u)  /* ADC12 Memory 13 Interrupt Enable */
#define ADC12IE14_H         (0x0040u)  /* ADC12 Memory 14 Interrupt Enable */
#define ADC12IE15_H         (0x0080u)  /* ADC12 Memory 15 Interrupt Enable */

