snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
#define ADC12IFG0_L         (0x0001u)  /* ADC12 Memory 0 Interrupt Flag */
#define ADC12IFG1_L         (0x0002u)  /* ADC12 Memory 1 Interrupt Flag */
#define ADC12IFG2_L         (0x0004u)  /* ADC12 Memory 2 Interrupt Flag */
#define ADC12IFG3_L         (0x0008u)  /* ADC12 Memory 3 Interrupt Flag */
#define ADC12IFG4_L         (0x0010u)  /* ADC12 Memory 4 Interrupt Flag */
#define ADC12IFG5_L         (0x0020u)  /* ADC12 Memory 5 Interrupt Flag */
#define ADC12IFG6_L         (0x0040u)  /* ADC12 Memory 6 Interrupt Flag */
#define ADC12IFG7_L         (0x0080u)  /* ADC12 Memory 7 Interrupt Flag */

#define ADC12IFG8_H         (0x0001u)  /* ADC12 Memory 8 Interrupt Flag */
#define ADC12IFG9_H         (0x0002u)  /* ADC12 Memory 9 Interrupt Flag */
#define ADC12IFG10_H        (0x0004u)  /* ADC12 Memory 10 Interrupt Flag */
#define ADC12IFG11_H        (0x0008u)  /* ADC12 Memory 11 Interrupt Flag */
#define ADC12IFG12_H        (0x0010u)  /* ADC12 Memory 12 Interrupt Flag */
#define ADC12IFG13_H        (0x0020u)  /* ADC12 Memory 13 Interrupt Flag */
#define ADC12IFG14_H        (0x0040u)  /* ADC12 Memory 14 Interrupt Flag */
#define ADC12IFG15_H        (0x0080u)  /* ADC12 Memory 15 Interrupt Flag */
/* ADC12IV Definitions */
#define ADC12IV_NONE        (0x0000u)    /* No Interrupt pending */
#define ADC12IV_ADC12OVIFG  (0x0002u)    /* ADC12OVIFG */
#define ADC12IV_ADC12TOVIFG (0x0004u)    /* ADC12TOVIFG */
#define ADC12IV_ADC12IFG0   (0x0006u)    /* ADC12IFG0 */
#define ADC12IV_ADC12IFG1   (0x0008u)    /* ADC12IFG1 */
#define ADC12IV_ADC12IFG2   (0x000Au)    /* ADC12IFG2 */
#define ADC12IV_ADC12IFG3   (0x000Cu)    /* ADC12IFG3 */
#define ADC12IV_ADC12IFG4   (0x000Eu)    /* ADC12IFG4 */
#define ADC12IV_ADC12IFG5   (0x0010u)    /* ADC12IFG5 */
#define ADC12IV_ADC12IFG6   (0x0012u)    /* ADC12IFG6 */
#define ADC12IV_ADC12IFG7   (0x0014u)    /* ADC12IFG7 */
#define ADC12IV_ADC12IFG8   (0x0016u)    /* ADC12IFG8 */
#define ADC12IV_ADC12IFG9   (0x0018u)    /* ADC12IFG9 */
#define ADC12IV_ADC12IFG10  (0x001Au)    /* ADC12IFG10 */
#define ADC12IV_ADC12IFG11  (0x001Cu)    /* ADC12IFG11 */
#define ADC12IV_ADC12IFG12  (0x001Eu)    /* ADC12IFG12 */
#define ADC12IV_ADC12IFG13  (0x0020u)    /* ADC12IFG13 */
#define ADC12IV_ADC12IFG14  (0x0022u)    /* ADC12IFG14 */
#define ADC12IV_ADC12IFG15  (0x0024u)    /* ADC12IFG15 */

/*-------------------------------------------------------------------------
 *   Comparator B
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short CBCTL0;   /* Comparator B Control Register 0 */

  struct
  {
    unsigned short CBIPSEL0        : 1; /* Comp. B Pos. Channel Input Select 0 */
    unsigned short CBIPSEL1        : 1; /* Comp. B Pos. Channel Input Select 1 */
    unsigned short CBIPSEL2        : 1; /* Comp. B Pos. Channel Input Select 2 */
    unsigned short CBIPSEL3        : 1; /* Comp. B Pos. Channel Input Select 3 */
    unsigned short                : 3;
    unsigned short CBIPEN          : 1; /* Comp. B Pos. Channel Input Enable */
    unsigned short CBIMSEL0        : 1; /* Comp. B Neg. Channel Input Select 0 */
    unsigned short CBIMSEL1        : 1; /* Comp. B Neg. Channel Input Select 1 */
    unsigned short CBIMSEL2        : 1; /* Comp. B Neg. Channel Input Select 2 */
    unsigned short CBIMSEL3        : 1; /* Comp. B Neg. Channel Input Select 3 */
    unsigned short                : 3;
    unsigned short CBIMEN          : 1; /* Comp. B Neg. Channel Input Enable */
  } CBCTL0_bit;

  struct
  {
    unsigned char CBCTL0_L;
    unsigned char CBCTL0_H;
  };
} @0x08C0;

enum {
  CBIPSEL0        = 0x0001,
  CBIPSEL1        = 0x0002,
  CBIPSEL2        = 0x0004,
  CBIPSEL3        = 0x0008,
  CBIPEN          = 0x0080,
  CBIMSEL0        = 0x0100,
  CBIMSEL1        = 0x0200,
  CBIMSEL2        = 0x0400,
  CBIMSEL3        = 0x0800,
  CBIMEN          = 0x8000
};

__no_init volatile union
{
  unsigned short CBCTL1;   /* Comparator B Control Register 1 */

  struct
  {
    unsigned short CBOUT           : 1; /* Comp. B Output */
    unsigned short CBOUTPOL        : 1; /* Comp. B Output Polarity */
    unsigned short CBF             : 1; /* Comp. B Enable Output Filter */
    unsigned short CBIES           : 1; /* Comp. B Interrupt Edge Select */
    unsigned short CBSHORT         : 1; /* Comp. B Input Short */
    unsigned short CBEX            : 1; /* Comp. B Exchange Inputs */
    unsigned short CBFDLY0         : 1; /* Comp. B Filter delay Bit 0 */
    unsigned short CBFDLY1         : 1; /* Comp. B Filter delay Bit 1 */
    unsigned short CBPWRMD0        : 1; /* Comp. B Power Mode Bit 0 */
    unsigned short CBPWRMD1        : 1; /* Comp. B Power Mode Bit 1 */
    unsigned short CBON            : 1; /* Comp. B enable */
    unsigned short CBMRVL          : 1; /* Comp. B CBMRV Level */
    unsigned short CBMRVS          : 1; /* Comp. B Output selects between VREF0 or VREF */
  } CBCTL1_bit;

  struct
  {
    unsigned char CBCTL1_L;
    unsigned char CBCTL1_H;
  };
} @0x08C2;

enum {
  CBOUT           = 0x0001,
  CBOUTPOL        = 0x0002,
  CBF             = 0x0004,
  CBIES           = 0x0008,
  CBSHORT         = 0x0010,
  CBEX            = 0x0020,
  CBFDLY0         = 0x0040,
  CBFDLY1         = 0x0080,
  CBPWRMD0        = 0x0100,
  CBPWRMD1        = 0x0200,
  CBON            = 0x0400,
  CBMRVL          = 0x0800,
  CBMRVS          = 0x1000
};

__no_init volatile union
{
  unsigned short CBCTL2;   /* Comparator B Control Register 2 */

  struct
  {
    unsigned short CBREF00         : 1; /* Comp. B Reference 0 Resistor Select Bit : 0 */
    unsigned short CBREF01         : 1; /* Comp. B Reference 0 Resistor Select Bit : 1 */
    unsigned short CBREF02         : 1; /* Comp. B Reference 0 Resistor Select Bit : 2 */
    unsigned short CBREF03         : 1; /* Comp. B Reference 0 Resistor Select Bit : 3 */
    unsigned short CBREF04         : 1; /* Comp. B Reference 0 Resistor Select Bit : 4 */
    unsigned short CBRSEL          : 1; /* Comp. B Reference select */
    unsigned short CBRS0           : 1; /* Comp. B Reference Source Bit : 0 */
    unsigned short CBRS1           : 1; /* Comp. B Reference Source Bit : 1 */
    unsigned short CBREF10         : 1; /* Comp. B Reference 1 Resistor Select Bit : 0 */
    unsigned short CBREF11         : 1; /* Comp. B Reference 1 Resistor Select Bit : 1 */
    unsigned short CBREF12         : 1; /* Comp. B Reference 1 Resistor Select Bit : 2 */
    unsigned short CBREF13         : 1; /* Comp. B Reference 1 Resistor Select Bit : 3 */
    unsigned short CBREF14         : 1; /* Comp. B Reference 1 Resistor Select Bit : 4 */
    unsigned short CBREFL0         : 1; /* Comp. B Reference voltage level Bit : 0 */
    unsigned short CBREFL1         : 1; /* Comp. B Reference voltage level Bit : 1 */
    unsigned short CBREFACC        : 1; /* Comp. B Reference Accuracy */
  } CBCTL2_bit;

  struct
  {
    unsigned char CBCTL2_L;
    unsigned char CBCTL2_H;
  };
} @0x08C4;

enum {
  CBREF00         = 0x0001,
  CBREF01         = 0x0002,
  CBREF02         = 0x0004,
  CBREF03         = 0x0008,
  CBREF04         = 0x0010,
  CBRSEL          = 0x0020,
  CBRS0           = 0x0040,
  CBRS1           = 0x0080,
  CBREF10         = 0x0100,
  CBREF11         = 0x0200,
  CBREF12         = 0x0400,
  CBREF13         = 0x0800,
  CBREF14         = 0x1000,
  CBREFL0         = 0x2000,
  CBREFL1         = 0x4000,
  CBREFACC        = 0x8000
};

