snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short CBCTL3;   /* Comparator B Control Register 3 */

  struct
  {
    unsigned short CBPD0           : 1; /* Comp. B Disable Input Buffer of Port Register .0 */
    unsigned short CBPD1           : 1; /* Comp. B Disable Input Buffer of Port Register .1 */
    unsigned short CBPD2           : 1; /* Comp. B Disable Input Buffer of Port Register .2 */
    unsigned short CBPD3           : 1; /* Comp. B Disable Input Buffer of Port Register .3 */
    unsigned short CBPD4           : 1; /* Comp. B Disable Input Buffer of Port Register .4 */
    unsigned short CBPD5           : 1; /* Comp. B Disable Input Buffer of Port Register .5 */
    unsigned short CBPD6           : 1; /* Comp. B Disable Input Buffer of Port Register .6 */
    unsigned short CBPD7           : 1; /* Comp. B Disable Input Buffer of Port Register .7 */
    unsigned short CBPD8           : 1; /* Comp. B Disable Input Buffer of Port Register .8 */
    unsigned short CBPD9           : 1; /* Comp. B Disable Input Buffer of Port Register .9 */
    unsigned short CBPD10          : 1; /* Comp. B Disable Input Buffer of Port Register .10 */
    unsigned short CBPD11          : 1; /* Comp. B Disable Input Buffer of Port Register .11 */
    unsigned short CBPD12          : 1; /* Comp. B Disable Input Buffer of Port Register .12 */
    unsigned short CBPD13          : 1; /* Comp. B Disable Input Buffer of Port Register .13 */
    unsigned short CBPD14          : 1; /* Comp. B Disable Input Buffer of Port Register .14 */
    unsigned short CBPD15          : 1; /* Comp. B Disable Input Buffer of Port Register .15 */
  } CBCTL3_bit;

  struct
  {
    unsigned char CBCTL3_L;
    unsigned char CBCTL3_H;
  };
} @0x08C6;

enum {
  CBPD0           = 0x0001,
  CBPD1           = 0x0002,
  CBPD2           = 0x0004,
  CBPD3           = 0x0008,
  CBPD4           = 0x0010,
  CBPD5           = 0x0020,
  CBPD6           = 0x0040,
  CBPD7           = 0x0080,
  CBPD8           = 0x0100,
  CBPD9           = 0x0200,
  CBPD10          = 0x0400,
  CBPD11          = 0x0800,
  CBPD12          = 0x1000,
  CBPD13          = 0x2000,
  CBPD14          = 0x4000,
  CBPD15          = 0x8000
};

__no_init volatile union
{
  unsigned short CBINT;   /* Comparator B Interrupt Register */

  struct
  {
    unsigned short CBIFG           : 1; /* Comp. B Interrupt Flag */
    unsigned short CBIIFG          : 1; /* Comp. B Interrupt Flag Inverted Polarity */
    unsigned short                : 6;
    unsigned short CBIE            : 1; /* Comp. B Interrupt Enable */
    unsigned short CBIIE           : 1; /* Comp. B Interrupt Enable Inverted Polarity */
  } CBINT_bit;

  struct
  {
    unsigned char CBINT_L;
    unsigned char CBINT_H;
  };
} @0x08CC;

enum {
  CBIFG           = 0x0001,
  CBIIFG          = 0x0002,
  CBIE            = 0x0100,
  CBIIE           = 0x0200
};


  /* Comparator B Interrupt Vector Word */
__no_init volatile unsigned short CBIV @ 0x08CE;


#define __MSP430_HAS_COMPB__          /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_COMPB__ 0x08C0
#define COMP_B_BASE __MSP430_BASEADDRESS_COMPB__
/* CBCTL0 Control Bits */
#define CBIPSEL0_L          (0x0001u)  /* Comp. B Pos. Channel Input Select 0 */
#define CBIPSEL1_L          (0x0002u)  /* Comp. B Pos. Channel Input Select 1 */
#define CBIPSEL2_L          (0x0004u)  /* Comp. B Pos. Channel Input Select 2 */
#define CBIPSEL3_L          (0x0008u)  /* Comp. B Pos. Channel Input Select 3 */
#define CBIPEN_L            (0x0080u)  /* Comp. B Pos. Channel Input Enable */
#define CBIMSEL0_H          (0x0001u)  /* Comp. B Neg. Channel Input Select 0 */
#define CBIMSEL1_H          (0x0002u)  /* Comp. B Neg. Channel Input Select 1 */
#define CBIMSEL2_H          (0x0004u)  /* Comp. B Neg. Channel Input Select 2 */
#define CBIMSEL3_H          (0x0008u)  /* Comp. B Neg. Channel Input Select 3 */
#define CBIMEN_H            (0x0080u)  /* Comp. B Neg. Channel Input Enable */

#define CBIPSEL_0           (0x0000u)  /* Comp. B V+ terminal Input Select: Channel 0 */
#define CBIPSEL_1           (0x0001u)  /* Comp. B V+ terminal Input Select: Channel 1 */
#define CBIPSEL_2           (0x0002u)  /* Comp. B V+ terminal Input Select: Channel 2 */
#define CBIPSEL_3           (0x0003u)  /* Comp. B V+ terminal Input Select: Channel 3 */
#define CBIPSEL_4           (0x0004u)  /* Comp. B V+ terminal Input Select: Channel 4 */
#define CBIPSEL_5           (0x0005u)  /* Comp. B V+ terminal Input Select: Channel 5 */
#define CBIPSEL_6           (0x0006u)  /* Comp. B V+ terminal Input Select: Channel 6 */
#define CBIPSEL_7           (0x0007u)  /* Comp. B V+ terminal Input Select: Channel 7 */
#define CBIPSEL_8           (0x0008u)  /* Comp. B V+ terminal Input Select: Channel 8 */
#define CBIPSEL_9           (0x0009u)  /* Comp. B V+ terminal Input Select: Channel 9 */
#define CBIPSEL_10          (0x000Au)  /* Comp. B V+ terminal Input Select: Channel 10 */
#define CBIPSEL_11          (0x000Bu)  /* Comp. B V+ terminal Input Select: Channel 11 */
#define CBIPSEL_12          (0x000Cu)  /* Comp. B V+ terminal Input Select: Channel 12 */
#define CBIPSEL_13          (0x000Du)  /* Comp. B V+ terminal Input Select: Channel 13 */
#define CBIPSEL_14          (0x000Eu)  /* Comp. B V+ terminal Input Select: Channel 14 */
#define CBIPSEL_15          (0x000Fu)  /* Comp. B V+ terminal Input Select: Channel 15 */

#define CBIMSEL_0           (0x0000u)  /* Comp. B V- Terminal Input Select: Channel 0 */
#define CBIMSEL_1           (0x0100u)  /* Comp. B V- Terminal Input Select: Channel 1 */
#define CBIMSEL_2           (0x0200u)  /* Comp. B V- Terminal Input Select: Channel 2 */
#define CBIMSEL_3           (0x0300u)  /* Comp. B V- Terminal Input Select: Channel 3 */
#define CBIMSEL_4           (0x0400u)  /* Comp. B V- Terminal Input Select: Channel 4 */
#define CBIMSEL_5           (0x0500u)  /* Comp. B V- Terminal Input Select: Channel 5 */
#define CBIMSEL_6           (0x0600u)  /* Comp. B V- Terminal Input Select: Channel 6 */
#define CBIMSEL_7           (0x0700u)  /* Comp. B V- Terminal Input Select: Channel 7 */
#define CBIMSEL_8           (0x0800u)  /* Comp. B V- terminal Input Select: Channel 8 */
#define CBIMSEL_9           (0x0900u)  /* Comp. B V- terminal Input Select: Channel 9 */
#define CBIMSEL_10          (0x0A00u)  /* Comp. B V- terminal Input Select: Channel 10 */
#define CBIMSEL_11          (0x0B00u)  /* Comp. B V- terminal Input Select: Channel 11 */
#define CBIMSEL_12          (0x0C00u)  /* Comp. B V- terminal Input Select: Channel 12 */
#define CBIMSEL_13          (0x0D00u)  /* Comp. B V- terminal Input Select: Channel 13 */
#define CBIMSEL_14          (0x0E00u)  /* Comp. B V- terminal Input Select: Channel 14 */
#define CBIMSEL_15          (0x0F00u)  /* Comp. B V- terminal Input Select: Channel 15 */
/* CBCTL1 Control Bits */
#define CBOUT_L             (0x0001u)  /* Comp. B Output */
#define CBOUTPOL_L          (0x0002u)  /* Comp. B Output Polarity */
#define CBF_L               (0x0004u)  /* Comp. B Enable Output Filter */
#define CBIES_L             (0x0008u)  /* Comp. B Interrupt Edge Select */
#define CBSHORT_L           (0x0010u)  /* Comp. B Input Short */
#define CBEX_L              (0x0020u)  /* Comp. B Exchange Inputs */
#define CBFDLY0_L           (0x0040u)  /* Comp. B Filter delay Bit 0 */
#define CBFDLY1_L           (0x0080u)  /* Comp. B Filter delay Bit 1 */
/* CBCTL1 Control Bits */
#define CBPWRMD0_H          (0x0001u)  /* Comp. B Power Mode Bit 0 */
#define CBPWRMD1_H          (0x0002u)  /* Comp. B Power Mode Bit 1 */
#define CBON_H              (0x0004u)  /* Comp. B enable */
#define CBMRVL_H            (0x0008u)  /* Comp. B CBMRV Level */
#define CBMRVS_H            (0x0010u)  /* Comp. B Output selects between VREF0 or VREF1*/

