snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
#define CBPD0_L             (0x0001u)  /* Comp. B Disable Input Buffer of Port Register .0 */
#define CBPD1_L             (0x0002u)  /* Comp. B Disable Input Buffer of Port Register .1 */
#define CBPD2_L             (0x0004u)  /* Comp. B Disable Input Buffer of Port Register .2 */
#define CBPD3_L             (0x0008u)  /* Comp. B Disable Input Buffer of Port Register .3 */
#define CBPD4_L             (0x0010u)  /* Comp. B Disable Input Buffer of Port Register .4 */
#define CBPD5_L             (0x0020u)  /* Comp. B Disable Input Buffer of Port Register .5 */
#define CBPD6_L             (0x0040u)  /* Comp. B Disable Input Buffer of Port Register .6 */
#define CBPD7_L             (0x0080u)  /* Comp. B Disable Input Buffer of Port Register .7 */

#define CBPD8_H             (0x0001u)  /* Comp. B Disable Input Buffer of Port Register .8 */
#define CBPD9_H             (0x0002u)  /* Comp. B Disable Input Buffer of Port Register .9 */
#define CBPD10_H            (0x0004u)  /* Comp. B Disable Input Buffer of Port Register .10 */
#define CBPD11_H            (0x0008u)  /* Comp. B Disable Input Buffer of Port Register .11 */
#define CBPD12_H            (0x0010u)  /* Comp. B Disable Input Buffer of Port Register .12 */
#define CBPD13_H            (0x0020u)  /* Comp. B Disable Input Buffer of Port Register .13 */
#define CBPD14_H            (0x0040u)  /* Comp. B Disable Input Buffer of Port Register .14 */
#define CBPD15_H            (0x0080u)  /* Comp. B Disable Input Buffer of Port Register .15 */
/* CBINT Control Bits */
#define CBIFG_L             (0x0001u)  /* Comp. B Interrupt Flag */
#define CBIIFG_L            (0x0002u)  /* Comp. B Interrupt Flag Inverted Polarity */
#define CBIE_H              (0x0001u)  /* Comp. B Interrupt Enable */
#define CBIIE_H             (0x0002u)  /* Comp. B Interrupt Enable Inverted Polarity */
/* CBIV Definitions */
#define CBIV_NONE           (0x0000u)    /* No Interrupt pending */
#define CBIV_CBIFG          (0x0002u)    /* CBIFG */
#define CBIV_CBIIFG         (0x0004u)    /* CBIIFG */

/*-------------------------------------------------------------------------
 *   CRC16
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short CRCDI;   /* CRC Data In Register */
  struct
  {
    unsigned char CRCDI_L;
    unsigned char CRCDI_H;
  };
} @0x0150;

__no_init volatile union
{
  unsigned short CRCDIRB;   /* CRC data in reverse byte Register */
  struct
  {
    unsigned char CRCDIRB_L;
    unsigned char CRCDIRB_H;
  };
} @0x0152;

__no_init volatile union
{
  unsigned short CRCINIRES;   /* CRC Initialisation Register and Result Register */
  struct
  {
    unsigned char CRCINIRES_L;
    unsigned char CRCINIRES_H;
  };
} @0x0154;

__no_init volatile union
{
  unsigned short CRCRESR;   /* CRC reverse result Register */
  struct
  {
    unsigned char CRCRESR_L;
    unsigned char CRCRESR_H;
  };
} @0x0156;

#define __MSP430_HAS_CRC__            /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_CRC__ 0x0150
#define CRC_BASE __MSP430_BASEADDRESS_CRC__

/*-------------------------------------------------------------------------
 *   DMA
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short DMACTL0;   /* DMA Module Control 0 */

  struct
  {
    unsigned short DMA0TSEL0       : 1; /* DMA channel 0 transfer select bit 0 */
    unsigned short DMA0TSEL1       : 1; /* DMA channel 0 transfer select bit 1 */
    unsigned short DMA0TSEL2       : 1; /* DMA channel 0 transfer select bit 2 */
    unsigned short DMA0TSEL3       : 1; /* DMA channel 0 transfer select bit 3 */
    unsigned short DMA0TSEL4       : 1; /* DMA channel 0 transfer select bit 4 */
    unsigned short                : 3;
    unsigned short DMA1TSEL0       : 1; /* DMA channel 1 transfer select bit 0 */
    unsigned short DMA1TSEL1       : 1; /* DMA channel 1 transfer select bit 1 */
    unsigned short DMA1TSEL2       : 1; /* DMA channel 1 transfer select bit 2 */
    unsigned short DMA1TSEL3       : 1; /* DMA channel 1 transfer select bit 3 */
    unsigned short DMA1TSEL4       : 1; /* DMA channel 1 transfer select bit 4 */
  } DMACTL0_bit;

  struct
  {
    unsigned char DMACTL0_L;
    unsigned char DMACTL0_H;
  };
} @0x0500;

enum {
  DMA0TSEL0       = 0x0001,
  DMA0TSEL1       = 0x0002,
  DMA0TSEL2       = 0x0004,
  DMA0TSEL3       = 0x0008,
  DMA0TSEL4       = 0x0010,
  DMA1TSEL0       = 0x0100,
  DMA1TSEL1       = 0x0200,
  DMA1TSEL2       = 0x0400,
  DMA1TSEL3       = 0x0800,
  DMA1TSEL4       = 0x1000
};

__no_init volatile union
{
  unsigned short DMACTL1;   /* DMA Module Control 1 */

  struct
  {
    unsigned short DMA2TSEL0       : 1; /* DMA channel 2 transfer select bit 0 */
    unsigned short DMA2TSEL1       : 1; /* DMA channel 2 transfer select bit 1 */
    unsigned short DMA2TSEL2       : 1; /* DMA channel 2 transfer select bit 2 */
    unsigned short DMA2TSEL3       : 1; /* DMA channel 2 transfer select bit 3 */
    unsigned short DMA2TSEL4       : 1; /* DMA channel 2 transfer select bit 4 */
  } DMACTL1_bit;

  struct
  {
    unsigned char DMACTL1_L;
    unsigned char DMACTL1_H;
  };
} @0x0502;

enum {
  DMA2TSEL0       = 0x0001,
  DMA2TSEL1       = 0x0002,
  DMA2TSEL2       = 0x0004,
  DMA2TSEL3       = 0x0008,
  DMA2TSEL4       = 0x0010
};

__no_init volatile union
{
  unsigned short DMACTL2;   /* DMA Module Control 2 */
  struct
  {
    unsigned char DMACTL2_L;
    unsigned char DMACTL2_H;
  };
} @0x0504;

__no_init volatile union
{
  unsigned short DMACTL3;   /* DMA Module Control 3 */
  struct
  {
    unsigned char DMACTL3_L;
    unsigned char DMACTL3_H;
  };
} @0x0506;

__no_init volatile union
{
  unsigned short DMACTL4;   /* DMA Module Control 4 */

  struct
  {
    unsigned short ENNMI           : 1; /* Enable NMI interruption of DMA */
    unsigned short ROUNDROBIN      : 1; /* Round-Robin DMA channel priorities */
    unsigned short DMARMWDIS       : 1; /* Inhibited DMA transfers during read-modify-write CPU operations */
  } DMACTL4_bit;

  struct
  {
    unsigned char DMACTL4_L;
    unsigned char DMACTL4_H;
  };
} @0x0508;

enum {
  ENNMI           = 0x0001,
  ROUNDROBIN      = 0x0002,
  DMARMWDIS       = 0x0004
};

