snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short DMAIV;   /* DMA Interrupt Vector Word */
  struct
  {
    unsigned char DMAIV_L;
    unsigned char DMAIV_H;
  };
} @0x050E;

__no_init volatile union
{
  unsigned short DMA0CTL;   /* DMA Channel 0 Control */

  struct
  {
    unsigned short DMAREQ          : 1; /* Initiate DMA transfer with DMATSEL */
    unsigned short DMAABORT        : 1; /* DMA transfer aborted by NMI */
    unsigned short DMAIE           : 1; /* DMA interrupt enable */
    unsigned short DMAIFG          : 1; /* DMA interrupt flag */
    unsigned short DMAEN           : 1; /* DMA enable */
    unsigned short DMALEVEL        : 1; /* DMA level sensitive trigger select */
    unsigned short DMASRCBYTE      : 1; /* DMA source byte */
    unsigned short DMADSTBYTE      : 1; /* DMA destination byte */
    unsigned short DMASRCINCR0     : 1; /* DMA source increment bit 0 */
    unsigned short DMASRCINCR1     : 1; /* DMA source increment bit 1 */
    unsigned short DMADSTINCR0     : 1; /* DMA destination increment bit 0 */
    unsigned short DMADSTINCR1     : 1; /* DMA destination increment bit 1 */
    unsigned short DMADT0          : 1; /* DMA transfer mode bit 0 */
    unsigned short DMADT1          : 1; /* DMA transfer mode bit 1 */
    unsigned short DMADT2          : 1; /* DMA transfer mode bit 2 */
  } DMA0CTL_bit;

  struct
  {
    unsigned char DMA0CTL_L;
    unsigned char DMA0CTL_H;
  };
} @0x0510;

enum {
  DMAREQ          = 0x0001,
  DMAABORT        = 0x0002,
  DMAIE           = 0x0004,
  DMAIFG          = 0x0008,
  DMAEN           = 0x0010,
  DMALEVEL        = 0x0020,
  DMASRCBYTE      = 0x0040,
  DMADSTBYTE      = 0x0080,
  DMASRCINCR0     = 0x0100,
  DMASRCINCR1     = 0x0200,
  DMADSTINCR0     = 0x0400,
  DMADSTINCR1     = 0x0800,
  DMADT0          = 0x1000,
  DMADT1          = 0x2000,
  DMADT2          = 0x4000
};

__no_init volatile union
{
  __ACCESS_20BIT_REG__ DMA0SA;   /* DMA Channel 0 Source Address */
  struct
  {
    unsigned char DMA0SA_L;
    unsigned char DMA0SA_H;
  };
  struct
  {
    unsigned short DMA0SAL;
    unsigned short DMA0SAH;
  };
} @0x0512;

__no_init volatile union
{
  __ACCESS_20BIT_REG__ DMA0DA;   /* DMA Channel 0 Destination Address */
  struct
  {
    unsigned char DMA0DA_L;
    unsigned char DMA0DA_H;
  };
  struct
  {
    unsigned short DMA0DAL;
    unsigned short DMA0DAH;
  };
} @0x0516;


  /* DMA Channel 0 Transfer Size */
__no_init volatile unsigned short DMA0SZ @ 0x051A;


__no_init volatile union
{
  unsigned short DMA1CTL;   /* DMA Channel 1 Control */

  struct
  {
    unsigned short DMAREQ          : 1; /* Initiate DMA transfer with DMATSEL */
    unsigned short DMAABORT        : 1; /* DMA transfer aborted by NMI */
    unsigned short DMAIE           : 1; /* DMA interrupt enable */
    unsigned short DMAIFG          : 1; /* DMA interrupt flag */
    unsigned short DMAEN           : 1; /* DMA enable */
    unsigned short DMALEVEL        : 1; /* DMA level sensitive trigger select */
    unsigned short DMASRCBYTE      : 1; /* DMA source byte */
    unsigned short DMADSTBYTE      : 1; /* DMA destination byte */
    unsigned short DMASRCINCR0     : 1; /* DMA source increment bit 0 */
    unsigned short DMASRCINCR1     : 1; /* DMA source increment bit 1 */
    unsigned short DMADSTINCR0     : 1; /* DMA destination increment bit 0 */
    unsigned short DMADSTINCR1     : 1; /* DMA destination increment bit 1 */
    unsigned short DMADT0          : 1; /* DMA transfer mode bit 0 */
    unsigned short DMADT1          : 1; /* DMA transfer mode bit 1 */
    unsigned short DMADT2          : 1; /* DMA transfer mode bit 2 */
  } DMA1CTL_bit;

  struct
  {
    unsigned char DMA1CTL_L;
    unsigned char DMA1CTL_H;
  };
} @0x0520;

/*
enum {
  DMAREQ          = 0x0001,
  DMAABORT        = 0x0002,
  DMAIE           = 0x0004,
  DMAIFG          = 0x0008,
  DMAEN           = 0x0010,
  DMALEVEL        = 0x0020,
  DMASRCBYTE      = 0x0040,
  DMADSTBYTE      = 0x0080,
  DMASRCINCR0     = 0x0100,
  DMASRCINCR1     = 0x0200,
  DMADSTINCR0     = 0x0400,
  DMADSTINCR1     = 0x0800,
  DMADT0          = 0x1000,
  DMADT1          = 0x2000,
  DMADT2          = 0x4000,
};

*/
__no_init volatile union
{
  __ACCESS_20BIT_REG__ DMA1SA;   /* DMA Channel 1 Source Address */
  struct
  {
    unsigned char DMA1SA_L;
    unsigned char DMA1SA_H;
  };
  struct
  {
    unsigned short DMA1SAL;
    unsigned short DMA1SAH;
  };
} @0x0522;

__no_init volatile union
{
  __ACCESS_20BIT_REG__ DMA1DA;   /* DMA Channel 1 Destination Address */
  struct
  {
    unsigned char DMA1DA_L;
    unsigned char DMA1DA_H;
  };
  struct
  {
    unsigned short DMA1DAL;
    unsigned short DMA1DAH;
  };
} @0x0526;


  /* DMA Channel 1 Transfer Size */
__no_init volatile unsigned short DMA1SZ @ 0x052A;


__no_init volatile union
{
  unsigned short DMA2CTL;   /* DMA Channel 2 Control */

  struct
  {
    unsigned short DMAREQ          : 1; /* Initiate DMA transfer with DMATSEL */
    unsigned short DMAABORT        : 1; /* DMA transfer aborted by NMI */
    unsigned short DMAIE           : 1; /* DMA interrupt enable */
    unsigned short DMAIFG          : 1; /* DMA interrupt flag */
    unsigned short DMAEN           : 1; /* DMA enable */
    unsigned short DMALEVEL        : 1; /* DMA level sensitive trigger select */
    unsigned short DMASRCBYTE      : 1; /* DMA source byte */
    unsigned short DMADSTBYTE      : 1; /* DMA destination byte */
    unsigned short DMASRCINCR0     : 1; /* DMA source increment bit 0 */
    unsigned short DMASRCINCR1     : 1; /* DMA source increment bit 1 */
    unsigned short DMADSTINCR0     : 1; /* DMA destination increment bit 0 */
    unsigned short DMADSTINCR1     : 1; /* DMA destination increment bit 1 */
    unsigned short DMADT0          : 1; /* DMA transfer mode bit 0 */
    unsigned short DMADT1          : 1; /* DMA transfer mode bit 1 */
    unsigned short DMADT2          : 1; /* DMA transfer mode bit 2 */
  } DMA2CTL_bit;

  struct
  {
    unsigned char DMA2CTL_L;
    unsigned char DMA2CTL_H;
  };
} @0x0530;

