snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short FCTL1;   /* FLASH Control 1 */

  struct
  {
    unsigned short                : 1;
    unsigned short ERASE           : 1; /* Enable bit for Flash segment erase */
    unsigned short MERAS           : 1; /* Enable bit for Flash mass erase */
    unsigned short                : 2;
    unsigned short SWRT            : 1; /* Smart Write enable */
    unsigned short WRT             : 1; /* Enable bit for Flash write */
    unsigned short BLKWRT          : 1; /* Enable bit for Flash segment write */
  } FCTL1_bit;

  struct
  {
    unsigned char FCTL1_L;
    unsigned char FCTL1_H;
  };
} @0x0140;

enum {
  ERASE           = 0x0002,
  MERAS           = 0x0004,
  SWRT            = 0x0020,
  WRT             = 0x0040,
  BLKWRT          = 0x0080
};

__no_init volatile union
{
  unsigned short FCTL3;   /* FLASH Control 3 */

  struct
  {
    unsigned short BUSY            : 1; /* Flash busy: 1 */
    unsigned short KEYV            : 1; /* Flash Key violation flag */
    unsigned short ACCVIFG         : 1; /* Flash Access violation flag */
    unsigned short WAIT            : 1; /* Wait flag for segment write */
    unsigned short LOCK            : 1; /* Lock bit: 1 - Flash is locked (read only) */
    unsigned short EMEX            : 1; /* Flash Emergency Exit */
    unsigned short LOCKA           : 1; /* Segment A Lock bit: read = 1 - Segment is locked (read only) */
  } FCTL3_bit;

  struct
  {
    unsigned char FCTL3_L;
    unsigned char FCTL3_H;
  };
} @0x0144;

enum {
  BUSY            = 0x0001,
  KEYV            = 0x0002,
  ACCVIFG         = 0x0004,
  WAIT            = 0x0008,
  LOCK            = 0x0010,
  EMEX            = 0x0020,
  LOCKA           = 0x0040
};

__no_init volatile union
{
  unsigned short FCTL4;   /* FLASH Control 4 */

  struct
  {
    unsigned short VPE             : 1; /* Voltage Changed during Program Error Flag */
    unsigned short                : 3;
    unsigned short MGR0            : 1; /* Marginal read 0 mode. */
    unsigned short MGR1            : 1; /* Marginal read 1 mode. */
    unsigned short                : 1;
    unsigned short LOCKINFO        : 1; /* Lock INFO Memory bit: read = 1 - Segment is locked (read only) */
  } FCTL4_bit;

  struct
  {
    unsigned char FCTL4_L;
    unsigned char FCTL4_H;
  };
} @0x0146;

enum {
  VPE             = 0x0001,
  MGR0            = 0x0010,
  MGR1            = 0x0020,
  LOCKINFO        = 0x0080
};



#define __MSP430_HAS_FLASH__         /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_FLASH__ 0x0140
#define FLASH_BASE __MSP430_BASEADDRESS_FLASH__

#define FRPW                (0x9600u)  /* Flash password returned by read */
#define FWPW                (0xA500u)  /* Flash password for write */
#define FXPW                (0x3300u)  /* for use with XOR instruction */
#define FRKEY               (0x9600u)  /* (legacy definition) Flash key returned by read */
#define FWKEY               (0xA500u)  /* (legacy definition) Flash key for write */
#define FXKEY               (0x3300u)  /* (legacy definition) for use with XOR instruction */
#define ERASE_L             (0x0002u)  /* Enable bit for Flash segment erase */
#define MERAS_L             (0x0004u)  /* Enable bit for Flash mass erase */
#define SWRT_L              (0x0020u)  /* Smart Write enable */
#define WRT_L               (0x0040u)  /* Enable bit for Flash write */
#define BLKWRT_L            (0x0080u)  /* Enable bit for Flash segment write */
/* FCTL3 Control Bits */
#define BUSY_L              (0x0001u)  /* Flash busy: 1 */
#define KEYV_L              (0x0002u)  /* Flash Key violation flag */
#define ACCVIFG_L           (0x0004u)  /* Flash Access violation flag */
#define WAIT_L              (0x0008u)  /* Wait flag for segment write */
#define LOCK_L              (0x0010u)  /* Lock bit: 1 - Flash is locked (read only) */
#define EMEX_L              (0x0020u)  /* Flash Emergency Exit */
#define LOCKA_L             (0x0040u)  /* Segment A Lock bit: read = 1 - Segment is locked (read only) */
/* FCTL4 Control Bits */
#define VPE_L               (0x0001u)  /* Voltage Changed during Program Error Flag */
#define MGR0_L              (0x0010u)  /* Marginal read 0 mode. */
#define MGR1_L              (0x0020u)  /* Marginal read 1 mode. */
#define LOCKINFO_L          (0x0080u)  /* Lock INFO Memory bit: read = 1 - Segment is locked (read only) */

/*-------------------------------------------------------------------------
 *   MPY 16  Multiplier  16 Bit Mode
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short MPY;   /* Multiply Unsigned/Operand 1 */
  struct
  {
    unsigned char MPY_L;
    unsigned char MPY_H;
  };
} @0x04C0;

__no_init volatile union
{
  unsigned short MPYS;   /* Multiply Signed/Operand 1 */
  struct
  {
    unsigned char MPYS_L;
    unsigned char MPYS_H;
  };
} @0x04C2;

__no_init volatile union
{
  unsigned short MAC;   /* Multiply Unsigned and Accumulate/Operand 1 */
  struct
  {
    unsigned char MAC_L;
    unsigned char MAC_H;
  };
} @0x04C4;

__no_init volatile union
{
  unsigned short MACS;   /* Multiply Signed and Accumulate/Operand 1 */
  struct
  {
    unsigned char MACS_L;
    unsigned char MACS_H;
  };
} @0x04C6;

__no_init volatile union
{
  unsigned short OP2;   /* Operand 2 */
  struct
  {
    unsigned char OP2_L;
    unsigned char OP2_H;
  };
} @0x04C8;

__no_init volatile union
{
  unsigned short RESLO;   /* Result Low Word */
  struct
  {
    unsigned char RESLO_L;
    unsigned char RESLO_H;
  };
} @0x04CA;

__no_init volatile union
{
  unsigned short RESHI;   /* Result High Word */
  struct
  {
    unsigned char RESHI_L;
    unsigned char RESHI_H;
  };
} @0x04CC;

__no_init volatile union
{
  unsigned __READ short SUMEXT;   /* Sum Extend */
  struct
  {
    unsigned __READ char SUMEXT_L;
    unsigned __READ char SUMEXT_H;
  };
} @0x04CE;

