snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short MPY32CTL0;   /* MPY32 Control Register 0 */

  struct
  {
    unsigned short MPYC            : 1; /* Carry of the multiplier */
    unsigned short                : 1;
    unsigned short MPYFRAC         : 1; /* Fractional mode */
    unsigned short MPYSAT          : 1; /* Saturation mode */
    unsigned short MPYM0           : 1; /* Multiplier mode Bit:0 */
    unsigned short MPYM1           : 1; /* Multiplier mode Bit:1 */
    unsigned short OP1_32          : 1; /*  */
    unsigned short OP2_32          : 1; /*  */
    unsigned short MPYDLYWRTEN     : 1; /* Delayed write enable */
    unsigned short MPYDLY32        : 1; /* Delayed write mode */
  } MPY32CTL0_bit;

  struct
  {
    unsigned char MPY32CTL0_L;
    unsigned char MPY32CTL0_H;
  };
} @0x04EC;

enum {
  MPYC            = 0x0001,
  MPYFRAC         = 0x0004,
  MPYSAT          = 0x0008,
  MPYM0           = 0x0010,
  MPYM1           = 0x0020,
  OP1_32          = 0x0040,
  OP2_32          = 0x0080,
  MPYDLYWRTEN     = 0x0100,
  MPYDLY32        = 0x0200
};



#define __MSP430_HAS_MPY32__          /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_MPY32__ 0x04C0
#define MPY32_BASE __MSP430_BASEADDRESS_MPY32__

#define MPY_B               MPY_L      /* Multiply Unsigned/Operand 1 (Byte Access) */
#define MPYS_B              MPYS_L     /* Multiply Signed/Operand 1 (Byte Access) */
#define MAC_B               MAC_L      /* Multiply Unsigned and Accumulate/Operand 1 (Byte Access) */
#define MACS_B              MACS_L     /* Multiply Signed and Accumulate/Operand 1 (Byte Access) */
#define OP2_B               OP2_L      /* Operand 2 (Byte Access) */
#define MPY32L_B            MPY32L_L   /* 32-bit operand 1 - multiply - low word (Byte Access) */
#define MPY32H_B            MPY32H_L   /* 32-bit operand 1 - multiply - high word (Byte Access) */
#define MPYS32L_B           MPYS32L_L  /* 32-bit operand 1 - signed multiply - low word (Byte Access) */
#define MPYS32H_B           MPYS32H_L  /* 32-bit operand 1 - signed multiply - high word (Byte Access) */
#define MAC32L_B            MAC32L_L   /* 32-bit operand 1 - multiply accumulate - low word (Byte Access) */
#define MAC32H_B            MAC32H_L   /* 32-bit operand 1 - multiply accumulate - high word (Byte Access) */
#define MACS32L_B           MACS32L_L  /* 32-bit operand 1 - signed multiply accumulate - low word (Byte Access) */
#define MACS32H_B           MACS32H_L  /* 32-bit operand 1 - signed multiply accumulate - high word (Byte Access) */
#define OP2L_B              OP2L_L     /* 32-bit operand 2 - low word (Byte Access) */
#define OP2H_B              OP2H_L     /* 32-bit operand 2 - high word (Byte Access) */
/* MPY32CTL0 Control Bits */
#define MPYC_L              (0x0001u)  /* Carry of the multiplier */
#define MPYFRAC_L           (0x0004u)  /* Fractional mode */
#define MPYSAT_L            (0x0008u)  /* Saturation mode */
#define MPYM0_L             (0x0010u)  /* Multiplier mode Bit:0 */
#define MPYM1_L             (0x0020u)  /* Multiplier mode Bit:1 */
#define OP1_32_L            (0x0040u)  /* Bit-width of operand 1 0:16Bit / 1:32Bit */
#define OP2_32_L            (0x0080u)  /* Bit-width of operand 2 0:16Bit / 1:32Bit */
#define MPYDLYWRTEN_H       (0x0001u)  /* Delayed write enable */
#define MPYDLY32_H          (0x0002u)  /* Delayed write mode */

#define MPYM_0              (0x0000u)  /* Multiplier mode: MPY */
#define MPYM_1              (0x0010u)  /* Multiplier mode: MPYS */
#define MPYM_2              (0x0020u)  /* Multiplier mode: MAC */
#define MPYM_3              (0x0030u)  /* Multiplier mode: MACS */
#define MPYM__MPY           (0x0000u)  /* Multiplier mode: MPY */
#define MPYM__MPYS          (0x0010u)  /* Multiplier mode: MPYS */
#define MPYM__MAC           (0x0020u)  /* Multiplier mode: MAC */
#define MPYM__MACS          (0x0030u)  /* Multiplier mode: MACS */

/*-------------------------------------------------------------------------
 *   MPY 32  Multiplier  32 Bit Mode
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short MPY32L;   /* 32-bit operand 1 - multiply - low word */
  struct
  {
    unsigned char MPY32L_L;
    unsigned char MPY32L_H;
  };
} @0x04D0;

__no_init volatile union
{
  unsigned short MPY32H;   /* 32-bit operand 1 - multiply - high word */
  struct
  {
    unsigned char MPY32H_L;
    unsigned char MPY32H_H;
  };
} @0x04D2;

__no_init volatile union
{
  unsigned short MPYS32L;   /* 32-bit operand 1 - signed multiply - low word */
  struct
  {
    unsigned char MPYS32L_L;
    unsigned char MPYS32L_H;
  };
} @0x04D4;

__no_init volatile union
{
  unsigned short MPYS32H;   /* 32-bit operand 1 - signed multiply - high word */
  struct
  {
    unsigned char MPYS32H_L;
    unsigned char MPYS32H_H;
  };
} @0x04D6;

__no_init volatile union
{
  unsigned short MAC32L;   /* 32-bit operand 1 - multiply accumulate - low word */
  struct
  {
    unsigned char MAC32L_L;
    unsigned char MAC32L_H;
  };
} @0x04D8;

__no_init volatile union
{
  unsigned short MAC32H;   /* 32-bit operand 1 - multiply accumulate - high word */
  struct
  {
    unsigned char MAC32H_L;
    unsigned char MAC32H_H;
  };
} @0x04DA;

__no_init volatile union
{
  unsigned short MACS32L;   /* 32-bit operand 1 - signed multiply accumulate - low word */
  struct
  {
    unsigned char MACS32L_L;
    unsigned char MACS32L_H;
  };
} @0x04DC;

__no_init volatile union
{
  unsigned short MACS32H;   /* 32-bit operand 1 - signed multiply accumulate - high word */
  struct
  {
    unsigned char MACS32H_L;
    unsigned char MACS32H_H;
  };
} @0x04DE;

__no_init volatile union
{
  unsigned short OP2L;   /* 32-bit operand 2 - low word */
  struct
  {
    unsigned char OP2L_L;
    unsigned char OP2L_H;
  };
} @0x04E0;

