snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short OP2H;   /* 32-bit operand 2 - high word */
  struct
  {
    unsigned char OP2H_L;
    unsigned char OP2H_H;
  };
} @0x04E2;

__no_init volatile union
{
  unsigned short RES0;   /* 32x32-bit result 0 - least significant word */
  struct
  {
    unsigned char RES0_L;
    unsigned char RES0_H;
  };
} @0x04E4;

__no_init volatile union
{
  unsigned short RES1;   /* 32x32-bit result 1 */
  struct
  {
    unsigned char RES1_L;
    unsigned char RES1_H;
  };
} @0x04E6;

__no_init volatile union
{
  unsigned short RES2;   /* 32x32-bit result 2 */
  struct
  {
    unsigned char RES2_L;
    unsigned char RES2_H;
  };
} @0x04E8;

__no_init volatile union
{
  unsigned short RES3;   /* 32x32-bit result 3 - most significant word */
  struct
  {
    unsigned char RES3_L;
    unsigned char RES3_H;
  };
} @0x04EA;

#define __MSP430_HAS_MPY32__          /* Definition to show that Module is available */

/*-------------------------------------------------------------------------
 *   Port A
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned __READ short PAIN;   /* Port A Input */

  struct
  {
    unsigned __READ short PAIN0           : 1; /*  */
    unsigned __READ short PAIN1           : 1; /*  */
    unsigned __READ short PAIN2           : 1; /*  */
    unsigned __READ short PAIN3           : 1; /*  */
    unsigned __READ short PAIN4           : 1; /*  */
    unsigned __READ short PAIN5           : 1; /*  */
    unsigned __READ short PAIN6           : 1; /*  */
    unsigned __READ short PAIN7           : 1; /*  */
    unsigned __READ short PAIN8           : 1; /*  */
    unsigned __READ short PAIN9           : 1; /*  */
    unsigned __READ short PAIN10          : 1; /*  */
    unsigned __READ short PAIN11          : 1; /*  */
    unsigned __READ short PAIN12          : 1; /*  */
    unsigned __READ short PAIN13          : 1; /*  */
    unsigned __READ short PAIN14          : 1; /*  */
    unsigned __READ short PAIN15          : 1; /*  */
  } PAIN_bit;

  struct
  {
    unsigned __READ char PAIN_L;
    unsigned __READ char PAIN_H;
  };
  struct
  {
    unsigned char P1IN;   /* Port 1 Input */
    unsigned char P2IN;   /* Port 2 Input */
  };
  struct
  {
    struct
    {
      unsigned char P1IN0           : 1; /*  */
      unsigned char P1IN1           : 1; /*  */
      unsigned char P1IN2           : 1; /*  */
      unsigned char P1IN3           : 1; /*  */
      unsigned char P1IN4           : 1; /*  */
      unsigned char P1IN5           : 1; /*  */
      unsigned char P1IN6           : 1; /*  */
      unsigned char P1IN7           : 1; /*  */
    } P1IN_bit;

    struct
    {
      unsigned char P2IN0           : 1; /*  */
      unsigned char P2IN1           : 1; /*  */
      unsigned char P2IN2           : 1; /*  */
      unsigned char P2IN3           : 1; /*  */
      unsigned char P2IN4           : 1; /*  */
      unsigned char P2IN5           : 1; /*  */
      unsigned char P2IN6           : 1; /*  */
      unsigned char P2IN7           : 1; /*  */
    } P2IN_bit;
  }; 
} @0x0200;

enum {
  PAIN0           = 0x0001,
  PAIN1           = 0x0002,
  PAIN2           = 0x0004,
  PAIN3           = 0x0008,
  PAIN4           = 0x0010,
  PAIN5           = 0x0020,
  PAIN6           = 0x0040,
  PAIN7           = 0x0080,
  PAIN8           = 0x0100,
  PAIN9           = 0x0200,
  PAIN10          = 0x0400,
  PAIN11          = 0x0800,
  PAIN12          = 0x1000,
  PAIN13          = 0x2000,
  PAIN14          = 0x4000,
  PAIN15          = 0x8000
};

__no_init volatile union
{
  unsigned short PAOUT;   /* Port A Output */

  struct
  {
    unsigned short PAOUT0          : 1; /*  */
    unsigned short PAOUT1          : 1; /*  */
    unsigned short PAOUT2          : 1; /*  */
    unsigned short PAOUT3          : 1; /*  */
    unsigned short PAOUT4          : 1; /*  */
    unsigned short PAOUT5          : 1; /*  */
    unsigned short PAOUT6          : 1; /*  */
    unsigned short PAOUT7          : 1; /*  */
    unsigned short PAOUT8          : 1; /*  */
    unsigned short PAOUT9          : 1; /*  */
    unsigned short PAOUT10         : 1; /*  */
    unsigned short PAOUT11         : 1; /*  */
    unsigned short PAOUT12         : 1; /*  */
    unsigned short PAOUT13         : 1; /*  */
    unsigned short PAOUT14         : 1; /*  */
    unsigned short PAOUT15         : 1; /*  */
  } PAOUT_bit;

  struct
  {
    unsigned char PAOUT_L;
    unsigned char PAOUT_H;
  };
  struct
  {
    unsigned char P1OUT;   /* Port 1 Output */
    unsigned char P2OUT;   /* Port 2 Output */
  };
  struct
  {
    struct
    {
      unsigned char P1OUT0          : 1; /*  */
      unsigned char P1OUT1          : 1; /*  */
      unsigned char P1OUT2          : 1; /*  */
      unsigned char P1OUT3          : 1; /*  */
      unsigned char P1OUT4          : 1; /*  */
      unsigned char P1OUT5          : 1; /*  */
      unsigned char P1OUT6          : 1; /*  */
      unsigned char P1OUT7          : 1; /*  */
    } P1OUT_bit;

    struct
    {
      unsigned char P2OUT0          : 1; /*  */
      unsigned char P2OUT1          : 1; /*  */
      unsigned char P2OUT2          : 1; /*  */
      unsigned char P2OUT3          : 1; /*  */
      unsigned char P2OUT4          : 1; /*  */
      unsigned char P2OUT5          : 1; /*  */
      unsigned char P2OUT6          : 1; /*  */
      unsigned char P2OUT7          : 1; /*  */
    } P2OUT_bit;
  }; 
} @0x0202;

enum {
  PAOUT0          = 0x0001,
  PAOUT1          = 0x0002,
  PAOUT2          = 0x0004,
  PAOUT3          = 0x0008,
  PAOUT4          = 0x0010,
  PAOUT5          = 0x0020,
  PAOUT6          = 0x0040,
  PAOUT7          = 0x0080,
  PAOUT8          = 0x0100,
  PAOUT9          = 0x0200,
  PAOUT10         = 0x0400,
  PAOUT11         = 0x0800,
  PAOUT12         = 0x1000,
  PAOUT13         = 0x2000,
  PAOUT14         = 0x4000,
  PAOUT15         = 0x8000
};

