snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short PADIR;   /* Port A Direction */

  struct
  {
    unsigned short PADIR0          : 1; /*  */
    unsigned short PADIR1          : 1; /*  */
    unsigned short PADIR2          : 1; /*  */
    unsigned short PADIR3          : 1; /*  */
    unsigned short PADIR4          : 1; /*  */
    unsigned short PADIR5          : 1; /*  */
    unsigned short PADIR6          : 1; /*  */
    unsigned short PADIR7          : 1; /*  */
    unsigned short PADIR8          : 1; /*  */
    unsigned short PADIR9          : 1; /*  */
    unsigned short PADIR10         : 1; /*  */
    unsigned short PADIR11         : 1; /*  */
    unsigned short PADIR12         : 1; /*  */
    unsigned short PADIR13         : 1; /*  */
    unsigned short PADIR14         : 1; /*  */
    unsigned short PADIR15         : 1; /*  */
  } PADIR_bit;

  struct
  {
    unsigned char PADIR_L;
    unsigned char PADIR_H;
  };
  struct
  {
    unsigned char P1DIR;   /* Port 1 Direction */
    unsigned char P2DIR;   /* Port 2 Direction */
  };
  struct
  {
    struct
    {
      unsigned char P1DIR0          : 1; /*  */
      unsigned char P1DIR1          : 1; /*  */
      unsigned char P1DIR2          : 1; /*  */
      unsigned char P1DIR3          : 1; /*  */
      unsigned char P1DIR4          : 1; /*  */
      unsigned char P1DIR5          : 1; /*  */
      unsigned char P1DIR6          : 1; /*  */
      unsigned char P1DIR7          : 1; /*  */
    } P1DIR_bit;

    struct
    {
      unsigned char P2DIR0          : 1; /*  */
      unsigned char P2DIR1          : 1; /*  */
      unsigned char P2DIR2          : 1; /*  */
      unsigned char P2DIR3          : 1; /*  */
      unsigned char P2DIR4          : 1; /*  */
      unsigned char P2DIR5          : 1; /*  */
      unsigned char P2DIR6          : 1; /*  */
      unsigned char P2DIR7          : 1; /*  */
    } P2DIR_bit;
  }; 
} @0x0204;

enum {
  PADIR0          = 0x0001,
  PADIR1          = 0x0002,
  PADIR2          = 0x0004,
  PADIR3          = 0x0008,
  PADIR4          = 0x0010,
  PADIR5          = 0x0020,
  PADIR6          = 0x0040,
  PADIR7          = 0x0080,
  PADIR8          = 0x0100,
  PADIR9          = 0x0200,
  PADIR10         = 0x0400,
  PADIR11         = 0x0800,
  PADIR12         = 0x1000,
  PADIR13         = 0x2000,
  PADIR14         = 0x4000,
  PADIR15         = 0x8000
};

__no_init volatile union
{
  unsigned short PAREN;   /* Port A Resistor Enable */

  struct
  {
    unsigned short PAREN0          : 1; /*  */
    unsigned short PAREN1          : 1; /*  */
    unsigned short PAREN2          : 1; /*  */
    unsigned short PAREN3          : 1; /*  */
    unsigned short PAREN4          : 1; /*  */
    unsigned short PAREN5          : 1; /*  */
    unsigned short PAREN6          : 1; /*  */
    unsigned short PAREN7          : 1; /*  */
    unsigned short PAREN8          : 1; /*  */
    unsigned short PAREN9          : 1; /*  */
    unsigned short PAREN10         : 1; /*  */
    unsigned short PAREN11         : 1; /*  */
    unsigned short PAREN12         : 1; /*  */
    unsigned short PAREN13         : 1; /*  */
    unsigned short PAREN14         : 1; /*  */
    unsigned short PAREN15         : 1; /*  */
  } PAREN_bit;

  struct
  {
    unsigned char PAREN_L;
    unsigned char PAREN_H;
  };
  struct
  {
    unsigned char P1REN;   /* Port 1 Resistor Enable */
    unsigned char P2REN;   /* Port 2 Resistor Enable */
  };
  struct
  {
    struct
    {
      unsigned char P1REN0          : 1; /*  */
      unsigned char P1REN1          : 1; /*  */
      unsigned char P1REN2          : 1; /*  */
      unsigned char P1REN3          : 1; /*  */
      unsigned char P1REN4          : 1; /*  */
      unsigned char P1REN5          : 1; /*  */
      unsigned char P1REN6          : 1; /*  */
      unsigned char P1REN7          : 1; /*  */
    } P1REN_bit;

    struct
    {
      unsigned char P2REN0          : 1; /*  */
      unsigned char P2REN1          : 1; /*  */
      unsigned char P2REN2          : 1; /*  */
      unsigned char P2REN3          : 1; /*  */
      unsigned char P2REN4          : 1; /*  */
      unsigned char P2REN5          : 1; /*  */
      unsigned char P2REN6          : 1; /*  */
      unsigned char P2REN7          : 1; /*  */
    } P2REN_bit;
  }; 
} @0x0206;

enum {
  PAREN0          = 0x0001,
  PAREN1          = 0x0002,
  PAREN2          = 0x0004,
  PAREN3          = 0x0008,
  PAREN4          = 0x0010,
  PAREN5          = 0x0020,
  PAREN6          = 0x0040,
  PAREN7          = 0x0080,
  PAREN8          = 0x0100,
  PAREN9          = 0x0200,
  PAREN10         = 0x0400,
  PAREN11         = 0x0800,
  PAREN12         = 0x1000,
  PAREN13         = 0x2000,
  PAREN14         = 0x4000,
  PAREN15         = 0x8000
};

__no_init volatile union
{
  unsigned short PADS;   /* Port A Drive Strenght */

  struct
  {
    unsigned short PADS0           : 1; /*  */
    unsigned short PADS1           : 1; /*  */
    unsigned short PADS2           : 1; /*  */
    unsigned short PADS3           : 1; /*  */
    unsigned short PADS4           : 1; /*  */
    unsigned short PADS5           : 1; /*  */
    unsigned short PADS6           : 1; /*  */
    unsigned short PADS7           : 1; /*  */
    unsigned short PADS8           : 1; /*  */
    unsigned short PADS9           : 1; /*  */
    unsigned short PADS10          : 1; /*  */
    unsigned short PADS11          : 1; /*  */
    unsigned short PADS12          : 1; /*  */
    unsigned short PADS13          : 1; /*  */
    unsigned short PADS14          : 1; /*  */
    unsigned short PADS15          : 1; /*  */
  } PADS_bit;

  struct
  {
    unsigned char PADS_L;
    unsigned char PADS_H;
  };
  struct
  {
    unsigned char P1DS;   /* Port 1 Drive Strenght */
    unsigned char P2DS;   /* Port 2 Drive Strenght */
  };
  struct
  {
    struct
    {
      unsigned char P1DS0           : 1; /*  */
      unsigned char P1DS1           : 1; /*  */
      unsigned char P1DS2           : 1; /*  */
      unsigned char P1DS3           : 1; /*  */
      unsigned char P1DS4           : 1; /*  */
      unsigned char P1DS5           : 1; /*  */
      unsigned char P1DS6           : 1; /*  */
      unsigned char P1DS7           : 1; /*  */
    } P1DS_bit;

    struct
    {
      unsigned char P2DS0           : 1; /*  */
      unsigned char P2DS1           : 1; /*  */
      unsigned char P2DS2           : 1; /*  */
      unsigned char P2DS3           : 1; /*  */
      unsigned char P2DS4           : 1; /*  */
      unsigned char P2DS5           : 1; /*  */
      unsigned char P2DS6           : 1; /*  */
      unsigned char P2DS7           : 1; /*  */
    } P2DS_bit;
  }; 
} @0x0208;

enum {
  PADS0           = 0x0001,
  PADS1           = 0x0002,
  PADS2           = 0x0004,
  PADS3           = 0x0008,
  PADS4           = 0x0010,
  PADS5           = 0x0020,
  PADS6           = 0x0040,
  PADS7           = 0x0080,
  PADS8           = 0x0100,
  PADS9           = 0x0200,
  PADS10          = 0x0400,
  PADS11          = 0x0800,
  PADS12          = 0x1000,
  PADS13          = 0x2000,
  PADS14          = 0x4000,
  PADS15          = 0x8000
};

