snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short PASEL;   /* Port A Selection */

  struct
  {
    unsigned short PASEL0          : 1; /*  */
    unsigned short PASEL1          : 1; /*  */
    unsigned short PASEL2          : 1; /*  */
    unsigned short PASEL3          : 1; /*  */
    unsigned short PASEL4          : 1; /*  */
    unsigned short PASEL5          : 1; /*  */
    unsigned short PASEL6          : 1; /*  */
    unsigned short PASEL7          : 1; /*  */
    unsigned short PASEL8          : 1; /*  */
    unsigned short PASEL9          : 1; /*  */
    unsigned short PASEL10         : 1; /*  */
    unsigned short PASEL11         : 1; /*  */
    unsigned short PASEL12         : 1; /*  */
    unsigned short PASEL13         : 1; /*  */
    unsigned short PASEL14         : 1; /*  */
    unsigned short PASEL15         : 1; /*  */
  } PASEL_bit;

  struct
  {
    unsigned char PASEL_L;
    unsigned char PASEL_H;
  };
  struct
  {
    unsigned char P1SEL;   /* Port 1 Selection */
    unsigned char P2SEL;   /* Port 2 Selection */
  };
  struct
  {
    struct
    {
      unsigned char P1SEL0          : 1; /*  */
      unsigned char P1SEL1          : 1; /*  */
      unsigned char P1SEL2          : 1; /*  */
      unsigned char P1SEL3          : 1; /*  */
      unsigned char P1SEL4          : 1; /*  */
      unsigned char P1SEL5          : 1; /*  */
      unsigned char P1SEL6          : 1; /*  */
      unsigned char P1SEL7          : 1; /*  */
    } P1SEL_bit;

    struct
    {
      unsigned char P2SEL0          : 1; /*  */
      unsigned char P2SEL1          : 1; /*  */
      unsigned char P2SEL2          : 1; /*  */
      unsigned char P2SEL3          : 1; /*  */
      unsigned char P2SEL4          : 1; /*  */
      unsigned char P2SEL5          : 1; /*  */
      unsigned char P2SEL6          : 1; /*  */
      unsigned char P2SEL7          : 1; /*  */
    } P2SEL_bit;
  }; 
} @0x020A;

enum {
  PASEL0          = 0x0001,
  PASEL1          = 0x0002,
  PASEL2          = 0x0004,
  PASEL3          = 0x0008,
  PASEL4          = 0x0010,
  PASEL5          = 0x0020,
  PASEL6          = 0x0040,
  PASEL7          = 0x0080,
  PASEL8          = 0x0100,
  PASEL9          = 0x0200,
  PASEL10         = 0x0400,
  PASEL11         = 0x0800,
  PASEL12         = 0x1000,
  PASEL13         = 0x2000,
  PASEL14         = 0x4000,
  PASEL15         = 0x8000
};

__no_init volatile union
{
  unsigned short PAIES;   /* Port A Interrupt Edge Select */

  struct
  {
    unsigned short PAIES0          : 1; /*  */
    unsigned short PAIES1          : 1; /*  */
    unsigned short PAIES2          : 1; /*  */
    unsigned short PAIES3          : 1; /*  */
    unsigned short PAIES4          : 1; /*  */
    unsigned short PAIES5          : 1; /*  */
    unsigned short PAIES6          : 1; /*  */
    unsigned short PAIES7          : 1; /*  */
    unsigned short PAIES8          : 1; /*  */
    unsigned short PAIES9          : 1; /*  */
    unsigned short PAIES10         : 1; /*  */
    unsigned short PAIES11         : 1; /*  */
    unsigned short PAIES12         : 1; /*  */
    unsigned short PAIES13         : 1; /*  */
    unsigned short PAIES14         : 1; /*  */
    unsigned short PAIES15         : 1; /*  */
  } PAIES_bit;

  struct
  {
    unsigned char PAIES_L;
    unsigned char PAIES_H;
  };
  struct
  {
    unsigned char P1IES;   /* Port 1 Interrupt Edge Select */
    unsigned char P2IES;   /* Port 2 Interrupt Edge Select */
  };
  struct
  {
    struct
    {
      unsigned char P1IES0          : 1; /*  */
      unsigned char P1IES1          : 1; /*  */
      unsigned char P1IES2          : 1; /*  */
      unsigned char P1IES3          : 1; /*  */
      unsigned char P1IES4          : 1; /*  */
      unsigned char P1IES5          : 1; /*  */
      unsigned char P1IES6          : 1; /*  */
      unsigned char P1IES7          : 1; /*  */
    } P1IES_bit;

    struct
    {
      unsigned char P2IES0          : 1; /*  */
      unsigned char P2IES1          : 1; /*  */
      unsigned char P2IES2          : 1; /*  */
      unsigned char P2IES3          : 1; /*  */
      unsigned char P2IES4          : 1; /*  */
      unsigned char P2IES5          : 1; /*  */
      unsigned char P2IES6          : 1; /*  */
      unsigned char P2IES7          : 1; /*  */
    } P2IES_bit;
  }; 
} @0x0218;

enum {
  PAIES0          = 0x0001,
  PAIES1          = 0x0002,
  PAIES2          = 0x0004,
  PAIES3          = 0x0008,
  PAIES4          = 0x0010,
  PAIES5          = 0x0020,
  PAIES6          = 0x0040,
  PAIES7          = 0x0080,
  PAIES8          = 0x0100,
  PAIES9          = 0x0200,
  PAIES10         = 0x0400,
  PAIES11         = 0x0800,
  PAIES12         = 0x1000,
  PAIES13         = 0x2000,
  PAIES14         = 0x4000,
  PAIES15         = 0x8000
};

__no_init volatile union
{
  unsigned short PAIE;   /* Port A Interrupt Enable */

  struct
  {
    unsigned short PAIE0           : 1; /*  */
    unsigned short PAIE1           : 1; /*  */
    unsigned short PAIE2           : 1; /*  */
    unsigned short PAIE3           : 1; /*  */
    unsigned short PAIE4           : 1; /*  */
    unsigned short PAIE5           : 1; /*  */
    unsigned short PAIE6           : 1; /*  */
    unsigned short PAIE7           : 1; /*  */
    unsigned short PAIE8           : 1; /*  */
    unsigned short PAIE9           : 1; /*  */
    unsigned short PAIE10          : 1; /*  */
    unsigned short PAIE11          : 1; /*  */
    unsigned short PAIE12          : 1; /*  */
    unsigned short PAIE13          : 1; /*  */
    unsigned short PAIE14          : 1; /*  */
    unsigned short PAIE15          : 1; /*  */
  } PAIE_bit;

  struct
  {
    unsigned char PAIE_L;
    unsigned char PAIE_H;
  };
  struct
  {
    unsigned char P1IE;   /* Port 1 Interrupt Enable */
    unsigned char P2IE;   /* Port 2 Interrupt Enable */
  };
  struct
  {
    struct
    {
      unsigned char P1IE0           : 1; /*  */
      unsigned char P1IE1           : 1; /*  */
      unsigned char P1IE2           : 1; /*  */
      unsigned char P1IE3           : 1; /*  */
      unsigned char P1IE4           : 1; /*  */
      unsigned char P1IE5           : 1; /*  */
      unsigned char P1IE6           : 1; /*  */
      unsigned char P1IE7           : 1; /*  */
    } P1IE_bit;

    struct
    {
      unsigned char P2IE0           : 1; /*  */
      unsigned char P2IE1           : 1; /*  */
      unsigned char P2IE2           : 1; /*  */
      unsigned char P2IE3           : 1; /*  */
      unsigned char P2IE4           : 1; /*  */
      unsigned char P2IE5           : 1; /*  */
      unsigned char P2IE6           : 1; /*  */
      unsigned char P2IE7           : 1; /*  */
    } P2IE_bit;
  }; 
} @0x021A;

enum {
  PAIE0           = 0x0001,
  PAIE1           = 0x0002,
  PAIE2           = 0x0004,
  PAIE3           = 0x0008,
  PAIE4           = 0x0010,
  PAIE5           = 0x0020,
  PAIE6           = 0x0040,
  PAIE7           = 0x0080,
  PAIE8           = 0x0100,
  PAIE9           = 0x0200,
  PAIE10          = 0x0400,
  PAIE11          = 0x0800,
  PAIE12          = 0x1000,
  PAIE13          = 0x2000,
  PAIE14          = 0x4000,
  PAIE15          = 0x8000
};

