snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned __READ short PBIN;   /* Port B Input */

  struct
  {
    unsigned __READ short PBIN0           : 1; /*  */
    unsigned __READ short PBIN1           : 1; /*  */
    unsigned __READ short PBIN2           : 1; /*  */
    unsigned __READ short PBIN3           : 1; /*  */
    unsigned __READ short PBIN4           : 1; /*  */
    unsigned __READ short PBIN5           : 1; /*  */
    unsigned __READ short PBIN6           : 1; /*  */
    unsigned __READ short PBIN7           : 1; /*  */
    unsigned __READ short PBIN8           : 1; /*  */
    unsigned __READ short PBIN9           : 1; /*  */
    unsigned __READ short PBIN10          : 1; /*  */
    unsigned __READ short PBIN11          : 1; /*  */
    unsigned __READ short PBIN12          : 1; /*  */
    unsigned __READ short PBIN13          : 1; /*  */
    unsigned __READ short PBIN14          : 1; /*  */
    unsigned __READ short PBIN15          : 1; /*  */
  } PBIN_bit;

  struct
  {
    unsigned __READ char PBIN_L;
    unsigned __READ char PBIN_H;
  };
  struct
  {
    unsigned char P3IN;   /* Port 3 Input */
    unsigned char P4IN;   /* Port 4 Input */
  };
  struct
  {
    struct
    {
      unsigned char P3IN0           : 1; /*  */
      unsigned char P3IN1           : 1; /*  */
      unsigned char P3IN2           : 1; /*  */
      unsigned char P3IN3           : 1; /*  */
      unsigned char P3IN4           : 1; /*  */
      unsigned char P3IN5           : 1; /*  */
      unsigned char P3IN6           : 1; /*  */
      unsigned char P3IN7           : 1; /*  */
    } P3IN_bit;

    struct
    {
      unsigned char P4IN0           : 1; /*  */
      unsigned char P4IN1           : 1; /*  */
      unsigned char P4IN2           : 1; /*  */
      unsigned char P4IN3           : 1; /*  */
      unsigned char P4IN4           : 1; /*  */
      unsigned char P4IN5           : 1; /*  */
      unsigned char P4IN6           : 1; /*  */
      unsigned char P4IN7           : 1; /*  */
    } P4IN_bit;
  }; 
} @0x0220;

enum {
  PBIN0           = 0x0001,
  PBIN1           = 0x0002,
  PBIN2           = 0x0004,
  PBIN3           = 0x0008,
  PBIN4           = 0x0010,
  PBIN5           = 0x0020,
  PBIN6           = 0x0040,
  PBIN7           = 0x0080,
  PBIN8           = 0x0100,
  PBIN9           = 0x0200,
  PBIN10          = 0x0400,
  PBIN11          = 0x0800,
  PBIN12          = 0x1000,
  PBIN13          = 0x2000,
  PBIN14          = 0x4000,
  PBIN15          = 0x8000
};

__no_init volatile union
{
  unsigned short PBOUT;   /* Port B Output */

  struct
  {
    unsigned short PBOUT0          : 1; /*  */
    unsigned short PBOUT1          : 1; /*  */
    unsigned short PBOUT2          : 1; /*  */
    unsigned short PBOUT3          : 1; /*  */
    unsigned short PBOUT4          : 1; /*  */
    unsigned short PBOUT5          : 1; /*  */
    unsigned short PBOUT6          : 1; /*  */
    unsigned short PBOUT7          : 1; /*  */
    unsigned short PBOUT8          : 1; /*  */
    unsigned short PBOUT9          : 1; /*  */
    unsigned short PBOUT10         : 1; /*  */
    unsigned short PBOUT11         : 1; /*  */
    unsigned short PBOUT12         : 1; /*  */
    unsigned short PBOUT13         : 1; /*  */
    unsigned short PBOUT14         : 1; /*  */
    unsigned short PBOUT15         : 1; /*  */
  } PBOUT_bit;

  struct
  {
    unsigned char PBOUT_L;
    unsigned char PBOUT_H;
  };
  struct
  {
    unsigned char P3OUT;   /* Port 3 Output */
    unsigned char P4OUT;   /* Port 4 Output */
  };
  struct
  {
    struct
    {
      unsigned char P3OUT0          : 1; /*  */
      unsigned char P3OUT1          : 1; /*  */
      unsigned char P3OUT2          : 1; /*  */
      unsigned char P3OUT3          : 1; /*  */
      unsigned char P3OUT4          : 1; /*  */
      unsigned char P3OUT5          : 1; /*  */
      unsigned char P3OUT6          : 1; /*  */
      unsigned char P3OUT7          : 1; /*  */
    } P3OUT_bit;

    struct
    {
      unsigned char P4OUT0          : 1; /*  */
      unsigned char P4OUT1          : 1; /*  */
      unsigned char P4OUT2          : 1; /*  */
      unsigned char P4OUT3          : 1; /*  */
      unsigned char P4OUT4          : 1; /*  */
      unsigned char P4OUT5          : 1; /*  */
      unsigned char P4OUT6          : 1; /*  */
      unsigned char P4OUT7          : 1; /*  */
    } P4OUT_bit;
  }; 
} @0x0222;

enum {
  PBOUT0          = 0x0001,
  PBOUT1          = 0x0002,
  PBOUT2          = 0x0004,
  PBOUT3          = 0x0008,
  PBOUT4          = 0x0010,
  PBOUT5          = 0x0020,
  PBOUT6          = 0x0040,
  PBOUT7          = 0x0080,
  PBOUT8          = 0x0100,
  PBOUT9          = 0x0200,
  PBOUT10         = 0x0400,
  PBOUT11         = 0x0800,
  PBOUT12         = 0x1000,
  PBOUT13         = 0x2000,
  PBOUT14         = 0x4000,
  PBOUT15         = 0x8000
};

__no_init volatile union
{
  unsigned short PBDIR;   /* Port B Direction */

  struct
  {
    unsigned short PBDIR0          : 1; /*  */
    unsigned short PBDIR1          : 1; /*  */
    unsigned short PBDIR2          : 1; /*  */
    unsigned short PBDIR3          : 1; /*  */
    unsigned short PBDIR4          : 1; /*  */
    unsigned short PBDIR5          : 1; /*  */
    unsigned short PBDIR6          : 1; /*  */
    unsigned short PBDIR7          : 1; /*  */
    unsigned short PBDIR8          : 1; /*  */
    unsigned short PBDIR9          : 1; /*  */
    unsigned short PBDIR10         : 1; /*  */
    unsigned short PBDIR11         : 1; /*  */
    unsigned short PBDIR12         : 1; /*  */
    unsigned short PBDIR13         : 1; /*  */
    unsigned short PBDIR14         : 1; /*  */
    unsigned short PBDIR15         : 1; /*  */
  } PBDIR_bit;

  struct
  {
    unsigned char PBDIR_L;
    unsigned char PBDIR_H;
  };
  struct
  {
    unsigned char P3DIR;   /* Port 3 Direction */
    unsigned char P4DIR;   /* Port 4 Direction */
  };
  struct
  {
    struct
    {
      unsigned char P3DIR0          : 1; /*  */
      unsigned char P3DIR1          : 1; /*  */
      unsigned char P3DIR2          : 1; /*  */
      unsigned char P3DIR3          : 1; /*  */
      unsigned char P3DIR4          : 1; /*  */
      unsigned char P3DIR5          : 1; /*  */
      unsigned char P3DIR6          : 1; /*  */
      unsigned char P3DIR7          : 1; /*  */
    } P3DIR_bit;

    struct
    {
      unsigned char P4DIR0          : 1; /*  */
      unsigned char P4DIR1          : 1; /*  */
      unsigned char P4DIR2          : 1; /*  */
      unsigned char P4DIR3          : 1; /*  */
      unsigned char P4DIR4          : 1; /*  */
      unsigned char P4DIR5          : 1; /*  */
      unsigned char P4DIR6          : 1; /*  */
      unsigned char P4DIR7          : 1; /*  */
    } P4DIR_bit;
  }; 
} @0x0224;

enum {
  PBDIR0          = 0x0001,
  PBDIR1          = 0x0002,
  PBDIR2          = 0x0004,
  PBDIR3          = 0x0008,
  PBDIR4          = 0x0010,
  PBDIR5          = 0x0020,
  PBDIR6          = 0x0040,
  PBDIR7          = 0x0080,
  PBDIR8          = 0x0100,
  PBDIR9          = 0x0200,
  PBDIR10         = 0x0400,
  PBDIR11         = 0x0800,
  PBDIR12         = 0x1000,
  PBDIR13         = 0x2000,
  PBDIR14         = 0x4000,
  PBDIR15         = 0x8000
};

