snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short PBREN;   /* Port B Resistor Enable */

  struct
  {
    unsigned short PBREN0          : 1; /*  */
    unsigned short PBREN1          : 1; /*  */
    unsigned short PBREN2          : 1; /*  */
    unsigned short PBREN3          : 1; /*  */
    unsigned short PBREN4          : 1; /*  */
    unsigned short PBREN5          : 1; /*  */
    unsigned short PBREN6          : 1; /*  */
    unsigned short PBREN7          : 1; /*  */
    unsigned short PBREN8          : 1; /*  */
    unsigned short PBREN9          : 1; /*  */
    unsigned short PBREN10         : 1; /*  */
    unsigned short PBREN11         : 1; /*  */
    unsigned short PBREN12         : 1; /*  */
    unsigned short PBREN13         : 1; /*  */
    unsigned short PBREN14         : 1; /*  */
    unsigned short PBREN15         : 1; /*  */
  } PBREN_bit;

  struct
  {
    unsigned char PBREN_L;
    unsigned char PBREN_H;
  };
  struct
  {
    unsigned char P3REN;   /* Port 3 Resistor Enable */
    unsigned char P4REN;   /* Port 4 Resistor Enable */
  };
  struct
  {
    struct
    {
      unsigned char P3REN0          : 1; /*  */
      unsigned char P3REN1          : 1; /*  */
      unsigned char P3REN2          : 1; /*  */
      unsigned char P3REN3          : 1; /*  */
      unsigned char P3REN4          : 1; /*  */
      unsigned char P3REN5          : 1; /*  */
      unsigned char P3REN6          : 1; /*  */
      unsigned char P3REN7          : 1; /*  */
    } P3REN_bit;

    struct
    {
      unsigned char P4REN0          : 1; /*  */
      unsigned char P4REN1          : 1; /*  */
      unsigned char P4REN2          : 1; /*  */
      unsigned char P4REN3          : 1; /*  */
      unsigned char P4REN4          : 1; /*  */
      unsigned char P4REN5          : 1; /*  */
      unsigned char P4REN6          : 1; /*  */
      unsigned char P4REN7          : 1; /*  */
    } P4REN_bit;
  }; 
} @0x0226;

enum {
  PBREN0          = 0x0001,
  PBREN1          = 0x0002,
  PBREN2          = 0x0004,
  PBREN3          = 0x0008,
  PBREN4          = 0x0010,
  PBREN5          = 0x0020,
  PBREN6          = 0x0040,
  PBREN7          = 0x0080,
  PBREN8          = 0x0100,
  PBREN9          = 0x0200,
  PBREN10         = 0x0400,
  PBREN11         = 0x0800,
  PBREN12         = 0x1000,
  PBREN13         = 0x2000,
  PBREN14         = 0x4000,
  PBREN15         = 0x8000
};

__no_init volatile union
{
  unsigned short PBDS;   /* Port B Drive Strenght */

  struct
  {
    unsigned short PBDS0           : 1; /*  */
    unsigned short PBDS1           : 1; /*  */
    unsigned short PBDS2           : 1; /*  */
    unsigned short PBDS3           : 1; /*  */
    unsigned short PBDS4           : 1; /*  */
    unsigned short PBDS5           : 1; /*  */
    unsigned short PBDS6           : 1; /*  */
    unsigned short PBDS7           : 1; /*  */
    unsigned short PBDS8           : 1; /*  */
    unsigned short PBDS9           : 1; /*  */
    unsigned short PBDS10          : 1; /*  */
    unsigned short PBDS11          : 1; /*  */
    unsigned short PBDS12          : 1; /*  */
    unsigned short PBDS13          : 1; /*  */
    unsigned short PBDS14          : 1; /*  */
    unsigned short PBDS15          : 1; /*  */
  } PBDS_bit;

  struct
  {
    unsigned char PBDS_L;
    unsigned char PBDS_H;
  };
  struct
  {
    unsigned char P3DS;   /* Port 3 Drive Strenght */
    unsigned char P4DS;   /* Port 4 Drive Strenght */
  };
  struct
  {
    struct
    {
      unsigned char P3DS0           : 1; /*  */
      unsigned char P3DS1           : 1; /*  */
      unsigned char P3DS2           : 1; /*  */
      unsigned char P3DS3           : 1; /*  */
      unsigned char P3DS4           : 1; /*  */
      unsigned char P3DS5           : 1; /*  */
      unsigned char P3DS6           : 1; /*  */
      unsigned char P3DS7           : 1; /*  */
    } P3DS_bit;

    struct
    {
      unsigned char P4DS0           : 1; /*  */
      unsigned char P4DS1           : 1; /*  */
      unsigned char P4DS2           : 1; /*  */
      unsigned char P4DS3           : 1; /*  */
      unsigned char P4DS4           : 1; /*  */
      unsigned char P4DS5           : 1; /*  */
      unsigned char P4DS6           : 1; /*  */
      unsigned char P4DS7           : 1; /*  */
    } P4DS_bit;
  }; 
} @0x0228;

enum {
  PBDS0           = 0x0001,
  PBDS1           = 0x0002,
  PBDS2           = 0x0004,
  PBDS3           = 0x0008,
  PBDS4           = 0x0010,
  PBDS5           = 0x0020,
  PBDS6           = 0x0040,
  PBDS7           = 0x0080,
  PBDS8           = 0x0100,
  PBDS9           = 0x0200,
  PBDS10          = 0x0400,
  PBDS11          = 0x0800,
  PBDS12          = 0x1000,
  PBDS13          = 0x2000,
  PBDS14          = 0x4000,
  PBDS15          = 0x8000
};

__no_init volatile union
{
  unsigned short PBSEL;   /* Port B Selection */

  struct
  {
    unsigned short PBSEL0          : 1; /*  */
    unsigned short PBSEL1          : 1; /*  */
    unsigned short PBSEL2          : 1; /*  */
    unsigned short PBSEL3          : 1; /*  */
    unsigned short PBSEL4          : 1; /*  */
    unsigned short PBSEL5          : 1; /*  */
    unsigned short PBSEL6          : 1; /*  */
    unsigned short PBSEL7          : 1; /*  */
    unsigned short PBSEL8          : 1; /*  */
    unsigned short PBSEL9          : 1; /*  */
    unsigned short PBSEL10         : 1; /*  */
    unsigned short PBSEL11         : 1; /*  */
    unsigned short PBSEL12         : 1; /*  */
    unsigned short PBSEL13         : 1; /*  */
    unsigned short PBSEL14         : 1; /*  */
    unsigned short PBSEL15         : 1; /*  */
  } PBSEL_bit;

  struct
  {
    unsigned char PBSEL_L;
    unsigned char PBSEL_H;
  };
  struct
  {
    unsigned char P3SEL;   /* Port 3 Selection */
    unsigned char P4SEL;   /* Port 4 Selection */
  };
  struct
  {
    struct
    {
      unsigned char P3SEL0          : 1; /*  */
      unsigned char P3SEL1          : 1; /*  */
      unsigned char P3SEL2          : 1; /*  */
      unsigned char P3SEL3          : 1; /*  */
      unsigned char P3SEL4          : 1; /*  */
      unsigned char P3SEL5          : 1; /*  */
      unsigned char P3SEL6          : 1; /*  */
      unsigned char P3SEL7          : 1; /*  */
    } P3SEL_bit;

    struct
    {
      unsigned char P4SEL0          : 1; /*  */
      unsigned char P4SEL1          : 1; /*  */
      unsigned char P4SEL2          : 1; /*  */
      unsigned char P4SEL3          : 1; /*  */
      unsigned char P4SEL4          : 1; /*  */
      unsigned char P4SEL5          : 1; /*  */
      unsigned char P4SEL6          : 1; /*  */
      unsigned char P4SEL7          : 1; /*  */
    } P4SEL_bit;
  }; 
} @0x022A;

enum {
  PBSEL0          = 0x0001,
  PBSEL1          = 0x0002,
  PBSEL2          = 0x0004,
  PBSEL3          = 0x0008,
  PBSEL4          = 0x0010,
  PBSEL5          = 0x0020,
  PBSEL6          = 0x0040,
  PBSEL7          = 0x0080,
  PBSEL8          = 0x0100,
  PBSEL9          = 0x0200,
  PBSEL10         = 0x0400,
  PBSEL11         = 0x0800,
  PBSEL12         = 0x1000,
  PBSEL13         = 0x2000,
  PBSEL14         = 0x4000,
  PBSEL15         = 0x8000
};



#define __MSP430_HAS_PORT3_R__        /* Definition to show that Module is available */
#define __MSP430_HAS_PORT4_R__        /* Definition to show that Module is available */
#define __MSP430_HAS_PORTB_R__        /* Definition to show that Module is available */
#define __MSP430_HAS_P3SEL__          /* Define for DriverLib */
#define __MSP430_HAS_P4SEL__          /* Define for DriverLib */
#define __MSP430_HAS_PBSEL__          /* Define for DriverLib */
#define __MSP430_BASEADDRESS_PORT3_R__ 0x0220
#define P3_BASE __MSP430_BASEADDRESS_PORT3_R__
#define __MSP430_BASEADDRESS_PORT4_R__ 0x0220
#define P4_BASE __MSP430_BASEADDRESS_PORT4_R__
#define __MSP430_BASEADDRESS_PORTB_R__ 0x0220
#define PB_BASE __MSP430_BASEADDRESS_PORTB_R__

/*-------------------------------------------------------------------------
 *   Port 3/4
 *-------------------------------------------------------------------------*/


enum {
  P3IN0           = 0x0001,
  P3IN1           = 0x0002,
  P3IN2           = 0x0004,
  P3IN3           = 0x0008,
  P3IN4           = 0x0010,
  P3IN5           = 0x0020,
  P3IN6           = 0x0040,
  P3IN7           = 0x0080
};

enum {
  P3OUT0          = 0x0001,
  P3OUT1          = 0x0002,
  P3OUT2          = 0x0004,
  P3OUT3          = 0x0008,
  P3OUT4          = 0x0010,
  P3OUT5          = 0x0020,
  P3OUT6          = 0x0040,
  P3OUT7          = 0x0080
};

enum {
  P3DIR0          = 0x0001,
  P3DIR1          = 0x0002,
  P3DIR2          = 0x0004,
  P3DIR3          = 0x0008,
  P3DIR4          = 0x0010,
  P3DIR5          = 0x0020,
  P3DIR6          = 0x0040,
  P3DIR7          = 0x0080
};

enum {
  P3REN0          = 0x0001,
  P3REN1          = 0x0002,
  P3REN2          = 0x0004,
  P3REN3          = 0x0008,
  P3REN4          = 0x0010,
  P3REN5          = 0x0020,
  P3REN6          = 0x0040,
  P3REN7          = 0x0080
};

enum {
  P3DS0           = 0x0001,
  P3DS1           = 0x0002,
  P3DS2           = 0x0004,
  P3DS3           = 0x0008,
  P3DS4           = 0x0010,
  P3DS5           = 0x0020,
  P3DS6           = 0x0040,
  P3DS7           = 0x0080
};

enum {
  P3SEL0          = 0x0001,
  P3SEL1          = 0x0002,
  P3SEL2          = 0x0004,
  P3SEL3          = 0x0008,
  P3SEL4          = 0x0010,
  P3SEL5          = 0x0020,
  P3SEL6          = 0x0040,
  P3SEL7          = 0x0080
};

enum {
  P4IN0           = 0x0001,
  P4IN1           = 0x0002,
  P4IN2           = 0x0004,
  P4IN3           = 0x0008,
  P4IN4           = 0x0010,
  P4IN5           = 0x0020,
  P4IN6           = 0x0040,
  P4IN7           = 0x0080
};

enum {
  P4OUT0          = 0x0001,
  P4OUT1          = 0x0002,
  P4OUT2          = 0x0004,
  P4OUT3          = 0x0008,
  P4OUT4          = 0x0010,
  P4OUT5          = 0x0020,
  P4OUT6          = 0x0040,
  P4OUT7          = 0x0080
};

enum {
  P4DIR0          = 0x0001,
  P4DIR1          = 0x0002,
  P4DIR2          = 0x0004,
  P4DIR3          = 0x0008,
  P4DIR4          = 0x0010,
  P4DIR5          = 0x0020,
  P4DIR6          = 0x0040,
  P4DIR7          = 0x0080
};

enum {
  P4REN0          = 0x0001,
  P4REN1          = 0x0002,
  P4REN2          = 0x0004,
  P4REN3          = 0x0008,
  P4REN4          = 0x0010,
  P4REN5          = 0x0020,
  P4REN6          = 0x0040,
  P4REN7          = 0x0080
};

enum {
  P4DS0           = 0x0001,
  P4DS1           = 0x0002,
  P4DS2           = 0x0004,
  P4DS3           = 0x0008,
  P4DS4           = 0x0010,
  P4DS5           = 0x0020,
  P4DS6           = 0x0040,
  P4DS7           = 0x0080
};

enum {
  P4SEL0          = 0x0001,
  P4SEL1          = 0x0002,
  P4SEL2          = 0x0004,
  P4SEL3          = 0x0008,
  P4SEL4          = 0x0010,
  P4SEL5          = 0x0020,
  P4SEL6          = 0x0040,
  P4SEL7          = 0x0080
};



/*-------------------------------------------------------------------------
 *   Port C
 *-------------------------------------------------------------------------*/


