snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned __READ short PCIN;   /* Port C Input */

  struct
  {
    unsigned __READ short PCIN0           : 1; /*  */
    unsigned __READ short PCIN1           : 1; /*  */
    unsigned __READ short PCIN2           : 1; /*  */
    unsigned __READ short PCIN3           : 1; /*  */
    unsigned __READ short PCIN4           : 1; /*  */
    unsigned __READ short PCIN5           : 1; /*  */
    unsigned __READ short PCIN6           : 1; /*  */
    unsigned __READ short PCIN7           : 1; /*  */
    unsigned __READ short PCIN8           : 1; /*  */
    unsigned __READ short PCIN9           : 1; /*  */
    unsigned __READ short PCIN10          : 1; /*  */
    unsigned __READ short PCIN11          : 1; /*  */
    unsigned __READ short PCIN12          : 1; /*  */
    unsigned __READ short PCIN13          : 1; /*  */
    unsigned __READ short PCIN14          : 1; /*  */
    unsigned __READ short PCIN15          : 1; /*  */
  } PCIN_bit;

  struct
  {
    unsigned __READ char PCIN_L;
    unsigned __READ char PCIN_H;
  };
  struct
  {
    unsigned char P5IN;   /* Port 5 Input */
    unsigned char P6IN;   /* Port 6 Input */
  };
  struct
  {
    struct
    {
      unsigned char P5IN0           : 1; /*  */
      unsigned char P5IN1           : 1; /*  */
      unsigned char P5IN2           : 1; /*  */
      unsigned char P5IN3           : 1; /*  */
      unsigned char P5IN4           : 1; /*  */
      unsigned char P5IN5           : 1; /*  */
      unsigned char P5IN6           : 1; /*  */
      unsigned char P5IN7           : 1; /*  */
    } P5IN_bit;

    struct
    {
      unsigned char P6IN0           : 1; /*  */
      unsigned char P6IN1           : 1; /*  */
      unsigned char P6IN2           : 1; /*  */
      unsigned char P6IN3           : 1; /*  */
      unsigned char P6IN4           : 1; /*  */
      unsigned char P6IN5           : 1; /*  */
      unsigned char P6IN6           : 1; /*  */
      unsigned char P6IN7           : 1; /*  */
    } P6IN_bit;
  }; 
} @0x0240;

enum {
  PCIN0           = 0x0001,
  PCIN1           = 0x0002,
  PCIN2           = 0x0004,
  PCIN3           = 0x0008,
  PCIN4           = 0x0010,
  PCIN5           = 0x0020,
  PCIN6           = 0x0040,
  PCIN7           = 0x0080,
  PCIN8           = 0x0100,
  PCIN9           = 0x0200,
  PCIN10          = 0x0400,
  PCIN11          = 0x0800,
  PCIN12          = 0x1000,
  PCIN13          = 0x2000,
  PCIN14          = 0x4000,
  PCIN15          = 0x8000
};

__no_init volatile union
{
  unsigned short PCOUT;   /* Port C Output */

  struct
  {
    unsigned short PCOUT0          : 1; /*  */
    unsigned short PCOUT1          : 1; /*  */
    unsigned short PCOUT2          : 1; /*  */
    unsigned short PCOUT3          : 1; /*  */
    unsigned short PCOUT4          : 1; /*  */
    unsigned short PCOUT5          : 1; /*  */
    unsigned short PCOUT6          : 1; /*  */
    unsigned short PCOUT7          : 1; /*  */
    unsigned short PCOUT8          : 1; /*  */
    unsigned short PCOUT9          : 1; /*  */
    unsigned short PCOUT10         : 1; /*  */
    unsigned short PCOUT11         : 1; /*  */
    unsigned short PCOUT12         : 1; /*  */
    unsigned short PCOUT13         : 1; /*  */
    unsigned short PCOUT14         : 1; /*  */
    unsigned short PCOUT15         : 1; /*  */
  } PCOUT_bit;

  struct
  {
    unsigned char PCOUT_L;
    unsigned char PCOUT_H;
  };
  struct
  {
    unsigned char P5OUT;   /* Port 5 Output */
    unsigned char P6OUT;   /* Port 6 Output */
  };
  struct
  {
    struct
    {
      unsigned char P5OUT0          : 1; /*  */
      unsigned char P5OUT1          : 1; /*  */
      unsigned char P5OUT2          : 1; /*  */
      unsigned char P5OUT3          : 1; /*  */
      unsigned char P5OUT4          : 1; /*  */
      unsigned char P5OUT5          : 1; /*  */
      unsigned char P5OUT6          : 1; /*  */
      unsigned char P5OUT7          : 1; /*  */
    } P5OUT_bit;

    struct
    {
      unsigned char P6OUT0          : 1; /*  */
      unsigned char P6OUT1          : 1; /*  */
      unsigned char P6OUT2          : 1; /*  */
      unsigned char P6OUT3          : 1; /*  */
      unsigned char P6OUT4          : 1; /*  */
      unsigned char P6OUT5          : 1; /*  */
      unsigned char P6OUT6          : 1; /*  */
      unsigned char P6OUT7          : 1; /*  */
    } P6OUT_bit;
  }; 
} @0x0242;

enum {
  PCOUT0          = 0x0001,
  PCOUT1          = 0x0002,
  PCOUT2          = 0x0004,
  PCOUT3          = 0x0008,
  PCOUT4          = 0x0010,
  PCOUT5          = 0x0020,
  PCOUT6          = 0x0040,
  PCOUT7          = 0x0080,
  PCOUT8          = 0x0100,
  PCOUT9          = 0x0200,
  PCOUT10         = 0x0400,
  PCOUT11         = 0x0800,
  PCOUT12         = 0x1000,
  PCOUT13         = 0x2000,
  PCOUT14         = 0x4000,
  PCOUT15         = 0x8000
};

__no_init volatile union
{
  unsigned short PCDIR;   /* Port C Direction */

  struct
  {
    unsigned short PCDIR0          : 1; /*  */
    unsigned short PCDIR1          : 1; /*  */
    unsigned short PCDIR2          : 1; /*  */
    unsigned short PCDIR3          : 1; /*  */
    unsigned short PCDIR4          : 1; /*  */
    unsigned short PCDIR5          : 1; /*  */
    unsigned short PCDIR6          : 1; /*  */
    unsigned short PCDIR7          : 1; /*  */
    unsigned short PCDIR8          : 1; /*  */
    unsigned short PCDIR9          : 1; /*  */
    unsigned short PCDIR10         : 1; /*  */
    unsigned short PCDIR11         : 1; /*  */
    unsigned short PCDIR12         : 1; /*  */
    unsigned short PCDIR13         : 1; /*  */
    unsigned short PCDIR14         : 1; /*  */
    unsigned short PCDIR15         : 1; /*  */
  } PCDIR_bit;

  struct
  {
    unsigned char PCDIR_L;
    unsigned char PCDIR_H;
  };
  struct
  {
    unsigned char P5DIR;   /* Port 5 Direction */
    unsigned char P6DIR;   /* Port 6 Direction */
  };
  struct
  {
    struct
    {
      unsigned char P5DIR0          : 1; /*  */
      unsigned char P5DIR1          : 1; /*  */
      unsigned char P5DIR2          : 1; /*  */
      unsigned char P5DIR3          : 1; /*  */
      unsigned char P5DIR4          : 1; /*  */
      unsigned char P5DIR5          : 1; /*  */
      unsigned char P5DIR6          : 1; /*  */
      unsigned char P5DIR7          : 1; /*  */
    } P5DIR_bit;

    struct
    {
      unsigned char P6DIR0          : 1; /*  */
      unsigned char P6DIR1          : 1; /*  */
      unsigned char P6DIR2          : 1; /*  */
      unsigned char P6DIR3          : 1; /*  */
      unsigned char P6DIR4          : 1; /*  */
      unsigned char P6DIR5          : 1; /*  */
      unsigned char P6DIR6          : 1; /*  */
      unsigned char P6DIR7          : 1; /*  */
    } P6DIR_bit;
  }; 
} @0x0244;

enum {
  PCDIR0          = 0x0001,
  PCDIR1          = 0x0002,
  PCDIR2          = 0x0004,
  PCDIR3          = 0x0008,
  PCDIR4          = 0x0010,
  PCDIR5          = 0x0020,
  PCDIR6          = 0x0040,
  PCDIR7          = 0x0080,
  PCDIR8          = 0x0100,
  PCDIR9          = 0x0200,
  PCDIR10         = 0x0400,
  PCDIR11         = 0x0800,
  PCDIR12         = 0x1000,
  PCDIR13         = 0x2000,
  PCDIR14         = 0x4000,
  PCDIR15         = 0x8000
};

