snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short PCREN;   /* Port C Resistor Enable */

  struct
  {
    unsigned short PCREN0          : 1; /*  */
    unsigned short PCREN1          : 1; /*  */
    unsigned short PCREN2          : 1; /*  */
    unsigned short PCREN3          : 1; /*  */
    unsigned short PCREN4          : 1; /*  */
    unsigned short PCREN5          : 1; /*  */
    unsigned short PCREN6          : 1; /*  */
    unsigned short PCREN7          : 1; /*  */
    unsigned short PCREN8          : 1; /*  */
    unsigned short PCREN9          : 1; /*  */
    unsigned short PCREN10         : 1; /*  */
    unsigned short PCREN11         : 1; /*  */
    unsigned short PCREN12         : 1; /*  */
    unsigned short PCREN13         : 1; /*  */
    unsigned short PCREN14         : 1; /*  */
    unsigned short PCREN15         : 1; /*  */
  } PCREN_bit;

  struct
  {
    unsigned char PCREN_L;
    unsigned char PCREN_H;
  };
  struct
  {
    unsigned char P5REN;   /* Port 5 Resistor Enable */
    unsigned char P6REN;   /* Port 6 Resistor Enable */
  };
  struct
  {
    struct
    {
      unsigned char P5REN0          : 1; /*  */
      unsigned char P5REN1          : 1; /*  */
      unsigned char P5REN2          : 1; /*  */
      unsigned char P5REN3          : 1; /*  */
      unsigned char P5REN4          : 1; /*  */
      unsigned char P5REN5          : 1; /*  */
      unsigned char P5REN6          : 1; /*  */
      unsigned char P5REN7          : 1; /*  */
    } P5REN_bit;

    struct
    {
      unsigned char P6REN0          : 1; /*  */
      unsigned char P6REN1          : 1; /*  */
      unsigned char P6REN2          : 1; /*  */
      unsigned char P6REN3          : 1; /*  */
      unsigned char P6REN4          : 1; /*  */
      unsigned char P6REN5          : 1; /*  */
      unsigned char P6REN6          : 1; /*  */
      unsigned char P6REN7          : 1; /*  */
    } P6REN_bit;
  }; 
} @0x0246;

enum {
  PCREN0          = 0x0001,
  PCREN1          = 0x0002,
  PCREN2          = 0x0004,
  PCREN3          = 0x0008,
  PCREN4          = 0x0010,
  PCREN5          = 0x0020,
  PCREN6          = 0x0040,
  PCREN7          = 0x0080,
  PCREN8          = 0x0100,
  PCREN9          = 0x0200,
  PCREN10         = 0x0400,
  PCREN11         = 0x0800,
  PCREN12         = 0x1000,
  PCREN13         = 0x2000,
  PCREN14         = 0x4000,
  PCREN15         = 0x8000
};

__no_init volatile union
{
  unsigned short PCDS;   /* Port C Drive Strenght */

  struct
  {
    unsigned short PCDS0           : 1; /*  */
    unsigned short PCDS1           : 1; /*  */
    unsigned short PCDS2           : 1; /*  */
    unsigned short PCDS3           : 1; /*  */
    unsigned short PCDS4           : 1; /*  */
    unsigned short PCDS5           : 1; /*  */
    unsigned short PCDS6           : 1; /*  */
    unsigned short PCDS7           : 1; /*  */
    unsigned short PCDS8           : 1; /*  */
    unsigned short PCDS9           : 1; /*  */
    unsigned short PCDS10          : 1; /*  */
    unsigned short PCDS11          : 1; /*  */
    unsigned short PCDS12          : 1; /*  */
    unsigned short PCDS13          : 1; /*  */
    unsigned short PCDS14          : 1; /*  */
    unsigned short PCDS15          : 1; /*  */
  } PCDS_bit;

  struct
  {
    unsigned char PCDS_L;
    unsigned char PCDS_H;
  };
  struct
  {
    unsigned char P5DS;   /* Port 5 Drive Strenght */
    unsigned char P6DS;   /* Port 6 Drive Strenght */
  };
  struct
  {
    struct
    {
      unsigned char P5DS0           : 1; /*  */
      unsigned char P5DS1           : 1; /*  */
      unsigned char P5DS2           : 1; /*  */
      unsigned char P5DS3           : 1; /*  */
      unsigned char P5DS4           : 1; /*  */
      unsigned char P5DS5           : 1; /*  */
      unsigned char P5DS6           : 1; /*  */
      unsigned char P5DS7           : 1; /*  */
    } P5DS_bit;

    struct
    {
      unsigned char P6DS0           : 1; /*  */
      unsigned char P6DS1           : 1; /*  */
      unsigned char P6DS2           : 1; /*  */
      unsigned char P6DS3           : 1; /*  */
      unsigned char P6DS4           : 1; /*  */
      unsigned char P6DS5           : 1; /*  */
      unsigned char P6DS6           : 1; /*  */
      unsigned char P6DS7           : 1; /*  */
    } P6DS_bit;
  }; 
} @0x0248;

enum {
  PCDS0           = 0x0001,
  PCDS1           = 0x0002,
  PCDS2           = 0x0004,
  PCDS3           = 0x0008,
  PCDS4           = 0x0010,
  PCDS5           = 0x0020,
  PCDS6           = 0x0040,
  PCDS7           = 0x0080,
  PCDS8           = 0x0100,
  PCDS9           = 0x0200,
  PCDS10          = 0x0400,
  PCDS11          = 0x0800,
  PCDS12          = 0x1000,
  PCDS13          = 0x2000,
  PCDS14          = 0x4000,
  PCDS15          = 0x8000
};

__no_init volatile union
{
  unsigned short PCSEL;   /* Port C Selection */

  struct
  {
    unsigned short PCSEL0          : 1; /*  */
    unsigned short PCSEL1          : 1; /*  */
    unsigned short PCSEL2          : 1; /*  */
    unsigned short PCSEL3          : 1; /*  */
    unsigned short PCSEL4          : 1; /*  */
    unsigned short PCSEL5          : 1; /*  */
    unsigned short PCSEL6          : 1; /*  */
    unsigned short PCSEL7          : 1; /*  */
    unsigned short PCSEL8          : 1; /*  */
    unsigned short PCSEL9          : 1; /*  */
    unsigned short PCSEL10         : 1; /*  */
    unsigned short PCSEL11         : 1; /*  */
    unsigned short PCSEL12         : 1; /*  */
    unsigned short PCSEL13         : 1; /*  */
    unsigned short PCSEL14         : 1; /*  */
    unsigned short PCSEL15         : 1; /*  */
  } PCSEL_bit;

  struct
  {
    unsigned char PCSEL_L;
    unsigned char PCSEL_H;
  };
  struct
  {
    unsigned char P5SEL;   /* Port 5 Selection */
    unsigned char P6SEL;   /* Port 6 Selection */
  };
  struct
  {
    struct
    {
      unsigned char P5SEL0          : 1; /*  */
      unsigned char P5SEL1          : 1; /*  */
      unsigned char P5SEL2          : 1; /*  */
      unsigned char P5SEL3          : 1; /*  */
      unsigned char P5SEL4          : 1; /*  */
      unsigned char P5SEL5          : 1; /*  */
      unsigned char P5SEL6          : 1; /*  */
      unsigned char P5SEL7          : 1; /*  */
    } P5SEL_bit;

    struct
    {
      unsigned char P6SEL0          : 1; /*  */
      unsigned char P6SEL1          : 1; /*  */
      unsigned char P6SEL2          : 1; /*  */
      unsigned char P6SEL3          : 1; /*  */
      unsigned char P6SEL4          : 1; /*  */
      unsigned char P6SEL5          : 1; /*  */
      unsigned char P6SEL6          : 1; /*  */
      unsigned char P6SEL7          : 1; /*  */
    } P6SEL_bit;
  }; 
} @0x024A;

enum {
  PCSEL0          = 0x0001,
  PCSEL1          = 0x0002,
  PCSEL2          = 0x0004,
  PCSEL3          = 0x0008,
  PCSEL4          = 0x0010,
  PCSEL5          = 0x0020,
  PCSEL6          = 0x0040,
  PCSEL7          = 0x0080,
  PCSEL8          = 0x0100,
  PCSEL9          = 0x0200,
  PCSEL10         = 0x0400,
  PCSEL11         = 0x0800,
  PCSEL12         = 0x1000,
  PCSEL13         = 0x2000,
  PCSEL14         = 0x4000,
  PCSEL15         = 0x8000
};



#define __MSP430_HAS_PORT5_R__        /* Definition to show that Module is available */
#define __MSP430_HAS_PORT6_R__        /* Definition to show that Module is available */
#define __MSP430_HAS_PORTC_R__        /* Definition to show that Module is available */
#define __MSP430_HAS_P5SEL__          /* Define for DriverLib */
#define __MSP430_HAS_P6SEL__          /* Define for DriverLib */
#define __MSP430_HAS_PCSEL__          /* Define for DriverLib */
#define __MSP430_BASEADDRESS_PORT5_R__ 0x0240
#define P5_BASE __MSP430_BASEADDRESS_PORT5_R__
#define __MSP430_BASEADDRESS_PORT6_R__ 0x0240
#define P6_BASE __MSP430_BASEADDRESS_PORT6_R__
#define __MSP430_BASEADDRESS_PORTC_R__ 0x0240
#define PC_BASE __MSP430_BASEADDRESS_PORTC_R__

/*-------------------------------------------------------------------------
 *   Port 5/6
 *-------------------------------------------------------------------------*/


enum {
  P5IN0           = 0x0001,
  P5IN1           = 0x0002,
  P5IN2           = 0x0004,
  P5IN3           = 0x0008,
  P5IN4           = 0x0010,
  P5IN5           = 0x0020,
  P5IN6           = 0x0040,
  P5IN7           = 0x0080
};

enum {
  P5OUT0          = 0x0001,
  P5OUT1          = 0x0002,
  P5OUT2          = 0x0004,
  P5OUT3          = 0x0008,
  P5OUT4          = 0x0010,
  P5OUT5          = 0x0020,
  P5OUT6          = 0x0040,
  P5OUT7          = 0x0080
};

enum {
  P5DIR0          = 0x0001,
  P5DIR1          = 0x0002,
  P5DIR2          = 0x0004,
  P5DIR3          = 0x0008,
  P5DIR4          = 0x0010,
  P5DIR5          = 0x0020,
  P5DIR6          = 0x0040,
  P5DIR7          = 0x0080
};

enum {
  P5REN0          = 0x0001,
  P5REN1          = 0x0002,
  P5REN2          = 0x0004,
  P5REN3          = 0x0008,
  P5REN4          = 0x0010,
  P5REN5          = 0x0020,
  P5REN6          = 0x0040,
  P5REN7          = 0x0080
};

enum {
  P5DS0           = 0x0001,
  P5DS1           = 0x0002,
  P5DS2           = 0x0004,
  P5DS3           = 0x0008,
  P5DS4           = 0x0010,
  P5DS5           = 0x0020,
  P5DS6           = 0x0040,
  P5DS7           = 0x0080
};

enum {
  P5SEL0          = 0x0001,
  P5SEL1          = 0x0002,
  P5SEL2          = 0x0004,
  P5SEL3          = 0x0008,
  P5SEL4          = 0x0010,
  P5SEL5          = 0x0020,
  P5SEL6          = 0x0040,
  P5SEL7          = 0x0080
};

enum {
  P6IN0           = 0x0001,
  P6IN1           = 0x0002,
  P6IN2           = 0x0004,
  P6IN3           = 0x0008,
  P6IN4           = 0x0010,
  P6IN5           = 0x0020,
  P6IN6           = 0x0040,
  P6IN7           = 0x0080
};

enum {
  P6OUT0          = 0x0001,
  P6OUT1          = 0x0002,
  P6OUT2          = 0x0004,
  P6OUT3          = 0x0008,
  P6OUT4          = 0x0010,
  P6OUT5          = 0x0020,
  P6OUT6          = 0x0040,
  P6OUT7          = 0x0080
};

enum {
  P6DIR0          = 0x0001,
  P6DIR1          = 0x0002,
  P6DIR2          = 0x0004,
  P6DIR3          = 0x0008,
  P6DIR4          = 0x0010,
  P6DIR5          = 0x0020,
  P6DIR6          = 0x0040,
  P6DIR7          = 0x0080
};

enum {
  P6REN0          = 0x0001,
  P6REN1          = 0x0002,
  P6REN2          = 0x0004,
  P6REN3          = 0x0008,
  P6REN4          = 0x0010,
  P6REN5          = 0x0020,
  P6REN6          = 0x0040,
  P6REN7          = 0x0080
};

enum {
  P6DS0           = 0x0001,
  P6DS1           = 0x0002,
  P6DS2           = 0x0004,
  P6DS3           = 0x0008,
  P6DS4           = 0x0010,
  P6DS5           = 0x0020,
  P6DS6           = 0x0040,
  P6DS7           = 0x0080
};

enum {
  P6SEL0          = 0x0001,
  P6SEL1          = 0x0002,
  P6SEL2          = 0x0004,
  P6SEL3          = 0x0008,
  P6SEL4          = 0x0010,
  P6SEL5          = 0x0020,
  P6SEL6          = 0x0040,
  P6SEL7          = 0x0080
};



/*-------------------------------------------------------------------------
 *   Port D
 *-------------------------------------------------------------------------*/


