snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned __READ short PDIN;   /* Port D Input */

  struct
  {
    unsigned __READ short PDIN0           : 1; /*  */
    unsigned __READ short PDIN1           : 1; /*  */
    unsigned __READ short PDIN2           : 1; /*  */
    unsigned __READ short PDIN3           : 1; /*  */
    unsigned __READ short PDIN4           : 1; /*  */
    unsigned __READ short PDIN5           : 1; /*  */
    unsigned __READ short PDIN6           : 1; /*  */
    unsigned __READ short PDIN7           : 1; /*  */
    unsigned __READ short PDIN8           : 1; /*  */
    unsigned __READ short PDIN9           : 1; /*  */
    unsigned __READ short PDIN10          : 1; /*  */
    unsigned __READ short PDIN11          : 1; /*  */
    unsigned __READ short PDIN12          : 1; /*  */
    unsigned __READ short PDIN13          : 1; /*  */
    unsigned __READ short PDIN14          : 1; /*  */
    unsigned __READ short PDIN15          : 1; /*  */
  } PDIN_bit;

  struct
  {
    unsigned __READ char PDIN_L;
    unsigned __READ char PDIN_H;
  };
  struct
  {
    unsigned char P7IN;   /* Port 7 Input */
    unsigned char P8IN;   /* Port 8 Input */
  };
  struct
  {
    struct
    {
      unsigned char P7IN0           : 1; /*  */
      unsigned char P7IN1           : 1; /*  */
      unsigned char P7IN2           : 1; /*  */
      unsigned char P7IN3           : 1; /*  */
      unsigned char P7IN4           : 1; /*  */
      unsigned char P7IN5           : 1; /*  */
      unsigned char P7IN6           : 1; /*  */
      unsigned char P7IN7           : 1; /*  */
    } P7IN_bit;

    struct
    {
      unsigned char P8IN0           : 1; /*  */
      unsigned char P8IN1           : 1; /*  */
      unsigned char P8IN2           : 1; /*  */
      unsigned char P8IN3           : 1; /*  */
      unsigned char P8IN4           : 1; /*  */
      unsigned char P8IN5           : 1; /*  */
      unsigned char P8IN6           : 1; /*  */
      unsigned char P8IN7           : 1; /*  */
    } P8IN_bit;
  }; 
} @0x0260;

enum {
  PDIN0           = 0x0001,
  PDIN1           = 0x0002,
  PDIN2           = 0x0004,
  PDIN3           = 0x0008,
  PDIN4           = 0x0010,
  PDIN5           = 0x0020,
  PDIN6           = 0x0040,
  PDIN7           = 0x0080,
  PDIN8           = 0x0100,
  PDIN9           = 0x0200,
  PDIN10          = 0x0400,
  PDIN11          = 0x0800,
  PDIN12          = 0x1000,
  PDIN13          = 0x2000,
  PDIN14          = 0x4000,
  PDIN15          = 0x8000
};

__no_init volatile union
{
  unsigned short PDOUT;   /* Port D Output */

  struct
  {
    unsigned short PDOUT0          : 1; /*  */
    unsigned short PDOUT1          : 1; /*  */
    unsigned short PDOUT2          : 1; /*  */
    unsigned short PDOUT3          : 1; /*  */
    unsigned short PDOUT4          : 1; /*  */
    unsigned short PDOUT5          : 1; /*  */
    unsigned short PDOUT6          : 1; /*  */
    unsigned short PDOUT7          : 1; /*  */
    unsigned short PDOUT8          : 1; /*  */
    unsigned short PDOUT9          : 1; /*  */
    unsigned short PDOUT10         : 1; /*  */
    unsigned short PDOUT11         : 1; /*  */
    unsigned short PDOUT12         : 1; /*  */
    unsigned short PDOUT13         : 1; /*  */
    unsigned short PDOUT14         : 1; /*  */
    unsigned short PDOUT15         : 1; /*  */
  } PDOUT_bit;

  struct
  {
    unsigned char PDOUT_L;
    unsigned char PDOUT_H;
  };
  struct
  {
    unsigned char P7OUT;   /* Port 7 Output */
    unsigned char P8OUT;   /* Port 8 Output */
  };
  struct
  {
    struct
    {
      unsigned char P7OUT0          : 1; /*  */
      unsigned char P7OUT1          : 1; /*  */
      unsigned char P7OUT2          : 1; /*  */
      unsigned char P7OUT3          : 1; /*  */
      unsigned char P7OUT4          : 1; /*  */
      unsigned char P7OUT5          : 1; /*  */
      unsigned char P7OUT6          : 1; /*  */
      unsigned char P7OUT7          : 1; /*  */
    } P7OUT_bit;

    struct
    {
      unsigned char P8OUT0          : 1; /*  */
      unsigned char P8OUT1          : 1; /*  */
      unsigned char P8OUT2          : 1; /*  */
      unsigned char P8OUT3          : 1; /*  */
      unsigned char P8OUT4          : 1; /*  */
      unsigned char P8OUT5          : 1; /*  */
      unsigned char P8OUT6          : 1; /*  */
      unsigned char P8OUT7          : 1; /*  */
    } P8OUT_bit;
  }; 
} @0x0262;

enum {
  PDOUT0          = 0x0001,
  PDOUT1          = 0x0002,
  PDOUT2          = 0x0004,
  PDOUT3          = 0x0008,
  PDOUT4          = 0x0010,
  PDOUT5          = 0x0020,
  PDOUT6          = 0x0040,
  PDOUT7          = 0x0080,
  PDOUT8          = 0x0100,
  PDOUT9          = 0x0200,
  PDOUT10         = 0x0400,
  PDOUT11         = 0x0800,
  PDOUT12         = 0x1000,
  PDOUT13         = 0x2000,
  PDOUT14         = 0x4000,
  PDOUT15         = 0x8000
};

__no_init volatile union
{
  unsigned short PDDIR;   /* Port D Direction */

  struct
  {
    unsigned short PDDIR0          : 1; /*  */
    unsigned short PDDIR1          : 1; /*  */
    unsigned short PDDIR2          : 1; /*  */
    unsigned short PDDIR3          : 1; /*  */
    unsigned short PDDIR4          : 1; /*  */
    unsigned short PDDIR5          : 1; /*  */
    unsigned short PDDIR6          : 1; /*  */
    unsigned short PDDIR7          : 1; /*  */
    unsigned short PDDIR8          : 1; /*  */
    unsigned short PDDIR9          : 1; /*  */
    unsigned short PDDIR10         : 1; /*  */
    unsigned short PDDIR11         : 1; /*  */
    unsigned short PDDIR12         : 1; /*  */
    unsigned short PDDIR13         : 1; /*  */
    unsigned short PDDIR14         : 1; /*  */
    unsigned short PDDIR15         : 1; /*  */
  } PDDIR_bit;

  struct
  {
    unsigned char PDDIR_L;
    unsigned char PDDIR_H;
  };
  struct
  {
    unsigned char P7DIR;   /* Port 7 Direction */
    unsigned char P8DIR;   /* Port 8 Direction */
  };
  struct
  {
    struct
    {
      unsigned char P7DIR0          : 1; /*  */
      unsigned char P7DIR1          : 1; /*  */
      unsigned char P7DIR2          : 1; /*  */
      unsigned char P7DIR3          : 1; /*  */
      unsigned char P7DIR4          : 1; /*  */
      unsigned char P7DIR5          : 1; /*  */
      unsigned char P7DIR6          : 1; /*  */
      unsigned char P7DIR7          : 1; /*  */
    } P7DIR_bit;

    struct
    {
      unsigned char P8DIR0          : 1; /*  */
      unsigned char P8DIR1          : 1; /*  */
      unsigned char P8DIR2          : 1; /*  */
      unsigned char P8DIR3          : 1; /*  */
      unsigned char P8DIR4          : 1; /*  */
      unsigned char P8DIR5          : 1; /*  */
      unsigned char P8DIR6          : 1; /*  */
      unsigned char P8DIR7          : 1; /*  */
    } P8DIR_bit;
  }; 
} @0x0264;

enum {
  PDDIR0          = 0x0001,
  PDDIR1          = 0x0002,
  PDDIR2          = 0x0004,
  PDDIR3          = 0x0008,
  PDDIR4          = 0x0010,
  PDDIR5          = 0x0020,
  PDDIR6          = 0x0040,
  PDDIR7          = 0x0080,
  PDDIR8          = 0x0100,
  PDDIR9          = 0x0200,
  PDDIR10         = 0x0400,
  PDDIR11         = 0x0800,
  PDDIR12         = 0x1000,
  PDDIR13         = 0x2000,
  PDDIR14         = 0x4000,
  PDDIR15         = 0x8000
};

