snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short PDREN;   /* Port D Resistor Enable */

  struct
  {
    unsigned short PDREN0          : 1; /*  */
    unsigned short PDREN1          : 1; /*  */
    unsigned short PDREN2          : 1; /*  */
    unsigned short PDREN3          : 1; /*  */
    unsigned short PDREN4          : 1; /*  */
    unsigned short PDREN5          : 1; /*  */
    unsigned short PDREN6          : 1; /*  */
    unsigned short PDREN7          : 1; /*  */
    unsigned short PDREN8          : 1; /*  */
    unsigned short PDREN9          : 1; /*  */
    unsigned short PDREN10         : 1; /*  */
    unsigned short PDREN11         : 1; /*  */
    unsigned short PDREN12         : 1; /*  */
    unsigned short PDREN13         : 1; /*  */
    unsigned short PDREN14         : 1; /*  */
    unsigned short PDREN15         : 1; /*  */
  } PDREN_bit;

  struct
  {
    unsigned char PDREN_L;
    unsigned char PDREN_H;
  };
  struct
  {
    unsigned char P7REN;   /* Port 7 Resistor Enable */
    unsigned char P8REN;   /* Port 8 Resistor Enable */
  };
  struct
  {
    struct
    {
      unsigned char P7REN0          : 1; /*  */
      unsigned char P7REN1          : 1; /*  */
      unsigned char P7REN2          : 1; /*  */
      unsigned char P7REN3          : 1; /*  */
      unsigned char P7REN4          : 1; /*  */
      unsigned char P7REN5          : 1; /*  */
      unsigned char P7REN6          : 1; /*  */
      unsigned char P7REN7          : 1; /*  */
    } P7REN_bit;

    struct
    {
      unsigned char P8REN0          : 1; /*  */
      unsigned char P8REN1          : 1; /*  */
      unsigned char P8REN2          : 1; /*  */
      unsigned char P8REN3          : 1; /*  */
      unsigned char P8REN4          : 1; /*  */
      unsigned char P8REN5          : 1; /*  */
      unsigned char P8REN6          : 1; /*  */
      unsigned char P8REN7          : 1; /*  */
    } P8REN_bit;
  }; 
} @0x0266;

enum {
  PDREN0          = 0x0001,
  PDREN1          = 0x0002,
  PDREN2          = 0x0004,
  PDREN3          = 0x0008,
  PDREN4          = 0x0010,
  PDREN5          = 0x0020,
  PDREN6          = 0x0040,
  PDREN7          = 0x0080,
  PDREN8          = 0x0100,
  PDREN9          = 0x0200,
  PDREN10         = 0x0400,
  PDREN11         = 0x0800,
  PDREN12         = 0x1000,
  PDREN13         = 0x2000,
  PDREN14         = 0x4000,
  PDREN15         = 0x8000
};

__no_init volatile union
{
  unsigned short PDDS;   /* Port D Drive Strenght */

  struct
  {
    unsigned short PDDS0           : 1; /*  */
    unsigned short PDDS1           : 1; /*  */
    unsigned short PDDS2           : 1; /*  */
    unsigned short PDDS3           : 1; /*  */
    unsigned short PDDS4           : 1; /*  */
    unsigned short PDDS5           : 1; /*  */
    unsigned short PDDS6           : 1; /*  */
    unsigned short PDDS7           : 1; /*  */
    unsigned short PDDS8           : 1; /*  */
    unsigned short PDDS9           : 1; /*  */
    unsigned short PDDS10          : 1; /*  */
    unsigned short PDDS11          : 1; /*  */
    unsigned short PDDS12          : 1; /*  */
    unsigned short PDDS13          : 1; /*  */
    unsigned short PDDS14          : 1; /*  */
    unsigned short PDDS15          : 1; /*  */
  } PDDS_bit;

  struct
  {
    unsigned char PDDS_L;
    unsigned char PDDS_H;
  };
  struct
  {
    unsigned char P7DS;   /* Port 7 Drive Strenght */
    unsigned char P8DS;   /* Port 8 Drive Strenght */
  };
  struct
  {
    struct
    {
      unsigned char P7DS0           : 1; /*  */
      unsigned char P7DS1           : 1; /*  */
      unsigned char P7DS2           : 1; /*  */
      unsigned char P7DS3           : 1; /*  */
      unsigned char P7DS4           : 1; /*  */
      unsigned char P7DS5           : 1; /*  */
      unsigned char P7DS6           : 1; /*  */
      unsigned char P7DS7           : 1; /*  */
    } P7DS_bit;

    struct
    {
      unsigned char P8DS0           : 1; /*  */
      unsigned char P8DS1           : 1; /*  */
      unsigned char P8DS2           : 1; /*  */
      unsigned char P8DS3           : 1; /*  */
      unsigned char P8DS4           : 1; /*  */
      unsigned char P8DS5           : 1; /*  */
      unsigned char P8DS6           : 1; /*  */
      unsigned char P8DS7           : 1; /*  */
    } P8DS_bit;
  }; 
} @0x0268;

enum {
  PDDS0           = 0x0001,
  PDDS1           = 0x0002,
  PDDS2           = 0x0004,
  PDDS3           = 0x0008,
  PDDS4           = 0x0010,
  PDDS5           = 0x0020,
  PDDS6           = 0x0040,
  PDDS7           = 0x0080,
  PDDS8           = 0x0100,
  PDDS9           = 0x0200,
  PDDS10          = 0x0400,
  PDDS11          = 0x0800,
  PDDS12          = 0x1000,
  PDDS13          = 0x2000,
  PDDS14          = 0x4000,
  PDDS15          = 0x8000
};

__no_init volatile union
{
  unsigned short PDSEL;   /* Port D Selection */

  struct
  {
    unsigned short PDSEL0          : 1; /*  */
    unsigned short PDSEL1          : 1; /*  */
    unsigned short PDSEL2          : 1; /*  */
    unsigned short PDSEL3          : 1; /*  */
    unsigned short PDSEL4          : 1; /*  */
    unsigned short PDSEL5          : 1; /*  */
    unsigned short PDSEL6          : 1; /*  */
    unsigned short PDSEL7          : 1; /*  */
    unsigned short PDSEL8          : 1; /*  */
    unsigned short PDSEL9          : 1; /*  */
    unsigned short PDSEL10         : 1; /*  */
    unsigned short PDSEL11         : 1; /*  */
    unsigned short PDSEL12         : 1; /*  */
    unsigned short PDSEL13         : 1; /*  */
    unsigned short PDSEL14         : 1; /*  */
    unsigned short PDSEL15         : 1; /*  */
  } PDSEL_bit;

  struct
  {
    unsigned char PDSEL_L;
    unsigned char PDSEL_H;
  };
  struct
  {
    unsigned char P7SEL;   /* Port 7 Selection */
    unsigned char P8SEL;   /* Port 8 Selection */
  };
  struct
  {
    struct
    {
      unsigned char P7SEL0          : 1; /*  */
      unsigned char P7SEL1          : 1; /*  */
      unsigned char P7SEL2          : 1; /*  */
      unsigned char P7SEL3          : 1; /*  */
      unsigned char P7SEL4          : 1; /*  */
      unsigned char P7SEL5          : 1; /*  */
      unsigned char P7SEL6          : 1; /*  */
      unsigned char P7SEL7          : 1; /*  */
    } P7SEL_bit;

    struct
    {
      unsigned char P8SEL0          : 1; /*  */
      unsigned char P8SEL1          : 1; /*  */
      unsigned char P8SEL2          : 1; /*  */
      unsigned char P8SEL3          : 1; /*  */
      unsigned char P8SEL4          : 1; /*  */
      unsigned char P8SEL5          : 1; /*  */
      unsigned char P8SEL6          : 1; /*  */
      unsigned char P8SEL7          : 1; /*  */
    } P8SEL_bit;
  }; 
} @0x026A;

enum {
  PDSEL0          = 0x0001,
  PDSEL1          = 0x0002,
  PDSEL2          = 0x0004,
  PDSEL3          = 0x0008,
  PDSEL4          = 0x0010,
  PDSEL5          = 0x0020,
  PDSEL6          = 0x0040,
  PDSEL7          = 0x0080,
  PDSEL8          = 0x0100,
  PDSEL9          = 0x0200,
  PDSEL10         = 0x0400,
  PDSEL11         = 0x0800,
  PDSEL12         = 0x1000,
  PDSEL13         = 0x2000,
  PDSEL14         = 0x4000,
  PDSEL15         = 0x8000
};



#define __MSP430_HAS_PORT7_R__        /* Definition to show that Module is available */
#define __MSP430_HAS_PORT8_R__        /* Definition to show that Module is available */
#define __MSP430_HAS_PORTD_R__        /* Definition to show that Module is available */
#define __MSP430_HAS_P7SEL__          /* Define for DriverLib */
#define __MSP430_HAS_P8SEL__          /* Define for DriverLib */
#define __MSP430_HAS_PDSEL__          /* Define for DriverLib */
#define __MSP430_BASEADDRESS_PORT7_R__ 0x0260
#define P7_BASE __MSP430_BASEADDRESS_PORT7_R__
#define __MSP430_BASEADDRESS_PORT8_R__ 0x0260
#define P8_BASE __MSP430_BASEADDRESS_PORT8_R__
#define __MSP430_BASEADDRESS_PORTD_R__ 0x0260
#define PD_BASE __MSP430_BASEADDRESS_PORTD_R__

/*-------------------------------------------------------------------------
 *   Port 7/8
 *-------------------------------------------------------------------------*/


enum {
  P7IN0           = 0x0001,
  P7IN1           = 0x0002,
  P7IN2           = 0x0004,
  P7IN3           = 0x0008,
  P7IN4           = 0x0010,
  P7IN5           = 0x0020,
  P7IN6           = 0x0040,
  P7IN7           = 0x0080
};

enum {
  P7OUT0          = 0x0001,
  P7OUT1          = 0x0002,
  P7OUT2          = 0x0004,
  P7OUT3          = 0x0008,
  P7OUT4          = 0x0010,
  P7OUT5          = 0x0020,
  P7OUT6          = 0x0040,
  P7OUT7          = 0x0080
};

enum {
  P7DIR0          = 0x0001,
  P7DIR1          = 0x0002,
  P7DIR2          = 0x0004,
  P7DIR3          = 0x0008,
  P7DIR4          = 0x0010,
  P7DIR5          = 0x0020,
  P7DIR6          = 0x0040,
  P7DIR7          = 0x0080
};

enum {
  P7REN0          = 0x0001,
  P7REN1          = 0x0002,
  P7REN2          = 0x0004,
  P7REN3          = 0x0008,
  P7REN4          = 0x0010,
  P7REN5          = 0x0020,
  P7REN6          = 0x0040,
  P7REN7          = 0x0080
};

enum {
  P7DS0           = 0x0001,
  P7DS1           = 0x0002,
  P7DS2           = 0x0004,
  P7DS3           = 0x0008,
  P7DS4           = 0x0010,
  P7DS5           = 0x0020,
  P7DS6           = 0x0040,
  P7DS7           = 0x0080
};

enum {
  P7SEL0          = 0x0001,
  P7SEL1          = 0x0002,
  P7SEL2          = 0x0004,
  P7SEL3          = 0x0008,
  P7SEL4          = 0x0010,
  P7SEL5          = 0x0020,
  P7SEL6          = 0x0040,
  P7SEL7          = 0x0080
};

enum {
  P8IN0           = 0x0001,
  P8IN1           = 0x0002,
  P8IN2           = 0x0004,
  P8IN3           = 0x0008,
  P8IN4           = 0x0010,
  P8IN5           = 0x0020,
  P8IN6           = 0x0040,
  P8IN7           = 0x0080
};

enum {
  P8OUT0          = 0x0001,
  P8OUT1          = 0x0002,
  P8OUT2          = 0x0004,
  P8OUT3          = 0x0008,
  P8OUT4          = 0x0010,
  P8OUT5          = 0x0020,
  P8OUT6          = 0x0040,
  P8OUT7          = 0x0080
};

enum {
  P8DIR0          = 0x0001,
  P8DIR1          = 0x0002,
  P8DIR2          = 0x0004,
  P8DIR3          = 0x0008,
  P8DIR4          = 0x0010,
  P8DIR5          = 0x0020,
  P8DIR6          = 0x0040,
  P8DIR7          = 0x0080
};

enum {
  P8REN0          = 0x0001,
  P8REN1          = 0x0002,
  P8REN2          = 0x0004,
  P8REN3          = 0x0008,
  P8REN4          = 0x0010,
  P8REN5          = 0x0020,
  P8REN6          = 0x0040,
  P8REN7          = 0x0080
};

enum {
  P8DS0           = 0x0001,
  P8DS1           = 0x0002,
  P8DS2           = 0x0004,
  P8DS3           = 0x0008,
  P8DS4           = 0x0010,
  P8DS5           = 0x0020,
  P8DS6           = 0x0040,
  P8DS7           = 0x0080
};

enum {
  P8SEL0          = 0x0001,
  P8SEL1          = 0x0002,
  P8SEL2          = 0x0004,
  P8SEL3          = 0x0008,
  P8SEL4          = 0x0010,
  P8SEL5          = 0x0020,
  P8SEL6          = 0x0040,
  P8SEL7          = 0x0080
};



/*-------------------------------------------------------------------------
 *   Port J
 *-------------------------------------------------------------------------*/


