snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned __READ short PJIN;   /* Port J Input */

  struct
  {
    unsigned __READ short PJIN0           : 1; /*  */
    unsigned __READ short PJIN1           : 1; /*  */
    unsigned __READ short PJIN2           : 1; /*  */
    unsigned __READ short PJIN3           : 1; /*  */
  } PJIN_bit;

  struct
  {
    unsigned __READ char PJIN_L;
    unsigned __READ char PJIN_H;
  };
} @0x0320;

enum {
  PJIN0           = 0x0001,
  PJIN1           = 0x0002,
  PJIN2           = 0x0004,
  PJIN3           = 0x0008
};

__no_init volatile union
{
  unsigned short PJOUT;   /* Port J Output */

  struct
  {
    unsigned short PJOUT0          : 1; /*  */
    unsigned short PJOUT1          : 1; /*  */
    unsigned short PJOUT2          : 1; /*  */
    unsigned short PJOUT3          : 1; /*  */
  } PJOUT_bit;

  struct
  {
    unsigned char PJOUT_L;
    unsigned char PJOUT_H;
  };
} @0x0322;

enum {
  PJOUT0          = 0x0001,
  PJOUT1          = 0x0002,
  PJOUT2          = 0x0004,
  PJOUT3          = 0x0008
};

__no_init volatile union
{
  unsigned short PJDIR;   /* Port J Direction */

  struct
  {
    unsigned short PJDIR0          : 1; /*  */
    unsigned short PJDIR1          : 1; /*  */
    unsigned short PJDIR2          : 1; /*  */
    unsigned short PJDIR3          : 1; /*  */
  } PJDIR_bit;

  struct
  {
    unsigned char PJDIR_L;
    unsigned char PJDIR_H;
  };
} @0x0324;

enum {
  PJDIR0          = 0x0001,
  PJDIR1          = 0x0002,
  PJDIR2          = 0x0004,
  PJDIR3          = 0x0008
};

__no_init volatile union
{
  unsigned short PJREN;   /* Port J Resistor Enable */

  struct
  {
    unsigned short PJREN0          : 1; /*  */
    unsigned short PJREN1          : 1; /*  */
    unsigned short PJREN2          : 1; /*  */
    unsigned short PJREN3          : 1; /*  */
  } PJREN_bit;

  struct
  {
    unsigned char PJREN_L;
    unsigned char PJREN_H;
  };
} @0x0326;

enum {
  PJREN0          = 0x0001,
  PJREN1          = 0x0002,
  PJREN2          = 0x0004,
  PJREN3          = 0x0008
};

__no_init volatile union
{
  unsigned short PJDS;   /* Port J Drive Strenght */

  struct
  {
    unsigned short PJDS0           : 1; /*  */
    unsigned short PJDS1           : 1; /*  */
    unsigned short PJDS2           : 1; /*  */
    unsigned short PJDS3           : 1; /*  */
  } PJDS_bit;

  struct
  {
    unsigned char PJDS_L;
    unsigned char PJDS_H;
  };
} @0x0328;

enum {
  PJDS0           = 0x0001,
  PJDS1           = 0x0002,
  PJDS2           = 0x0004,
  PJDS3           = 0x0008
};



#define __MSP430_HAS_PORTJ_R__        /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_PORTJ_R__ 0x0320
#define PJ_BASE __MSP430_BASEADDRESS_PORTJ_R__

/*-------------------------------------------------------------------------
 *   Port Mapping Control
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short PMAPKEYID;   /* Port Mapping Key register */
  struct
  {
    unsigned char PMAPKEYID_L;
    unsigned char PMAPKEYID_H;
  };
} @0x01C0;

__no_init volatile union
{
  unsigned short PMAPCTL;   /* Port Mapping control register */

  struct
  {
    unsigned short PMAPLOCKED      : 1; /* Port Mapping Lock bit. Read only */
    unsigned short PMAPRECFG       : 1; /* Port Mapping re-configuration control bit */
  } PMAPCTL_bit;

  struct
  {
    unsigned char PMAPCTL_L;
    unsigned char PMAPCTL_H;
  };
} @0x01C2;

enum {
  PMAPLOCKED      = 0x0001,
  PMAPRECFG       = 0x0002
};



#define __MSP430_HAS_PORT_MAPPING__   /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_PORT_MAPPING__ 0x01C0
#define PMAP_CTRL_BASE __MSP430_BASEADDRESS_PORT_MAPPING__

#define  PMAPKEY             (0x2D52u)  /* Port Mapping Key */
#define  PMAPPWD             PMAPKEYID /* Legacy Definition: Mapping Key register */
#define  PMAPPW              (0x2D52u)  /* Legacy Definition: Port Mapping Password */
/* PMAPCTL Control Bits */
#define PMAPLOCKED_L        (0x0001u)  /* Port Mapping Lock bit. Read only */
#define PMAPRECFG_L         (0x0002u)  /* Port Mapping re-configuration control bit */

/*-------------------------------------------------------------------------
 *   Port Mapping Port 4
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short P4MAP01;   /* Port P4.0/1 mapping register */

  struct
  {
    unsigned short PMAP01_0        : 1; /*  */
    unsigned short PMAP01_1        : 1; /*  */
    unsigned short PMAP01_2        : 1; /*  */
    unsigned short PMAP01_3        : 1; /*  */
    unsigned short PMAP01_4        : 1; /*  */
    unsigned short PMAP01_5        : 1; /*  */
    unsigned short PMAP01_6        : 1; /*  */
    unsigned short PMAP01_7        : 1; /*  */
    unsigned short PMAP01_8        : 1; /*  */
    unsigned short PMAP01_9        : 1; /*  */
    unsigned short PMAP01_10       : 1; /*  */
    unsigned short PMAP01_11       : 1; /*  */
    unsigned short PMAP01_12       : 1; /*  */
    unsigned short PMAP01_13       : 1; /*  */
    unsigned short PMAP01_14       : 1; /*  */
    unsigned short PMAP01_15       : 1; /*  */
  } P4MAP01_bit;

  struct
  {
    unsigned char P4MAP01_L;
    unsigned char P4MAP01_H;
  };
  struct
  {
    unsigned char P4MAP0;   /* Port P4.0 mapping register */
    unsigned char P4MAP1;   /* Port P4.1 mapping register */
  };
  struct
  {
    struct
    {
      unsigned char PMAP0           : 1; /*  */
      unsigned char PMAP1           : 1; /*  */
      unsigned char PMAP2           : 1; /*  */
      unsigned char PMAP3           : 1; /*  */
      unsigned char PMAP4           : 1; /*  */
      unsigned char PMAP5           : 1; /*  */
      unsigned char PMAP6           : 1; /*  */
      unsigned char PMAP7           : 1; /*  */
    } P4MAP0_bit;

    struct
    {
      unsigned char PMAP0           : 1; /*  */
      unsigned char PMAP1           : 1; /*  */
      unsigned char PMAP2           : 1; /*  */
      unsigned char PMAP3           : 1; /*  */
      unsigned char PMAP4           : 1; /*  */
      unsigned char PMAP5           : 1; /*  */
      unsigned char PMAP6           : 1; /*  */
      unsigned char PMAP7           : 1; /*  */
    } P4MAP1_bit;
  }; 
} @0x01E0;

enum {
  PMAP01_0        = 0x0001,
  PMAP01_1        = 0x0002,
  PMAP01_2        = 0x0004,
  PMAP01_3        = 0x0008,
  PMAP01_4        = 0x0010,
  PMAP01_5        = 0x0020,
  PMAP01_6        = 0x0040,
  PMAP01_7        = 0x0080,
  PMAP01_8        = 0x0100,
  PMAP01_9        = 0x0200,
  PMAP01_10       = 0x0400,
  PMAP01_11       = 0x0800,
  PMAP01_12       = 0x1000,
  PMAP01_13       = 0x2000,
  PMAP01_14       = 0x4000,
  PMAP01_15       = 0x8000
};

