snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short P4MAP23;   /* Port P4.2/3 mapping register */

  struct
  {
    unsigned short PMAP23_0        : 1; /*  */
    unsigned short PMAP23_1        : 1; /*  */
    unsigned short PMAP23_2        : 1; /*  */
    unsigned short PMAP23_3        : 1; /*  */
    unsigned short PMAP23_4        : 1; /*  */
    unsigned short PMAP23_5        : 1; /*  */
    unsigned short PMAP23_6        : 1; /*  */
    unsigned short PMAP23_7        : 1; /*  */
    unsigned short PMAP23_8        : 1; /*  */
    unsigned short PMAP23_9        : 1; /*  */
    unsigned short PMAP23_10       : 1; /*  */
    unsigned short PMAP23_11       : 1; /*  */
    unsigned short PMAP23_12       : 1; /*  */
    unsigned short PMAP23_13       : 1; /*  */
    unsigned short PMAP23_14       : 1; /*  */
    unsigned short PMAP23_15       : 1; /*  */
  } P4MAP23_bit;

  struct
  {
    unsigned char P4MAP23_L;
    unsigned char P4MAP23_H;
  };
  struct
  {
    unsigned char P4MAP2;   /* Port P4.2 mapping register */
    unsigned char P4MAP3;   /* Port P4.3 mapping register */
  };
  struct
  {
    struct
    {
      unsigned char PMAP0           : 1; /*  */
      unsigned char PMAP1           : 1; /*  */
      unsigned char PMAP2           : 1; /*  */
      unsigned char PMAP3           : 1; /*  */
      unsigned char PMAP4           : 1; /*  */
      unsigned char PMAP5           : 1; /*  */
      unsigned char PMAP6           : 1; /*  */
      unsigned char PMAP7           : 1; /*  */
    } P4MAP2_bit;

    struct
    {
      unsigned char PMAP0           : 1; /*  */
      unsigned char PMAP1           : 1; /*  */
      unsigned char PMAP2           : 1; /*  */
      unsigned char PMAP3           : 1; /*  */
      unsigned char PMAP4           : 1; /*  */
      unsigned char PMAP5           : 1; /*  */
      unsigned char PMAP6           : 1; /*  */
      unsigned char PMAP7           : 1; /*  */
    } P4MAP3_bit;
  }; 
} @0x01E2;

enum {
  PMAP23_0        = 0x0001,
  PMAP23_1        = 0x0002,
  PMAP23_2        = 0x0004,
  PMAP23_3        = 0x0008,
  PMAP23_4        = 0x0010,
  PMAP23_5        = 0x0020,
  PMAP23_6        = 0x0040,
  PMAP23_7        = 0x0080,
  PMAP23_8        = 0x0100,
  PMAP23_9        = 0x0200,
  PMAP23_10       = 0x0400,
  PMAP23_11       = 0x0800,
  PMAP23_12       = 0x1000,
  PMAP23_13       = 0x2000,
  PMAP23_14       = 0x4000,
  PMAP23_15       = 0x8000
};

__no_init volatile union
{
  unsigned short P4MAP45;   /* Port P4.4/5 mapping register */

  struct
  {
    unsigned short PMAP45_0        : 1; /*  */
    unsigned short PMAP45_1        : 1; /*  */
    unsigned short PMAP45_2        : 1; /*  */
    unsigned short PMAP45_3        : 1; /*  */
    unsigned short PMAP45_4        : 1; /*  */
    unsigned short PMAP45_5        : 1; /*  */
    unsigned short PMAP45_6        : 1; /*  */
    unsigned short PMAP45_7        : 1; /*  */
    unsigned short PMAP45_8        : 1; /*  */
    unsigned short PMAP45_9        : 1; /*  */
    unsigned short PMAP45_10       : 1; /*  */
    unsigned short PMAP45_11       : 1; /*  */
    unsigned short PMAP45_12       : 1; /*  */
    unsigned short PMAP45_13       : 1; /*  */
    unsigned short PMAP45_14       : 1; /*  */
    unsigned short PMAP45_15       : 1; /*  */
  } P4MAP45_bit;

  struct
  {
    unsigned char P4MAP45_L;
    unsigned char P4MAP45_H;
  };
  struct
  {
    unsigned char P4MAP4;   /* Port P4.4 mapping register */
    unsigned char P4MAP5;   /* Port P4.5 mapping register */
  };
  struct
  {
    struct
    {
      unsigned char PMAP0           : 1; /*  */
      unsigned char PMAP1           : 1; /*  */
      unsigned char PMAP2           : 1; /*  */
      unsigned char PMAP3           : 1; /*  */
      unsigned char PMAP4           : 1; /*  */
      unsigned char PMAP5           : 1; /*  */
      unsigned char PMAP6           : 1; /*  */
      unsigned char PMAP7           : 1; /*  */
    } P4MAP4_bit;

    struct
    {
      unsigned char PMAP0           : 1; /*  */
      unsigned char PMAP1           : 1; /*  */
      unsigned char PMAP2           : 1; /*  */
      unsigned char PMAP3           : 1; /*  */
      unsigned char PMAP4           : 1; /*  */
      unsigned char PMAP5           : 1; /*  */
      unsigned char PMAP6           : 1; /*  */
      unsigned char PMAP7           : 1; /*  */
    } P4MAP5_bit;
  }; 
} @0x01E4;

enum {
  PMAP45_0        = 0x0001,
  PMAP45_1        = 0x0002,
  PMAP45_2        = 0x0004,
  PMAP45_3        = 0x0008,
  PMAP45_4        = 0x0010,
  PMAP45_5        = 0x0020,
  PMAP45_6        = 0x0040,
  PMAP45_7        = 0x0080,
  PMAP45_8        = 0x0100,
  PMAP45_9        = 0x0200,
  PMAP45_10       = 0x0400,
  PMAP45_11       = 0x0800,
  PMAP45_12       = 0x1000,
  PMAP45_13       = 0x2000,
  PMAP45_14       = 0x4000,
  PMAP45_15       = 0x8000
};

__no_init volatile union
{
  unsigned short P4MAP67;   /* Port P4.6/7 mapping register */

  struct
  {
    unsigned short PMAP67_0        : 1; /*  */
    unsigned short PMAP67_1        : 1; /*  */
    unsigned short PMAP67_2        : 1; /*  */
    unsigned short PMAP67_3        : 1; /*  */
    unsigned short PMAP67_4        : 1; /*  */
    unsigned short PMAP67_5        : 1; /*  */
    unsigned short PMAP67_6        : 1; /*  */
    unsigned short PMAP67_7        : 1; /*  */
    unsigned short PMAP67_8        : 1; /*  */
    unsigned short PMAP67_9        : 1; /*  */
    unsigned short PMAP67_10       : 1; /*  */
    unsigned short PMAP67_11       : 1; /*  */
    unsigned short PMAP67_12       : 1; /*  */
    unsigned short PMAP67_13       : 1; /*  */
    unsigned short PMAP67_14       : 1; /*  */
    unsigned short PMAP67_15       : 1; /*  */
  } P4MAP67_bit;

  struct
  {
    unsigned char P4MAP67_L;
    unsigned char P4MAP67_H;
  };
  struct
  {
    unsigned char P4MAP6;   /* Port P4.6 mapping register */
    unsigned char P4MAP7;   /* Port P4.7 mapping register */
  };
  struct
  {
    struct
    {
      unsigned char PMAP0           : 1; /*  */
      unsigned char PMAP1           : 1; /*  */
      unsigned char PMAP2           : 1; /*  */
      unsigned char PMAP3           : 1; /*  */
      unsigned char PMAP4           : 1; /*  */
      unsigned char PMAP5           : 1; /*  */
      unsigned char PMAP6           : 1; /*  */
      unsigned char PMAP7           : 1; /*  */
    } P4MAP6_bit;

    struct
    {
      unsigned char PMAP0           : 1; /*  */
      unsigned char PMAP1           : 1; /*  */
      unsigned char PMAP2           : 1; /*  */
      unsigned char PMAP3           : 1; /*  */
      unsigned char PMAP4           : 1; /*  */
      unsigned char PMAP5           : 1; /*  */
      unsigned char PMAP6           : 1; /*  */
      unsigned char PMAP7           : 1; /*  */
    } P4MAP7_bit;
  }; 
} @0x01E6;

enum {
  PMAP67_0        = 0x0001,
  PMAP67_1        = 0x0002,
  PMAP67_2        = 0x0004,
  PMAP67_3        = 0x0008,
  PMAP67_4        = 0x0010,
  PMAP67_5        = 0x0020,
  PMAP67_6        = 0x0040,
  PMAP67_7        = 0x0080,
  PMAP67_8        = 0x0100,
  PMAP67_9        = 0x0200,
  PMAP67_10       = 0x0400,
  PMAP67_11       = 0x0800,
  PMAP67_12       = 0x1000,
  PMAP67_13       = 0x2000,
  PMAP67_14       = 0x4000,
  PMAP67_15       = 0x8000
};

enum {
  PMAP0           = 0x0001,
  PMAP1           = 0x0002,
  PMAP2           = 0x0004,
  PMAP3           = 0x0008,
  PMAP4           = 0x0010,
  PMAP5           = 0x0020,
  PMAP6           = 0x0040,
  PMAP7           = 0x0080
};

