snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
/*
enum {
  PMAP0           = 0x0001,
  PMAP1           = 0x0002,
  PMAP2           = 0x0004,
  PMAP3           = 0x0008,
  PMAP4           = 0x0010,
  PMAP5           = 0x0020,
  PMAP6           = 0x0040,
  PMAP7           = 0x0080,
};

*/
/*
enum {
  PMAP0           = 0x0001,
  PMAP1           = 0x0002,
  PMAP2           = 0x0004,
  PMAP3           = 0x0008,
  PMAP4           = 0x0010,
  PMAP5           = 0x0020,
  PMAP6           = 0x0040,
  PMAP7           = 0x0080,
};

*/
/*
enum {
  PMAP0           = 0x0001,
  PMAP1           = 0x0002,
  PMAP2           = 0x0004,
  PMAP3           = 0x0008,
  PMAP4           = 0x0010,
  PMAP5           = 0x0020,
  PMAP6           = 0x0040,
  PMAP7           = 0x0080,
};

*/
/*
enum {
  PMAP0           = 0x0001,
  PMAP1           = 0x0002,
  PMAP2           = 0x0004,
  PMAP3           = 0x0008,
  PMAP4           = 0x0010,
  PMAP5           = 0x0020,
  PMAP6           = 0x0040,
  PMAP7           = 0x0080,
};

*/
/*
enum {
  PMAP0           = 0x0001,
  PMAP1           = 0x0002,
  PMAP2           = 0x0004,
  PMAP3           = 0x0008,
  PMAP4           = 0x0010,
  PMAP5           = 0x0020,
  PMAP6           = 0x0040,
  PMAP7           = 0x0080,
};

*/
/*
enum {
  PMAP0           = 0x0001,
  PMAP1           = 0x0002,
  PMAP2           = 0x0004,
  PMAP3           = 0x0008,
  PMAP4           = 0x0010,
  PMAP5           = 0x0020,
  PMAP6           = 0x0040,
  PMAP7           = 0x0080,
};

*/
/*
enum {
  PMAP0           = 0x0001,
  PMAP1           = 0x0002,
  PMAP2           = 0x0004,
  PMAP3           = 0x0008,
  PMAP4           = 0x0010,
  PMAP5           = 0x0020,
  PMAP6           = 0x0040,
  PMAP7           = 0x0080
};
*/



#define __MSP430_HAS_PORT4_MAPPING__   /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_PORT4_MAPPING__ 0x01E0
#define P4MAP_BASE __MSP430_BASEADDRESS_PORT4_MAPPING__

#define PM_NONE       0
#define PM_CBOUT0     1
#define PM_TB0CLK     1
#define PM_ADC12CLK   2
#define PM_DMAE0      2
#define PM_SVMOUT     3
#define PM_TB0OUTH    3
#define PM_TB0CCR0A   4
#define PM_TB0CCR1A   5
#define PM_TB0CCR2A   6
#define PM_TB0CCR3A   7
#define PM_TB0CCR4A   8
#define PM_TB0CCR5A   9
#define PM_TB0CCR6A   10
#define PM_UCA1RXD    11
#define PM_UCA1SOMI   11
#define PM_UCA1TXD    12
#define PM_UCA1SIMO   12
#define PM_UCA1CLK    13
#define PM_UCB1STE    13
#define PM_UCB1SOMI   14
#define PM_UCB1SCL    14
#define PM_UCB1SIMO   15
#define PM_UCB1SDA    15
#define PM_UCB1CLK    16
#define PM_UCA1STE    16
#define PM_CBOUT1     17
#define PM_MCLK       18
#define PM_ANALOG     31

/*-------------------------------------------------------------------------
 *   PMM  Power Management System
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short PMMCTL0;   /* PMM Control 0 */

  struct
  {
    unsigned short PMMCOREV0       : 1; /* PMM Core Voltage Bit: 0 */
    unsigned short PMMCOREV1       : 1; /* PMM Core Voltage Bit: 1 */
    unsigned short PMMSWBOR        : 1; /* PMM Software BOR */
    unsigned short PMMSWPOR        : 1; /* PMM Software POR */
    unsigned short PMMREGOFF       : 1; /* PMM Turn Regulator off */
    unsigned short                : 2;
    unsigned short PMMHPMRE        : 1; /* PMM Global High Power Module Request Enable */
  } PMMCTL0_bit;

  struct
  {
    unsigned char PMMCTL0_L;
    unsigned char PMMCTL0_H;
  };
} @0x0120;

enum {
  PMMCOREV0       = 0x0001,
  PMMCOREV1       = 0x0002,
  PMMSWBOR        = 0x0004,
  PMMSWPOR        = 0x0008,
  PMMREGOFF       = 0x0010,
  PMMHPMRE        = 0x0080
};

__no_init volatile union
{
  unsigned short PMMCTL1;   /* PMM Control 1 */

  struct
  {
    unsigned short PMMREFMD        : 1; /* PMM Reference Mode */
    unsigned short                : 3;
    unsigned short PMMCMD0         : 1; /* PMM Voltage Regulator Current Mode Bit: 0 */
    unsigned short PMMCMD1         : 1; /* PMM Voltage Regulator Current Mode Bit: 1 */
  } PMMCTL1_bit;

  struct
  {
    unsigned char PMMCTL1_L;
    unsigned char PMMCTL1_H;
  };
} @0x0122;

enum {
  PMMREFMD        = 0x0001,
  PMMCMD0         = 0x0010,
  PMMCMD1         = 0x0020
};

__no_init volatile union
{
  unsigned short SVSMHCTL;   /* SVS and SVM high side control register */

  struct
  {
    unsigned short SVSMHRRL0       : 1; /* SVS and SVM high side Reset Release Voltage Level Bit: 0 */
    unsigned short SVSMHRRL1       : 1; /* SVS and SVM high side Reset Release Voltage Level Bit: 1 */
    unsigned short SVSMHRRL2       : 1; /* SVS and SVM high side Reset Release Voltage Level Bit: 2 */
    unsigned short SVSMHDLYST      : 1; /* SVS and SVM high side delay status */
    unsigned short SVSHMD          : 1; /* SVS high side mode */
    unsigned short                : 1;
    unsigned short SVSMHEVM        : 1; /* SVS and SVM high side event mask */
    unsigned short SVSMHACE        : 1; /* SVS and SVM high side auto control enable */
    unsigned short SVSHRVL0        : 1; /* SVS high side reset voltage level Bit: 0 */
    unsigned short SVSHRVL1        : 1; /* SVS high side reset voltage level Bit: 1 */
    unsigned short SVSHE           : 1; /* SVS high side enable */
    unsigned short SVSHFP          : 1; /* SVS high side full performace mode */
    unsigned short SVMHOVPE        : 1; /* SVM high side over-voltage enable */
    unsigned short                : 1;
    unsigned short SVMHE           : 1; /* SVM high side enable */
    unsigned short SVMHFP          : 1; /* SVM high side full performace mode */
  } SVSMHCTL_bit;

  struct
  {
    unsigned char SVSMHCTL_L;
    unsigned char SVSMHCTL_H;
  };
} @0x0124;

enum {
  SVSMHRRL0       = 0x0001,
  SVSMHRRL1       = 0x0002,
  SVSMHRRL2       = 0x0004,
  SVSMHDLYST      = 0x0008,
  SVSHMD          = 0x0010,
  SVSMHEVM        = 0x0040,
  SVSMHACE        = 0x0080,
  SVSHRVL0        = 0x0100,
  SVSHRVL1        = 0x0200,
  SVSHE           = 0x0400,
  SVSHFP          = 0x0800,
  SVMHOVPE        = 0x1000,
  SVMHE           = 0x4000,
  SVMHFP          = 0x8000
};

