snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short SVSMLCTL;   /* SVS and SVM low side control register */

  struct
  {
    unsigned short SVSMLRRL0       : 1; /* SVS and SVM low side Reset Release Voltage Level Bit: 0 */
    unsigned short SVSMLRRL1       : 1; /* SVS and SVM low side Reset Release Voltage Level Bit: 1 */
    unsigned short SVSMLRRL2       : 1; /* SVS and SVM low side Reset Release Voltage Level Bit: 2 */
    unsigned short SVSMLDLYST      : 1; /* SVS and SVM low side delay status */
    unsigned short SVSLMD          : 1; /* SVS low side mode */
    unsigned short                : 1;
    unsigned short SVSMLEVM        : 1; /* SVS and SVM low side event mask */
    unsigned short SVSMLACE        : 1; /* SVS and SVM low side auto control enable */
    unsigned short SVSLRVL0        : 1; /* SVS low side reset voltage level Bit: 0 */
    unsigned short SVSLRVL1        : 1; /* SVS low side reset voltage level Bit: 1 */
    unsigned short SVSLE           : 1; /* SVS low side enable */
    unsigned short SVSLFP          : 1; /* SVS low side full performace mode */
    unsigned short SVMLOVPE        : 1; /* SVM low side over-voltage enable */
    unsigned short                : 1;
    unsigned short SVMLE           : 1; /* SVM low side enable */
    unsigned short SVMLFP          : 1; /* SVM low side full performace mode */
  } SVSMLCTL_bit;

  struct
  {
    unsigned char SVSMLCTL_L;
    unsigned char SVSMLCTL_H;
  };
} @0x0126;

enum {
  SVSMLRRL0       = 0x0001,
  SVSMLRRL1       = 0x0002,
  SVSMLRRL2       = 0x0004,
  SVSMLDLYST      = 0x0008,
  SVSLMD          = 0x0010,
  SVSMLEVM        = 0x0040,
  SVSMLACE        = 0x0080,
  SVSLRVL0        = 0x0100,
  SVSLRVL1        = 0x0200,
  SVSLE           = 0x0400,
  SVSLFP          = 0x0800,
  SVMLOVPE        = 0x1000,
  SVMLE           = 0x4000,
  SVMLFP          = 0x8000
};

__no_init volatile union
{
  unsigned short SVSMIO;   /* SVSIN and SVSOUT control register */

  struct
  {
    unsigned short                : 3;
    unsigned short SVMLOE          : 1; /* SVM low side output enable */
    unsigned short SVMLVLROE       : 1; /* SVM low side voltage level reached output enable */
    unsigned short SVMOUTPOL       : 1; /* SVMOUT pin polarity */
    unsigned short                : 5;
    unsigned short SVMHOE          : 1; /* SVM high side output enable */
    unsigned short SVMHVLROE       : 1; /* SVM high side voltage level reached output enable */
  } SVSMIO_bit;

  struct
  {
    unsigned char SVSMIO_L;
    unsigned char SVSMIO_H;
  };
} @0x0128;

enum {
  SVMLOE          = 0x0008,
  SVMLVLROE       = 0x0010,
  SVMOUTPOL       = 0x0020,
  SVMHOE          = 0x0800,
  SVMHVLROE       = 0x1000
};

__no_init volatile union
{
  unsigned short PMMIFG;   /* PMM Interrupt Flag */

  struct
  {
    unsigned short SVSMLDLYIFG     : 1; /* SVS and SVM low side Delay expired interrupt flag */
    unsigned short SVMLIFG         : 1; /* SVM low side interrupt flag */
    unsigned short SVMLVLRIFG      : 1; /* SVM low side Voltage Level Reached interrupt flag */
    unsigned short                : 1;
    unsigned short SVSMHDLYIFG     : 1; /* SVS and SVM high side Delay expired interrupt flag */
    unsigned short SVMHIFG         : 1; /* SVM high side interrupt flag */
    unsigned short SVMHVLRIFG      : 1; /* SVM high side Voltage Level Reached interrupt flag */
    unsigned short                : 1;
    unsigned short PMMBORIFG       : 1; /* PMM Software BOR interrupt flag */
    unsigned short PMMRSTIFG       : 1; /* PMM RESET pin interrupt flag */
    unsigned short PMMPORIFG       : 1; /* PMM Software POR interrupt flag */
    unsigned short                : 1;
    unsigned short SVSHIFG         : 1; /* SVS low side interrupt flag */
    unsigned short SVSLIFG         : 1; /* SVS high side interrupt flag */
    unsigned short                : 1;
    unsigned short PMMLPM5IFG      : 1; /* LPM5 indication Flag */
  } PMMIFG_bit;

  struct
  {
    unsigned char PMMIFG_L;
    unsigned char PMMIFG_H;
  };
} @0x012C;

enum {
  SVSMLDLYIFG     = 0x0001,
  SVMLIFG         = 0x0002,
  SVMLVLRIFG      = 0x0004,
  SVSMHDLYIFG     = 0x0010,
  SVMHIFG         = 0x0020,
  SVMHVLRIFG      = 0x0040,
  PMMBORIFG       = 0x0100,
  PMMRSTIFG       = 0x0200,
  PMMPORIFG       = 0x0400,
  SVSHIFG         = 0x1000,
  SVSLIFG         = 0x2000,
  PMMLPM5IFG      = 0x8000
};

__no_init volatile union
{
  unsigned short PMMRIE;   /* PMM and RESET Interrupt Enable */

  struct
  {
    unsigned short SVSMLDLYIE      : 1; /* SVS and SVM low side Delay expired interrupt enable */
    unsigned short SVMLIE          : 1; /* SVM low side interrupt enable */
    unsigned short SVMLVLRIE       : 1; /* SVM low side Voltage Level Reached interrupt enable */
    unsigned short                : 1;
    unsigned short SVSMHDLYIE      : 1; /* SVS and SVM high side Delay expired interrupt enable */
    unsigned short SVMHIE          : 1; /* SVM high side interrupt enable */
    unsigned short SVMHVLRIE       : 1; /* SVM high side Voltage Level Reached interrupt enable */
    unsigned short                : 1;
    unsigned short SVSLPE          : 1; /* SVS low side POR enable */
    unsigned short SVMLVLRPE       : 1; /* SVM low side Voltage Level reached POR enable */
    unsigned short                : 2;
    unsigned short SVSHPE          : 1; /* SVS high side POR enable */
    unsigned short SVMHVLRPE       : 1; /* SVM high side Voltage Level reached POR enable */
  } PMMRIE_bit;

  struct
  {
    unsigned char PMMRIE_L;
    unsigned char PMMRIE_H;
  };
} @0x012E;

enum {
  SVSMLDLYIE      = 0x0001,
  SVMLIE          = 0x0002,
  SVMLVLRIE       = 0x0004,
  SVSMHDLYIE      = 0x0010,
  SVMHIE          = 0x0020,
  SVMHVLRIE       = 0x0040,
  SVSLPE          = 0x0100,
  SVMLVLRPE       = 0x0200,
  SVSHPE          = 0x1000,
  SVMHVLRPE       = 0x2000
};

