snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short RCCTL0;   /* Ram Controller Control Register */

  struct
  {
    unsigned short RCRS0OFF        : 1; /* RAM Controller RAM Sector 0 Off */
    unsigned short RCRS1OFF        : 1; /* RAM Controller RAM Sector 1 Off */
    unsigned short RCRS2OFF        : 1; /* RAM Controller RAM Sector 2 Off */
    unsigned short RCRS3OFF        : 1; /* RAM Controller RAM Sector 3 Off */
    unsigned short                : 3;
    unsigned short RCRS7OFF        : 1; /* RAM Controller RAM Sector 7 (USB) Off */
  } RCCTL0_bit;

  struct
  {
    unsigned char RCCTL0_L;
    unsigned char RCCTL0_H;
  };
} @0x0158;

enum {
  RCRS0OFF        = 0x0001,
  RCRS1OFF        = 0x0002,
  RCRS2OFF        = 0x0004,
  RCRS3OFF        = 0x0008,
  RCRS7OFF        = 0x0080
};



#define __MSP430_HAS_RC__             /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_RC__ 0x0158
#define RAM_BASE __MSP430_BASEADDRESS_RC__
/* RCCTL0 Control Bits */
#define RCRS0OFF_L          (0x0001u)  /* RAM Controller RAM Sector 0 Off */
#define RCRS1OFF_L          (0x0002u)  /* RAM Controller RAM Sector 1 Off */
#define RCRS2OFF_L          (0x0004u)  /* RAM Controller RAM Sector 2 Off */
#define RCRS3OFF_L          (0x0008u)  /* RAM Controller RAM Sector 3 Off */
#define RCRS7OFF_L          (0x0080u)  /* RAM Controller RAM Sector 7 (USB) Off */

#define RCKEY               (0x5A00u)

/*-------------------------------------------------------------------------
 *   Shared Reference
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short REFCTL0;   /* REF Shared Reference control register 0 */

  struct
  {
    unsigned short REFON           : 1; /* REF Reference On */
    unsigned short REFOUT          : 1; /* REF Reference output Buffer On */
    unsigned short                : 1;
    unsigned short REFTCOFF        : 1; /* REF Temp.Sensor off */
    unsigned short REFVSEL0        : 1; /* REF Reference Voltage Level Select Bit:0 */
    unsigned short REFVSEL1        : 1; /* REF Reference Voltage Level Select Bit:1 */
    unsigned short                : 1;
    unsigned short REFMSTR         : 1; /* REF Master Control */
    unsigned short REFGENACT       : 1; /* REF Reference generator active */
    unsigned short REFBGACT        : 1; /* REF Reference bandgap active */
    unsigned short REFGENBUSY      : 1; /* REF Reference generator busy */
    unsigned short BGMODE          : 1; /* REF Bandgap mode */
  } REFCTL0_bit;

  struct
  {
    unsigned char REFCTL0_L;
    unsigned char REFCTL0_H;
  };
} @0x01B0;

enum {
  REFON           = 0x0001,
  REFOUT          = 0x0002,
  REFTCOFF        = 0x0008,
  REFVSEL0        = 0x0010,
  REFVSEL1        = 0x0020,
  REFMSTR         = 0x0080,
  REFGENACT       = 0x0100,
  REFBGACT        = 0x0200,
  REFGENBUSY      = 0x0400,
  BGMODE          = 0x0800
};



#define __MSP430_HAS_REF__          /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_REF__ 0x01B0
#define REF_BASE __MSP430_BASEADDRESS_REF__
/* REFCTL0 Control Bits */
#define REFON_L             (0x0001u)  /* REF Reference On */
#define REFOUT_L            (0x0002u)  /* REF Reference output Buffer On */
#define REFTCOFF_L          (0x0008u)  /* REF Temp.Sensor off */
#define REFVSEL0_L          (0x0010u)  /* REF Reference Voltage Level Select Bit:0 */
#define REFVSEL1_L          (0x0020u)  /* REF Reference Voltage Level Select Bit:1 */
#define REFMSTR_L           (0x0080u)  /* REF Master Control */
#define REFGENACT_H         (0x0001u)  /* REF Reference generator active */
#define REFBGACT_H          (0x0002u)  /* REF Reference bandgap active */
#define REFGENBUSY_H        (0x0004u)  /* REF Reference generator busy */
#define BGMODE_H            (0x0008u)  /* REF Bandgap mode */

#define REFVSEL_0           (0x0000u)  /* REF Reference Voltage Level Select 1.5V */
#define REFVSEL_1           (0x0010u)  /* REF Reference Voltage Level Select 2.0V */
#define REFVSEL_2           (0x0020u)  /* REF Reference Voltage Level Select 2.5V */
#define REFVSEL_3           (0x0030u)  /* REF Reference Voltage Level Select 2.5V */

/*-------------------------------------------------------------------------
 *   RTC  Real Time Clock
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short RTCCTL01;   /* Real Timer Control 0/1 */

  struct
  {
    unsigned short RTCRDYIFG       : 1; /* RTC Ready Interrupt Flag */
    unsigned short RTCAIFG         : 1; /* RTC Alarm Interrupt Flag */
    unsigned short RTCTEVIFG       : 1; /* RTC Time Event Interrupt Flag */
    unsigned short                : 1;
    unsigned short RTCRDYIE        : 1; /* RTC Ready Interrupt Enable Flag */
    unsigned short RTCAIE          : 1; /* RTC Alarm Interrupt Enable Flag */
    unsigned short RTCTEVIE        : 1; /* RTC Time Event Interrupt Enable Flag */
    unsigned short                : 1;
    unsigned short RTCTEV0         : 1; /* RTC Time Event 0 */
    unsigned short RTCTEV1         : 1; /* RTC Time Event 1 */
    unsigned short RTCSSEL0        : 1; /* RTC Source Select 0 */
    unsigned short RTCSSEL1        : 1; /* RTC Source Select 1 */
    unsigned short RTCRDY          : 1; /* RTC Ready */
    unsigned short RTCMODE         : 1; /* RTC Mode 0:Counter / 1: Calendar */
    unsigned short RTCHOLD         : 1; /* RTC Hold */
    unsigned short RTCBCD          : 1; /* RTC BCD  0:Binary / 1:BCD */
  } RTCCTL01_bit;

  struct
  {
    unsigned char RTCCTL01_L;
    unsigned char RTCCTL01_H;
  };
} @0x04A0;

enum {
  RTCRDYIFG       = 0x0001,
  RTCAIFG         = 0x0002,
  RTCTEVIFG       = 0x0004,
  RTCRDYIE        = 0x0010,
  RTCAIE          = 0x0020,
  RTCTEVIE        = 0x0040,
  RTCTEV0         = 0x0100,
  RTCTEV1         = 0x0200,
  RTCSSEL0        = 0x0400,
  RTCSSEL1        = 0x0800,
  RTCRDY          = 0x1000,
  RTCMODE         = 0x2000,
  RTCHOLD         = 0x4000,
  RTCBCD          = 0x8000
};

