snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short RTCCTL23;   /* Real Timer Control 2/3 */

  struct
  {
    unsigned short RTCCAL0         : 1; /* RTC Calibration Bit 0 */
    unsigned short RTCCAL1         : 1; /* RTC Calibration Bit 1 */
    unsigned short RTCCAL2         : 1; /* RTC Calibration Bit 2 */
    unsigned short RTCCAL3         : 1; /* RTC Calibration Bit 3 */
    unsigned short RTCCAL4         : 1; /* RTC Calibration Bit 4 */
    unsigned short RTCCAL5         : 1; /* RTC Calibration Bit 5 */
    unsigned short                : 1;
    unsigned short RTCCALS         : 1; /* RTC Calibration Sign */
    unsigned short RTCCALF0        : 1; /* RTC Calibration Frequency Bit 0 */
    unsigned short RTCCALF1        : 1; /* RTC Calibration Frequency Bit 1 */
  } RTCCTL23_bit;

  struct
  {
    unsigned char RTCCTL23_L;
    unsigned char RTCCTL23_H;
  };
} @0x04A2;

enum {
  RTCCAL0         = 0x0001,
  RTCCAL1         = 0x0002,
  RTCCAL2         = 0x0004,
  RTCCAL3         = 0x0008,
  RTCCAL4         = 0x0010,
  RTCCAL5         = 0x0020,
  RTCCALS         = 0x0080,
  RTCCALF0        = 0x0100,
  RTCCALF1        = 0x0200
};

__no_init volatile union
{
  unsigned short RTCPS0CTL;   /* Real Timer Prescale Timer 0 Control */

  struct
  {
    unsigned short RT0PSIFG        : 1; /* RTC Prescale Timer 0 Interrupt Flag */
    unsigned short RT0PSIE         : 1; /* RTC Prescale Timer 0 Interrupt Enable Flag */
    unsigned short RT0IP0          : 1; /* RTC Prescale Timer 0 Interrupt Interval Bit: 0 */
    unsigned short RT0IP1          : 1; /* RTC Prescale Timer 0 Interrupt Interval Bit: 1 */
    unsigned short RT0IP2          : 1; /* RTC Prescale Timer 0 Interrupt Interval Bit: 2 */
    unsigned short                : 3;
    unsigned short RT0PSHOLD       : 1; /* RTC Prescale Timer 0 Hold */
    unsigned short                : 2;
    unsigned short RT0PSDIV0       : 1; /* RTC Prescale Timer 0 Clock Divide Bit: 0 */
    unsigned short RT0PSDIV1       : 1; /* RTC Prescale Timer 0 Clock Divide Bit: 1 */
    unsigned short RT0PSDIV2       : 1; /* RTC Prescale Timer 0 Clock Divide Bit: 2 */
    unsigned short RT0SSEL         : 1; /* RTC Prescale Timer 0 Source Select 0:ACLK / 1:SMCLK */
  } RTCPS0CTL_bit;

  struct
  {
    unsigned char RTCPS0CTL_L;
    unsigned char RTCPS0CTL_H;
  };
} @0x04A8;

enum {
  RT0PSIFG        = 0x0001,
  RT0PSIE         = 0x0002,
  RT0IP0          = 0x0004,
  RT0IP1          = 0x0008,
  RT0IP2          = 0x0010,
  RT0PSHOLD       = 0x0100,
  RT0PSDIV0       = 0x0800,
  RT0PSDIV1       = 0x1000,
  RT0PSDIV2       = 0x2000,
  RT0SSEL         = 0x4000
};

__no_init volatile union
{
  unsigned short RTCPS1CTL;   /* Real Timer Prescale Timer 1 Control */

  struct
  {
    unsigned short RT1PSIFG        : 1; /* RTC Prescale Timer 1 Interrupt Flag */
    unsigned short RT1PSIE         : 1; /* RTC Prescale Timer 1 Interrupt Enable Flag */
    unsigned short RT1IP0          : 1; /* RTC Prescale Timer 1 Interrupt Interval Bit: 0 */
    unsigned short RT1IP1          : 1; /* RTC Prescale Timer 1 Interrupt Interval Bit: 1 */
    unsigned short RT1IP2          : 1; /* RTC Prescale Timer 1 Interrupt Interval Bit: 2 */
    unsigned short                : 3;
    unsigned short RT1PSHOLD       : 1; /* RTC Prescale Timer 1 Hold */
    unsigned short                : 2;
    unsigned short RT1PSDIV0       : 1; /* RTC Prescale Timer 1 Clock Divide Bit: 0 */
    unsigned short RT1PSDIV1       : 1; /* RTC Prescale Timer 1 Clock Divide Bit: 1 */
    unsigned short RT1PSDIV2       : 1; /* RTC Prescale Timer 1 Clock Divide Bit: 2 */
    unsigned short RT1SSEL0        : 1; /* RTC Prescale Timer 1 Source Select Bit 0 */
    unsigned short RT1SSEL1        : 1; /* RTC Prescale Timer 1 Source Select Bit 1 */
  } RTCPS1CTL_bit;

  struct
  {
    unsigned char RTCPS1CTL_L;
    unsigned char RTCPS1CTL_H;
  };
} @0x04AA;

enum {
  RT1PSIFG        = 0x0001,
  RT1PSIE         = 0x0002,
  RT1IP0          = 0x0004,
  RT1IP1          = 0x0008,
  RT1IP2          = 0x0010,
  RT1PSHOLD       = 0x0100,
  RT1PSDIV0       = 0x0800,
  RT1PSDIV1       = 0x1000,
  RT1PSDIV2       = 0x2000,
  RT1SSEL0        = 0x4000,
  RT1SSEL1        = 0x8000
};

__no_init volatile union
{
  unsigned short RTCPS;   /* Real Timer Prescale Timer Control */
  struct
  {
    unsigned char RTCPS_L;
    unsigned char RTCPS_H;
  };
} @0x04AC;


  /* Real Time Clock Interrupt Vector */
__no_init volatile unsigned short RTCIV @ 0x04AE;


__no_init volatile union
{
  unsigned short RTCTIM0;   /* Real Time Clock Time 0 */
  struct
  {
    unsigned char RTCTIM0_L;
    unsigned char RTCTIM0_H;
  };
  struct
  {
    unsigned char RTCSEC;   /*  */
    unsigned char RTCMIN;   /*  */
  };
  struct
  {
    struct
    {
      unsigned char SECONDS0        : 1; /*  */
      unsigned char SECONDS1        : 1; /*  */
      unsigned char SECONDS2        : 1; /*  */
      unsigned char SECONDS3        : 1; /*  */
      unsigned char SECONDS4        : 1; /*  */
      unsigned char SECONDS5        : 1; /*  */
      unsigned char SECONDS6        : 1; /*  */
    } RTCSEC_bit;

    struct
    {
      unsigned char MINUTES0        : 1; /*  */
      unsigned char MINUTES1        : 1; /*  */
      unsigned char MINUTES2        : 1; /*  */
      unsigned char MINUTES3        : 1; /*  */
      unsigned char MINUTES4        : 1; /*  */
      unsigned char MINUTES5        : 1; /*  */
      unsigned char MINUTES6        : 1; /*  */
    } RTCMIN_bit;
  }; 
} @0x04B0;

__no_init volatile union
{
  unsigned short RTCTIM1;   /* Real Time Clock Time 1 */
  struct
  {
    unsigned char RTCTIM1_L;
    unsigned char RTCTIM1_H;
  };
  struct
  {
    unsigned char RTCHOUR;   /*  */
    unsigned char RTCDOW;   /*  */
  };
  struct
  {
    struct
    {
      unsigned char HOUR0           : 1; /*  */
      unsigned char HOUR1           : 1; /*  */
      unsigned char HOUR2           : 1; /*  */
      unsigned char HOUR3           : 1; /*  */
      unsigned char HOUR4           : 1; /*  */
      unsigned char HOUR5           : 1; /*  */
      unsigned char HOUR6           : 1; /*  */
    } RTCHOUR_bit;

    struct
    {
      unsigned char DOW0            : 1; /*  */
      unsigned char DOW1            : 1; /*  */
      unsigned char DOW2            : 1; /*  */
      unsigned char DOW3            : 1; /*  */
      unsigned char DOW4            : 1; /*  */
      unsigned char DOW5            : 1; /*  */
      unsigned char DOW6            : 1; /*  */
    } RTCDOW_bit;
  }; 
} @0x04B2;

