snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short RTCDATE;   /* Real Time Clock Date */
  struct
  {
    unsigned char RTCDATE_L;
    unsigned char RTCDATE_H;
  };
  struct
  {
    unsigned char RTCDAY;   /*  */
    unsigned char RTCMON;   /*  */
  };
  struct
  {
    struct
    {
      unsigned char DAY0            : 1; /*  */
      unsigned char DAY1            : 1; /*  */
      unsigned char DAY2            : 1; /*  */
      unsigned char DAY3            : 1; /*  */
      unsigned char DAY4            : 1; /*  */
      unsigned char DAY5            : 1; /*  */
      unsigned char DAY6            : 1; /*  */
    } RTCDAY_bit;

    struct
    {
      unsigned char MONTH0          : 1; /*  */
      unsigned char MONTH1          : 1; /*  */
      unsigned char MONTH2          : 1; /*  */
      unsigned char MONTH3          : 1; /*  */
      unsigned char MONTH4          : 1; /*  */
      unsigned char MONTH5          : 1; /*  */
      unsigned char MONTH6          : 1; /*  */
    } RTCMON_bit;
  }; 
} @0x04B4;

__no_init volatile union
{
  unsigned short RTCYEAR;   /* Real Time Clock Year */
  struct
  {
    unsigned char RTCYEAR_L;
    unsigned char RTCYEAR_H;
  };
} @0x04B6;

__no_init volatile union
{
  unsigned short RTCAMINHR;   /* Real Time Clock Alarm Min/Hour */
  struct
  {
    unsigned char RTCAMINHR_L;
    unsigned char RTCAMINHR_H;
  };
  struct
  {
    unsigned char RTCAMIN;   /* Real Time Clock Alarm Min */
    unsigned char RTCAHOUR;   /* Real Time Clock Alarm Hour */
  };
  struct
  {
    struct
    {
      unsigned char MINUTES0        : 1; /*  */
      unsigned char MINUTES1        : 1; /*  */
      unsigned char MINUTES2        : 1; /*  */
      unsigned char MINUTES3        : 1; /*  */
      unsigned char MINUTES4        : 1; /*  */
      unsigned char MINUTES5        : 1; /*  */
      unsigned char MINUTES6        : 1; /*  */
      unsigned char RTCAE           : 1; /* Real Time Clock Alarm enable */
    } RTCAMIN_bit;

    struct
    {
      unsigned char HOUR0           : 1; /*  */
      unsigned char HOUR1           : 1; /*  */
      unsigned char HOUR2           : 1; /*  */
      unsigned char HOUR3           : 1; /*  */
      unsigned char HOUR4           : 1; /*  */
      unsigned char HOUR5           : 1; /*  */
      unsigned char HOUR6           : 1; /*  */
      unsigned char RTCAE           : 1; /* Real Time Clock Alarm enable */
    } RTCAHOUR_bit;
  }; 
} @0x04B8;

__no_init volatile union
{
  unsigned short RTCADOWDAY;   /* Real Time Clock Alarm day of week/day */
  struct
  {
    unsigned char RTCADOWDAY_L;
    unsigned char RTCADOWDAY_H;
  };
  struct
  {
    unsigned char RTCADOW;   /* Real Time Clock Alarm day of week */
    unsigned char RTCADAY;   /* Real Time Clock Alarm day */
  };
  struct
  {
    struct
    {
      unsigned char DOW0            : 1; /*  */
      unsigned char DOW1            : 1; /*  */
      unsigned char DOW2            : 1; /*  */
      unsigned char DOW3            : 1; /*  */
      unsigned char DOW4            : 1; /*  */
      unsigned char DOW5            : 1; /*  */
      unsigned char DOW6            : 1; /*  */
      unsigned char RTCAE           : 1; /* Real Time Clock Alarm enable */
    } RTCADOW_bit;

    struct
    {
      unsigned char DAY0            : 1; /*  */
      unsigned char DAY1            : 1; /*  */
      unsigned char DAY2            : 1; /*  */
      unsigned char DAY3            : 1; /*  */
      unsigned char DAY4            : 1; /*  */
      unsigned char DAY5            : 1; /*  */
      unsigned char DAY6            : 1; /*  */
      unsigned char RTCAE           : 1; /* Real Time Clock Alarm enable */
    } RTCADAY_bit;
  }; 
} @0x04BA;

enum {
  SECONDS0        = 0x0001,
  SECONDS1        = 0x0002,
  SECONDS2        = 0x0004,
  SECONDS3        = 0x0008,
  SECONDS4        = 0x0010,
  SECONDS5        = 0x0020,
  SECONDS6        = 0x0040
};

enum {
  MINUTES0        = 0x0001,
  MINUTES1        = 0x0002,
  MINUTES2        = 0x0004,
  MINUTES3        = 0x0008,
  MINUTES4        = 0x0010,
  MINUTES5        = 0x0020,
  MINUTES6        = 0x0040
};

enum {
  HOUR0           = 0x0001,
  HOUR1           = 0x0002,
  HOUR2           = 0x0004,
  HOUR3           = 0x0008,
  HOUR4           = 0x0010,
  HOUR5           = 0x0020,
  HOUR6           = 0x0040
};

enum {
  DOW0            = 0x0001,
  DOW1            = 0x0002,
  DOW2            = 0x0004,
  DOW3            = 0x0008,
  DOW4            = 0x0010,
  DOW5            = 0x0020,
  DOW6            = 0x0040
};

enum {
  DAY0            = 0x0001,
  DAY1            = 0x0002,
  DAY2            = 0x0004,
  DAY3            = 0x0008,
  DAY4            = 0x0010,
  DAY5            = 0x0020,
  DAY6            = 0x0040
};

enum {
  MONTH0          = 0x0001,
  MONTH1          = 0x0002,
  MONTH2          = 0x0004,
  MONTH3          = 0x0008,
  MONTH4          = 0x0010,
  MONTH5          = 0x0020,
  MONTH6          = 0x0040
};

enum {
/*  MINUTES0        = 0x0001, */
/*  MINUTES1        = 0x0002, */
/*  MINUTES2        = 0x0004, */
/*  MINUTES3        = 0x0008, */
/*  MINUTES4        = 0x0010, */
/*  MINUTES5        = 0x0020, */
/*  MINUTES6        = 0x0040, */
  RTCAE           = 0x0080
};

/*
enum {
  HOUR0           = 0x0001,
  HOUR1           = 0x0002,
  HOUR2           = 0x0004,
  HOUR3           = 0x0008,
  HOUR4           = 0x0010,
  HOUR5           = 0x0020,
  HOUR6           = 0x0040,
  RTCAE           = 0x0080,
};

*/
/*
enum {
  DOW0            = 0x0001,
  DOW1            = 0x0002,
  DOW2            = 0x0004,
  DOW3            = 0x0008,
  DOW4            = 0x0010,
  DOW5            = 0x0020,
  DOW6            = 0x0040,
  RTCAE           = 0x0080,
};

*/
/*
enum {
  DAY0            = 0x0001,
  DAY1            = 0x0002,
  DAY2            = 0x0004,
  DAY3            = 0x0008,
  DAY4            = 0x0010,
  DAY5            = 0x0020,
  DAY6            = 0x0040,
  RTCAE           = 0x0080
};
*/



#define __MSP430_HAS_RTC__            /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_RTC__ 0x04A0
#define RTC_A_BASE __MSP430_BASEADDRESS_RTC__
#define RTCCTL0             RTCCTL01_L  /* Real Time Clock Control 0 */
#define RTCCTL1             RTCCTL01_H  /* Real Time Clock Control 1 */
#define RTCCTL2             RTCCTL23_L  /* Real Time Clock Control 2 */
#define RTCCTL3             RTCCTL23_H  /* Real Time Clock Control 3 */
#define RTCNT12             RTCTIM0
#define RTCNT34             RTCTIM1
#define RTCNT1              RTCTIM0_L
#define RTCNT2              RTCTIM0_H
#define RTCNT3              RTCTIM1_L
#define RTCNT4              RTCTIM1_H
#define RTCYEARL            RTCYEAR_L
#define RTCYEARH            RTCYEAR_H
#define RT0PS               RTCPS_L
#define RT1PS               RTCPS_H
#define RTCTEVIE_L          (0x0040u)     /* RTC Time Event Interrupt Enable Flag */
#define RTCAIE_L            (0x0020u)     /* RTC Alarm Interrupt Enable Flag */
#define RTCRDYIE_L          (0x0010u)     /* RTC Ready Interrupt Enable Flag */
#define RTCTEVIFG_L         (0x0004u)     /* RTC Time Event Interrupt Flag */
#define RTCAIFG_L           (0x0002u)     /* RTC Alarm Interrupt Flag */
#define RTCRDYIFG_L         (0x0001u)     /* RTC Ready Interrupt Flag */
/* RTCCTL01 Control Bits */
#define RTCBCD_H            (0x0080u)     /* RTC BCD  0:Binary / 1:BCD */
#define RTCHOLD_H           (0x0040u)     /* RTC Hold */
#define RTCMODE_H           (0x0020u)     /* RTC Mode 0:Counter / 1: Calendar */
#define RTCRDY_H            (0x0010u)     /* RTC Ready */
#define RTCSSEL1_H          (0x0008u)     /* RTC Source Select 1 */
#define RTCSSEL0_H          (0x0004u)     /* RTC Source Select 0 */
#define RTCTEV1_H           (0x0002u)     /* RTC Time Event 1 */
#define RTCTEV0_H           (0x0001u)     /* RTC Time Event 0 */

#define RTCSSEL_0           (0x0000u)     /* RTC Source Select ACLK */
#define RTCSSEL_1           (0x0400u)     /* RTC Source Select SMCLK */
#define RTCSSEL_2           (0x0800u)     /* RTC Source Select RT1PS */
#define RTCSSEL_3           (0x0C00u)     /* RTC Source Select RT1PS */
#define RTCSSEL__ACLK       (0x0000u)     /* RTC Source Select ACLK */
#define RTCSSEL__SMCLK      (0x0400u)     /* RTC Source Select SMCLK */
#define RTCSSEL__RT1PS      (0x0800u)     /* RTC Source Select RT1PS */
#define RTCTEV_0            (0x0000u)     /* RTC Time Event: 0 (Min. changed) */
#define RTCTEV_1            (0x0100u)     /* RTC Time Event: 1 (Hour changed) */
#define RTCTEV_2            (0x0200u)     /* RTC Time Event: 2 (12:00 changed) */
#define RTCTEV_3            (0x0300u)     /* RTC Time Event: 3 (00:00 changed) */
#define RTCTEV__MIN         (0x0000u)     /* RTC Time Event: 0 (Min. changed) */
#define RTCTEV__HOUR        (0x0100u)     /* RTC Time Event: 1 (Hour changed) */
#define RTCTEV__0000        (0x0200u)     /* RTC Time Event: 2 (00:00 changed) */
#define RTCTEV__1200        (0x0300u)     /* RTC Time Event: 3 (12:00 changed) */
/* RTCCTL23 Control Bits */
#define RTCCALS_L           (0x0080u)     /* RTC Calibration Sign */
#define RTCCAL5_L           (0x0020u)     /* RTC Calibration Bit 5 */
#define RTCCAL4_L           (0x0010u)     /* RTC Calibration Bit 4 */
#define RTCCAL3_L           (0x0008u)     /* RTC Calibration Bit 3 */
#define RTCCAL2_L           (0x0004u)     /* RTC Calibration Bit 2 */
#define RTCCAL1_L           (0x0002u)     /* RTC Calibration Bit 1 */
#define RTCCAL0_L           (0x0001u)     /* RTC Calibration Bit 0 */
/* RTCCTL23 Control Bits */
#define RTCCALF1_H          (0x0002u)     /* RTC Calibration Frequency Bit 1 */
#define RTCCALF0_H          (0x0001u)     /* RTC Calibration Frequency Bit 0 */

#define RTCCALF_0           (0x0000u)     /* RTC Calibration Frequency: No Output */
#define RTCCALF_1           (0x0100u)     /* RTC Calibration Frequency: 512 Hz */
#define RTCCALF_2           (0x0200u)     /* RTC Calibration Frequency: 256 Hz */
#define RTCCALF_3           (0x0300u)     /* RTC Calibration Frequency: 1 Hz */
#define RT0IP2_L            (0x0010u)     /* RTC Prescale Timer 0 Interrupt Interval Bit: 2 */
#define RT0IP1_L            (0x0008u)     /* RTC Prescale Timer 0 Interrupt Interval Bit: 1 */
#define RT0IP0_L            (0x0004u)     /* RTC Prescale Timer 0 Interrupt Interval Bit: 0 */
#define RT0PSIE_L           (0x0002u)     /* RTC Prescale Timer 0 Interrupt Enable Flag */
#define RT0PSIFG_L          (0x0001u)     /* RTC Prescale Timer 0 Interrupt Flag */
#define RT0SSEL_H           (0x0040u)     /* RTC Prescale Timer 0 Source Select 0:ACLK / 1:SMCLK */
#define RT0PSDIV2_H         (0x0020u)     /* RTC Prescale Timer 0 Clock Divide Bit: 2 */
#define RT0PSDIV1_H         (0x0010u)     /* RTC Prescale Timer 0 Clock Divide Bit: 1 */
#define RT0PSDIV0_H         (0x0008u)     /* RTC Prescale Timer 0 Clock Divide Bit: 0 */
#define RT0PSHOLD_H         (0x0001u)     /* RTC Prescale Timer 0 Hold */

