snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short SFRIFG1;   /* Interrupt Flag 1 */

  struct
  {
    unsigned short WDTIFG          : 1; /* WDT Interrupt Flag */
    unsigned short OFIFG           : 1; /* Osc Fault Flag */
    unsigned short                : 1;
    unsigned short VMAIFG          : 1; /* Vacant Memory Interrupt Flag */
    unsigned short NMIIFG          : 1; /* NMI Interrupt Flag */
    unsigned short                : 1;
    unsigned short JMBINIFG        : 1; /* JTAG Mail Box input Interrupt Flag */
    unsigned short JMBOUTIFG       : 1; /* JTAG Mail Box output Interrupt Flag */
  } SFRIFG1_bit;

  struct
  {
    unsigned char SFRIFG1_L;
    unsigned char SFRIFG1_H;
  };
} @0x0102;

enum {
  WDTIFG          = 0x0001,
  OFIFG           = 0x0002,
  VMAIFG          = 0x0008,
  NMIIFG          = 0x0010,
  JMBINIFG        = 0x0040,
  JMBOUTIFG       = 0x0080
};

__no_init volatile union
{
  unsigned short SFRRPCR;   /* RESET Pin Control Register */

  struct
  {
    unsigned short SYSNMI          : 1; /* NMI select */
    unsigned short SYSNMIIES       : 1; /* NMI edge select */
    unsigned short SYSRSTUP        : 1; /* RESET Pin pull down/up select */
    unsigned short SYSRSTRE        : 1; /* RESET Pin Resistor enable */
  } SFRRPCR_bit;

  struct
  {
    unsigned char SFRRPCR_L;
    unsigned char SFRRPCR_H;
  };
} @0x0104;

enum {
  SYSNMI          = 0x0001,
  SYSNMIIES       = 0x0002,
  SYSRSTUP        = 0x0004,
  SYSRSTRE        = 0x0008
};



#define __MSP430_HAS_SFR__            /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_SFR__ 0x0100
#define SFR_BASE __MSP430_BASEADDRESS_SFR__

#define WDTIE_L             (0x0001u)  /* WDT Interrupt Enable */
#define OFIE_L              (0x0002u)  /* Osc Fault Enable */
#define VMAIE_L             (0x0008u)  /* Vacant Memory Interrupt Enable */
#define NMIIE_L             (0x0010u)  /* NMI Interrupt Enable */
#define ACCVIE_L            (0x0020u)  /* Flash Access Violation Interrupt Enable */
#define JMBINIE_L           (0x0040u)  /* JTAG Mail Box input Interrupt Enable */
#define JMBOUTIE_L          (0x0080u)  /* JTAG Mail Box output Interrupt Enable */

#define WDTIFG_L            (0x0001u)  /* WDT Interrupt Flag */
#define OFIFG_L             (0x0002u)  /* Osc Fault Flag */
#define VMAIFG_L            (0x0008u)  /* Vacant Memory Interrupt Flag */
#define NMIIFG_L            (0x0010u)  /* NMI Interrupt Flag */
#define JMBINIFG_L          (0x0040u)  /* JTAG Mail Box input Interrupt Flag */
#define JMBOUTIFG_L         (0x0080u)  /* JTAG Mail Box output Interrupt Flag */

#define SYSNMI_L            (0x0001u)  /* NMI select */
#define SYSNMIIES_L         (0x0002u)  /* NMI edge select */
#define SYSRSTUP_L          (0x0004u)  /* RESET Pin pull down/up select */
#define SYSRSTRE_L          (0x0008u)  /* RESET Pin Resistor enable */

/*-------------------------------------------------------------------------
 *   SYS  System Module
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short SYSCTL;   /* System control */

  struct
  {
    unsigned short SYSRIVECT       : 1; /* SYS - RAM based interrupt vectors */
    unsigned short                : 1;
    unsigned short SYSPMMPE        : 1; /* SYS - PMM access protect */
    unsigned short                : 1;
    unsigned short SYSBSLIND       : 1; /* SYS - TCK/RST indication detected */
    unsigned short SYSJTAGPIN      : 1; /* SYS - Dedicated JTAG pins enabled */
  } SYSCTL_bit;

  struct
  {
    unsigned char SYSCTL_L;
    unsigned char SYSCTL_H;
  };
} @0x0180;

enum {
  SYSRIVECT       = 0x0001,
  SYSPMMPE        = 0x0004,
  SYSBSLIND       = 0x0010,
  SYSJTAGPIN      = 0x0020
};

__no_init volatile union
{
  unsigned short SYSBSLC;   /* Boot strap configuration area */

  struct
  {
    unsigned short SYSBSLSIZE0     : 1; /* SYS - BSL Protection Size 0 */
    unsigned short SYSBSLSIZE1     : 1; /* SYS - BSL Protection Size 1 */
    unsigned short SYSBSLR         : 1; /* SYS - RAM assigned to BSL */
    unsigned short                : 11;
    unsigned short SYSBSLOFF       : 1; /* SYS - BSL Memory disabled */
    unsigned short SYSBSLPE        : 1; /* SYS - BSL Memory protection enabled */
  } SYSBSLC_bit;

  struct
  {
    unsigned char SYSBSLC_L;
    unsigned char SYSBSLC_H;
  };
} @0x0182;

enum {
  SYSBSLSIZE0     = 0x0001,
  SYSBSLSIZE1     = 0x0002,
  SYSBSLR         = 0x0004,
  SYSBSLOFF       = 0x4000,
  SYSBSLPE        = 0x8000
};

__no_init volatile union
{
  unsigned short SYSJMBC;   /* JTAG mailbox control */

  struct
  {
    unsigned short JMBIN0FG        : 1; /* SYS - Incoming JTAG Mailbox 0 Flag */
    unsigned short JMBIN1FG        : 1; /* SYS - Incoming JTAG Mailbox 1 Flag */
    unsigned short JMBOUT0FG       : 1; /* SYS - Outgoing JTAG Mailbox 0 Flag */
    unsigned short JMBOUT1FG       : 1; /* SYS - Outgoing JTAG Mailbox 1 Flag */
    unsigned short JMBMODE         : 1; /* SYS - JMB 16/32 Bit Mode */
    unsigned short                : 1;
    unsigned short JMBCLR0OFF      : 1; /* SYS - Incoming JTAG Mailbox 0 Flag auto-clear disalbe */
    unsigned short JMBCLR1OFF      : 1; /* SYS - Incoming JTAG Mailbox 1 Flag auto-clear disalbe */
  } SYSJMBC_bit;

  struct
  {
    unsigned char SYSJMBC_L;
    unsigned char SYSJMBC_H;
  };
} @0x0186;

enum {
  JMBIN0FG        = 0x0001,
  JMBIN1FG        = 0x0002,
  JMBOUT0FG       = 0x0004,
  JMBOUT1FG       = 0x0008,
  JMBMODE         = 0x0010,
  JMBCLR0OFF      = 0x0040,
  JMBCLR1OFF      = 0x0080
};

__no_init volatile union
{
  unsigned short SYSJMBI0;   /* JTAG mailbox input 0 */
  struct
  {
    unsigned char SYSJMBI0_L;
    unsigned char SYSJMBI0_H;
  };
} @0x0188;

__no_init volatile union
{
  unsigned short SYSJMBI1;   /* JTAG mailbox input 1 */
  struct
  {
    unsigned char SYSJMBI1_L;
    unsigned char SYSJMBI1_H;
  };
} @0x018A;

