snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
/*
enum {
  CCIFG           = 0x0001,
  COV             = 0x0002,
  OUT             = 0x0004,
  CCI             = 0x0008,
  CCIE            = 0x0010,
  OUTMOD0         = 0x0020,
  OUTMOD1         = 0x0040,
  OUTMOD2         = 0x0080,
  CAP             = 0x0100,
  SCCI            = 0x0400,
  SCS             = 0x0800,
  CCIS0           = 0x1000,
  CCIS1           = 0x2000,
  CM0             = 0x4000,
  CM1             = 0x8000,
};

*/

__no_init volatile union
{
  unsigned short TA2CCTL2;   /* Timer2_A3 Capture/Compare Control 2 */

  struct
  {
    unsigned short CCIFG           : 1; /* Capture/compare interrupt flag */
    unsigned short COV             : 1; /* Capture/compare overflow flag */
    unsigned short OUT             : 1; /* PWM Output signal if output mode 0 */
    unsigned short CCI             : 1; /* Capture input signal (read) */
    unsigned short CCIE            : 1; /* Capture/compare interrupt enable */
    unsigned short OUTMOD0         : 1; /* Output mode 0 */
    unsigned short OUTMOD1         : 1; /* Output mode 1 */
    unsigned short OUTMOD2         : 1; /* Output mode 2 */
    unsigned short CAP             : 1; /* Capture mode: 1 /Compare mode : 0 */
    unsigned short                : 1;
    unsigned short SCCI            : 1; /* Latched capture signal (read) */
    unsigned short SCS             : 1; /* Capture sychronize */
    unsigned short CCIS0           : 1; /* Capture input select 0 */
    unsigned short CCIS1           : 1; /* Capture input select 1 */
    unsigned short CM0             : 1; /* Capture mode 0 */
    unsigned short CM1             : 1; /* Capture mode 1 */
  }TA2CCTL2_bit;
} @0x0406;


/*
enum {
  CCIFG           = 0x0001,
  COV             = 0x0002,
  OUT             = 0x0004,
  CCI             = 0x0008,
  CCIE            = 0x0010,
  OUTMOD0         = 0x0020,
  OUTMOD1         = 0x0040,
  OUTMOD2         = 0x0080,
  CAP             = 0x0100,
  SCCI            = 0x0400,
  SCS             = 0x0800,
  CCIS0           = 0x1000,
  CCIS1           = 0x2000,
  CM0             = 0x4000,
  CM1             = 0x8000,
};

*/

  /* Timer2_A3 */
__no_init volatile unsigned short TA2R @ 0x0410;



  /* Timer2_A3 Capture/Compare 0 */
__no_init volatile unsigned short TA2CCR0 @ 0x0412;



  /* Timer2_A3 Capture/Compare 1 */
__no_init volatile unsigned short TA2CCR1 @ 0x0414;



  /* Timer2_A3 Capture/Compare 2 */
__no_init volatile unsigned short TA2CCR2 @ 0x0416;



  /* Timer2_A3 Interrupt Vector Word */
__no_init volatile unsigned short TA2IV @ 0x042E;



__no_init volatile union
{
  unsigned short TA2EX0;   /* Timer2_A3 Expansion Register 0 */

  struct
  {
    unsigned short TAIDEX0         : 1; /* Timer A Input divider expansion Bit: 0 */
    unsigned short TAIDEX1         : 1; /* Timer A Input divider expansion Bit: 1 */
    unsigned short TAIDEX2         : 1; /* Timer A Input divider expansion Bit: 2 */
  }TA2EX0_bit;
} @ 0x0420;


/*
enum {
  TAIDEX0         = 0x0001,
  TAIDEX1         = 0x0002,
  TAIDEX2         = 0x0004
};
*/



#define __MSP430_HAS_T2A3__            /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_T2A3__ 0x0400
#define TIMER_A2_BASE __MSP430_BASEADDRESS_T2A3__
/* TA2IV Definitions */
#define TA2IV_NONE          (0x0000u)    /* No Interrupt pending */
#define TA2IV_TACCR1        (0x0002u)    /* TA2CCR1_CCIFG */
#define TA2IV_TACCR2        (0x0004u)    /* TA2CCR2_CCIFG */
#define TA2IV_3             (0x0006u)    /* Reserved */
#define TA2IV_4             (0x0008u)    /* Reserved */
#define TA2IV_5             (0x000Au)    /* Reserved */
#define TA2IV_6             (0x000Cu)    /* Reserved */
#define TA2IV_TAIFG         (0x000Eu)    /* TA2IFG */
/* Legacy Defines */
#define TA2IV_TA2CCR1      (0x0002u)    /* TA2CCR1_CCIFG */
#define TA2IV_TA2CCR2      (0x0004u)    /* TA2CCR2_CCIFG */
#define TA2IV_TA2IFG       (0x000Eu)    /* TA2IFG */

/*-------------------------------------------------------------------------
 *   Timer0_B7
 *-------------------------------------------------------------------------*/



__no_init volatile union
{
  unsigned short TB0CTL;   /* Timer0_B7 Control */

  struct
  {
    unsigned short TBIFG           : 1; /* Timer0_B7 interrupt flag */
    unsigned short TBIE            : 1; /* Timer0_B7 interrupt enable */
    unsigned short TBCLR           : 1; /* Timer0_B7 counter clear */
    unsigned short                : 1;
    unsigned short MC0             : 1; /* Timer A mode control 0 */
    unsigned short MC1             : 1; /* Timer A mode control 1 */
    unsigned short ID0             : 1; /* Timer A clock input divider 0 */
    unsigned short ID1             : 1; /* Timer A clock input divider 1 */
    unsigned short TBSSEL0         : 1; /* Clock source 0 */
    unsigned short TBSSEL1         : 1; /* Clock source 1 */
    unsigned short                : 1;
    unsigned short CNTL0           : 1; /* Counter lenght 0 */
    unsigned short CNTL1           : 1; /* Counter lenght 1 */
    unsigned short TBCLGRP0        : 1; /* Timer0_B7 Compare latch load group 0 */
    unsigned short TBCLGRP1        : 1; /* Timer0_B7 Compare latch load group 1 */
  }TB0CTL_bit;
} @0x03C0;


enum {
  TBIFG           = 0x0001,
  TBIE            = 0x0002,
  TBCLR           = 0x0004,
/*  MC0             = 0x0010, */
/*  MC1             = 0x0020, */
/*  ID0             = 0x0040, */
/*  ID1             = 0x0080, */
  TBSSEL0         = 0x0100,
  TBSSEL1         = 0x0200,
  CNTL0           = 0x0800,
  CNTL1           = 0x1000,
  TBCLGRP0        = 0x2000,
  TBCLGRP1        = 0x4000
};


__no_init volatile union
{
  unsigned short TB0CCTL0;   /* Timer0_B7 Capture/Compare Control 0 */

  struct
  {
    unsigned short CCIFG           : 1; /* Capture/compare interrupt flag */
    unsigned short COV             : 1; /* Capture/compare overflow flag */
    unsigned short OUT             : 1; /* PWM Output signal if output mode 0 */
    unsigned short CCI             : 1; /* Capture input signal (read) */
    unsigned short CCIE            : 1; /* Capture/compare interrupt enable */
    unsigned short OUTMOD0         : 1; /* Output mode 0 */
    unsigned short OUTMOD1         : 1; /* Output mode 1 */
    unsigned short OUTMOD2         : 1; /* Output mode 2 */
    unsigned short CAP             : 1; /* Capture mode: 1 /Compare mode : 0 */
    unsigned short CLLD0           : 1; /* Compare latch load source 0 */
    unsigned short CLLD1           : 1; /* Compare latch load source 1 */
    unsigned short SCS             : 1; /* Capture sychronize */
    unsigned short CCIS0           : 1; /* Capture input select 0 */
    unsigned short CCIS1           : 1; /* Capture input select 1 */
    unsigned short CM0             : 1; /* Capture mode 0 */
    unsigned short CM1             : 1; /* Capture mode 1 */
  }TB0CCTL0_bit;
} @0x03C2;


enum {
/*  CCIFG           = 0x0001, */
/*  COV             = 0x0002, */
/*  OUT             = 0x0004, */
/*  CCI             = 0x0008, */
/*  CCIE            = 0x0010, */
/*  OUTMOD0         = 0x0020, */
/*  OUTMOD1         = 0x0040, */
/*  OUTMOD2         = 0x0080, */
/*  CAP             = 0x0100, */
  CLLD0           = 0x0200,
  CLLD1           = 0x0400
/*  SCS             = 0x0800, */
/*  CCIS0           = 0x1000, */
/*  CCIS1           = 0x2000, */
/*  CM0             = 0x4000, */
/*  CM1             = 0x8000, */
};


