snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short USBPHYCTL;   /* USB PHY control register */

  struct
  {
    unsigned short PUOUT0          : 1; /* USB - USB Port Output Signal Bit 0 */
    unsigned short PUOUT1          : 1; /* USB - USB Port Output Signal Bit 1 */
    unsigned short PUIN0           : 1; /* USB - PU0/DP Input Data */
    unsigned short PUIN1           : 1; /* USB - PU1/DM Input Data */
    unsigned short                : 1;
    unsigned short PUOPE           : 1; /* USB - USB Port Output Enable */
    unsigned short                : 1;
    unsigned short PUSEL           : 1; /* USB - USB Port Function Select */
    unsigned short PUIPE           : 1; /* USB - PHY Single Ended Input enable */
  } USBPHYCTL_bit;

  struct
  {
    unsigned char USBPHYCTL_L;
    unsigned char USBPHYCTL_H;
  };
} @0x0904;

enum {
  PUOUT0          = 0x0001,
  PUOUT1          = 0x0002,
  PUIN0           = 0x0004,
  PUIN1           = 0x0008,
  PUOPE           = 0x0020,
  PUSEL           = 0x0080,
  PUIPE           = 0x0100
};

__no_init volatile union
{
  unsigned short USBPWRCTL;   /* USB Power control register */

  struct
  {
    unsigned short VUOVLIFG        : 1; /* USB - VUSB Overload Interrupt Flag */
    unsigned short VBONIFG         : 1; /* USB - VBUS "Coming ON" Interrupt Flag */
    unsigned short VBOFFIFG        : 1; /* USB - VBUS "Going OFF" Interrupt Flag */
    unsigned short USBBGVBV        : 1; /* USB - USB Bandgap and VBUS valid */
    unsigned short USBDETEN        : 1; /* USB - VBUS on/off events enable */
    unsigned short OVLAOFF         : 1; /* USB - LDO overload auto off enable */
    unsigned short SLDOAON         : 1; /* USB - Secondary LDO auto on enable */
    unsigned short                : 1;
    unsigned short VUOVLIE         : 1; /* USB - Overload indication Interrupt Enable */
    unsigned short VBONIE          : 1; /* USB - VBUS "Coming ON" Interrupt Enable */
    unsigned short VBOFFIE         : 1; /* USB - VBUS "Going OFF" Interrupt Enable */
    unsigned short VUSBEN          : 1; /* USB - LDO Enable (3.3V) */
    unsigned short SLDOEN          : 1; /* USB - Secondary LDO Enable (1.8V) */
  } USBPWRCTL_bit;

  struct
  {
    unsigned char USBPWRCTL_L;
    unsigned char USBPWRCTL_H;
  };
} @0x0908;

enum {
  VUOVLIFG        = 0x0001,
  VBONIFG         = 0x0002,
  VBOFFIFG        = 0x0004,
  USBBGVBV        = 0x0008,
  USBDETEN        = 0x0010,
  OVLAOFF         = 0x0020,
  SLDOAON         = 0x0040,
  VUOVLIE         = 0x0100,
  VBONIE          = 0x0200,
  VBOFFIE         = 0x0400,
  VUSBEN          = 0x0800,
  SLDOEN          = 0x1000
};

__no_init volatile union
{
  unsigned short USBPLLCTL;   /* USB PLL control register */

  struct
  {
    unsigned short                : 6;
    unsigned short UCLKSEL0        : 1; /* USB - Module Clock Select Bit 0 */
    unsigned short UCLKSEL1        : 1; /* USB - Module Clock Select Bit 1 */
    unsigned short UPLLEN          : 1; /* USB - PLL enable */
    unsigned short UPFDEN          : 1; /* USB - Phase Freq. Discriminator enable */
  } USBPLLCTL_bit;

  struct
  {
    unsigned char USBPLLCTL_L;
    unsigned char USBPLLCTL_H;
  };
} @0x0910;

enum {
  UCLKSEL0        = 0x0040,
  UCLKSEL1        = 0x0080,
  UPLLEN          = 0x0100,
  UPFDEN          = 0x0200
};

__no_init volatile union
{
  unsigned short USBPLLDIVB;   /* USB PLL Clock Divider Buffer control register */

  struct
  {
    unsigned short UPMB0           : 1; /* USB - PLL feedback divider buffer Bit 0 */
    unsigned short UPMB1           : 1; /* USB - PLL feedback divider buffer Bit 1 */
    unsigned short UPMB2           : 1; /* USB - PLL feedback divider buffer Bit 2 */
    unsigned short UPMB3           : 1; /* USB - PLL feedback divider buffer Bit 3 */
    unsigned short UPMB4           : 1; /* USB - PLL feedback divider buffer Bit 4 */
    unsigned short UPMB5           : 1; /* USB - PLL feedback divider buffer Bit 5 */
    unsigned short                : 2;
    unsigned short UPQB0           : 1; /* USB - PLL prescale divider buffer Bit 0 */
    unsigned short UPQB1           : 1; /* USB - PLL prescale divider buffer Bit 1 */
    unsigned short UPQB2           : 1; /* USB - PLL prescale divider buffer Bit 2 */
  } USBPLLDIVB_bit;

  struct
  {
    unsigned char USBPLLDIVB_L;
    unsigned char USBPLLDIVB_H;
  };
} @0x0912;

enum {
  UPMB0           = 0x0001,
  UPMB1           = 0x0002,
  UPMB2           = 0x0004,
  UPMB3           = 0x0008,
  UPMB4           = 0x0010,
  UPMB5           = 0x0020,
  UPQB0           = 0x0100,
  UPQB1           = 0x0200,
  UPQB2           = 0x0400
};

__no_init volatile union
{
  unsigned short USBPLLIR;   /* USB PLL Interrupt control register */

  struct
  {
    unsigned short USBOOLIFG       : 1; /* USB - PLL out of lock Interrupt Flag */
    unsigned short USBLOSIFG       : 1; /* USB - PLL loss of signal Interrupt Flag */
    unsigned short USBOORIFG       : 1; /* USB - PLL out of range Interrupt Flag */
    unsigned short                : 5;
    unsigned short USBOOLIE        : 1; /* USB - PLL out of lock Interrupt enable */
    unsigned short USBLOSIE        : 1; /* USB - PLL loss of signal Interrupt enable */
    unsigned short USBOORIE        : 1; /* USB - PLL out of range Interrupt enable */
  } USBPLLIR_bit;

  struct
  {
    unsigned char USBPLLIR_L;
    unsigned char USBPLLIR_H;
  };
} @0x0914;

enum {
  USBOOLIFG       = 0x0001,
  USBLOSIFG       = 0x0002,
  USBOORIFG       = 0x0004,
  USBOOLIE        = 0x0100,
  USBLOSIE        = 0x0200,
  USBOORIE        = 0x0400
};


__no_init volatile union
{
  unsigned char USBIEPCNF_0;   /* USB Input endpoint_0: Configuration */

  struct
  {
    unsigned char                : 2;
    unsigned char USBIIE          : 1; /* USB - Transaction Interrupt indication enable */
    unsigned char STALL           : 1; /* USB - Stall Condition */
    unsigned char                : 1;
    unsigned char TOGGLE          : 1; /* USB - Toggle Bit */
    unsigned char                : 1;
    unsigned char UBME            : 1; /* USB - UBM In-Endpoint Enable */
  }USBIEPCNF_0_bit;
} @0x0920;


enum {
  USBIIE          = 0x0004,
  STALL           = 0x0008,
  TOGGLE          = 0x0020,
  UBME            = 0x0080
};


  /* USB Input endpoint_0: Byte Count */
__no_init volatile unsigned char USBIEPCNT_0 @ 0x0921;



