snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned char USBOEPCNF_0;   /* USB Output endpoint_0: Configuration */

  struct
  {
    unsigned char                : 2;
    unsigned char USBIIE          : 1; /* USB - Transaction Interrupt indication enable */
    unsigned char STALL           : 1; /* USB - Stall Condition */
    unsigned char                : 1;
    unsigned char TOGGLE          : 1; /* USB - Toggle Bit */
    unsigned char                : 1;
    unsigned char UBME            : 1; /* USB - UBM In-Endpoint Enable */
  }USBOEPCNF_0_bit;
} @0x0922;


/*
enum {
  USBIIE          = 0x0004,
  STALL           = 0x0008,
  TOGGLE          = 0x0020,
  UBME            = 0x0080,
};

*/

  /* USB Output endpoint_0: byte count */
__no_init volatile unsigned char USBOEPCNT_0 @ 0x0923;



  /* USB Input endpoint interrupt enable flags */
__no_init volatile unsigned char USBIEPIE @ 0x092E;



  /* USB Output endpoint interrupt enable flags */
__no_init volatile unsigned char USBOEPIE @ 0x092F;



  /* USB Input endpoint interrupt flags */
__no_init volatile unsigned char USBIEPIFG @ 0x0930;



  /* USB Output endpoint interrupt flags */
__no_init volatile unsigned char USBOEPIFG @ 0x0931;


__no_init volatile union
{
  unsigned short USBVECINT;   /* USB Vector interrupt register */
  struct
  {
    unsigned char USBVECINT_L;
    unsigned char USBVECINT_H;
  };
} @0x0932;

__no_init volatile union
{
  unsigned short USBMAINT;   /* USB maintenance register */

  struct
  {
    unsigned short UTIFG           : 1; /* USB - Timer Interrupt Flag */
    unsigned short UTIE            : 1; /* USB - Timer Interrupt Enable */
    unsigned short                : 6;
    unsigned short TSGEN           : 1; /* USB - Time Stamp Generator Enable */
    unsigned short TSESEL0         : 1; /* USB - Time Stamp Event Select Bit 0 */
    unsigned short TSESEL1         : 1; /* USB - Time Stamp Event Select Bit 1 */
    unsigned short TSE3            : 1; /* USB - Time Stamp Event #3 Bit */
    unsigned short                : 1;
    unsigned short UTSEL0          : 1; /* USB - Timer Select Bit 0 */
    unsigned short UTSEL1          : 1; /* USB - Timer Select Bit 1 */
    unsigned short UTSEL2          : 1; /* USB - Timer Select Bit 2 */
  } USBMAINT_bit;

  struct
  {
    unsigned char USBMAINT_L;
    unsigned char USBMAINT_H;
  };
} @0x0936;

enum {
  UTIFG           = 0x0001,
  UTIE            = 0x0002,
  TSGEN           = 0x0100,
  TSESEL0         = 0x0200,
  TSESEL1         = 0x0400,
  TSE3            = 0x0800,
  UTSEL0          = 0x2000,
  UTSEL1          = 0x4000,
  UTSEL2          = 0x8000
};

__no_init volatile union
{
  unsigned short USBTSREG;   /* USB Time Stamp register */
  struct
  {
    unsigned char USBTSREG_L;
    unsigned char USBTSREG_H;
  };
} @0x0938;

__no_init volatile union
{
  unsigned short USBFN;   /* USB Frame number */
  struct
  {
    unsigned char USBFN_L;
    unsigned char USBFN_H;
  };
} @0x093A;


__no_init volatile union
{
  unsigned char USBCTL;   /* USB control register */

  struct
  {
    unsigned char DIR             : 1; /* USB - Data Response Bit */
    unsigned char                : 3;
    unsigned char FRSTE           : 1; /* USB - Function Reset Connection Enable */
    unsigned char RWUP            : 1; /* USB - Device Remote Wakeup Request */
    unsigned char FEN             : 1; /* USB - Function Enable Bit */
  }USBCTL_bit;
} @0x093C;


enum {
  DIR             = 0x0001,
  FRSTE           = 0x0010,
  RWUP            = 0x0020,
  FEN             = 0x0040
};


__no_init volatile union
{
  unsigned char USBIE;   /* USB interrupt enable register */

  struct
  {
    unsigned char STPOWIE         : 1; /* USB - Setup Overwrite Interrupt Enable */
    unsigned char                : 1;
    unsigned char SETUPIE         : 1; /* USB - Setup Interrupt Enable */
    unsigned char                : 2;
    unsigned char RESRIE          : 1; /* USB - Function Resume Request Interrupt Enable */
    unsigned char SUSRIE          : 1; /* USB - Function Suspend Request Interrupt Enable */
    unsigned char RSTRIE          : 1; /* USB - Function Reset Request Interrupt Enable */
  }USBIE_bit;
} @0x093D;


enum {
  STPOWIE         = 0x0001,
  SETUPIE         = 0x0004,
  RESRIE          = 0x0020,
  SUSRIE          = 0x0040,
  RSTRIE          = 0x0080
};


__no_init volatile union
{
  unsigned char USBIFG;   /* USB interrupt flag register */

  struct
  {
    unsigned char STPOWIFG        : 1; /* USB - Setup Overwrite Interrupt Flag */
    unsigned char                : 1;
    unsigned char SETUPIFG        : 1; /* USB - Setup Interrupt Flag */
    unsigned char                : 2;
    unsigned char RESRIFG         : 1; /* USB - Function Resume Request Interrupt Flag */
    unsigned char SUSRIFG         : 1; /* USB - Function Suspend Request Interrupt Flag */
    unsigned char RSTRIFG         : 1; /* USB - Function Reset Request Interrupt Flag */
  }USBIFG_bit;
} @0x093E;


enum {
  STPOWIFG        = 0x0001,
  SETUPIFG        = 0x0004,
  RESRIFG         = 0x0020,
  SUSRIFG         = 0x0040,
  RSTRIFG         = 0x0080
};


  /* USB Function address register */
__no_init volatile unsigned char USBFUNADR @ 0x093F;


#define __MSP430_HAS_USB__            /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USB__ 0x0900
#define USB_BASE __MSP430_BASEADDRESS_USB__

#define USBKEYPID      USBKEYID    /* Legacy Definition: USB Controller key register */
#define USBKEY         (0x9628u)    /* USB Control Register key */
/* USBCNF Control Bits */
#define USB_EN_L            (0x0001u)  /* USB - Module enable */
#define PUR_EN_L            (0x0002u)  /* USB - PUR pin enable */
#define PUR_IN_L            (0x0004u)  /* USB - PUR pin input value */
#define BLKRDY_L            (0x0008u)  /* USB - Block ready signal for DMA */
#define FNTEN_L             (0x0010u)  /* USB - Frame Number receive Trigger enable for DMA */
/* USBPHYCTL Control Bits */
#define PUOUT0_L            (0x0001u)  /* USB - USB Port Output Signal Bit 0 */
#define PUOUT1_L            (0x0002u)  /* USB - USB Port Output Signal Bit 1 */
#define PUIN0_L             (0x0004u)  /* USB - PU0/DP Input Data */
#define PUIN1_L             (0x0008u)  /* USB - PU1/DM Input Data */
#define PUOPE_L             (0x0020u)  /* USB - USB Port Output Enable */
#define PUSEL_L             (0x0080u)  /* USB - USB Port Function Select */
#define PUIPE_H             (0x0001u)  /* USB - PHY Single Ended Input enable */

#define PUDIR               (0x0020u)  /* USB - Legacy Definition: USB Port Output Enable */
#define PSEIEN              (0x0100u)  /* USB - Legacy Definition: PHY Single Ended Input enable */
/* USBPWRCTL Control Bits */
#define VUOVLIFG_L          (0x0001u)  /* USB - VUSB Overload Interrupt Flag */
#define VBONIFG_L           (0x0002u)  /* USB - VBUS "Coming ON" Interrupt Flag */
#define VBOFFIFG_L          (0x0004u)  /* USB - VBUS "Going OFF" Interrupt Flag */
#define USBBGVBV_L          (0x0008u)  /* USB - USB Bandgap and VBUS valid */
#define USBDETEN_L          (0x0010u)  /* USB - VBUS on/off events enable */
#define OVLAOFF_L           (0x0020u)  /* USB - LDO overload auto off enable */
#define SLDOAON_L           (0x0040u)  /* USB - Secondary LDO auto on enable */
#define VUOVLIE_H           (0x0001u)  /* USB - Overload indication Interrupt Enable */
#define VBONIE_H            (0x0002u)  /* USB - VBUS "Coming ON" Interrupt Enable */
#define VBOFFIE_H           (0x0004u)  /* USB - VBUS "Going OFF" Interrupt Enable */
#define VUSBEN_H            (0x0008u)  /* USB - LDO Enable (3.3V) */
#define SLDOEN_H            (0x0010u)  /* USB - Secondary LDO Enable (1.8V) */
#define UCLKSEL0_L          (0x0040u)  /* USB - Module Clock Select Bit 0 */
#define UCLKSEL1_L          (0x0080u)  /* USB - Module Clock Select Bit 1 */
#define UPLLEN_H            (0x0001u)  /* USB - PLL enable */
#define UPFDEN_H            (0x0002u)  /* USB - Phase Freq. Discriminator enable */

