snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
#define UCLKSEL_0           (0x0000u)  /* USB - Module Clock Select: 0 */
#define UCLKSEL_1           (0x0040u)  /* USB - Module Clock Select: 1 */
#define UCLKSEL_2           (0x0080u)  /* USB - Module Clock Select: 2 */
#define UCLKSEL_3           (0x00C0u)  /* USB - Module Clock Select: 3 (Reserved) */

#define UCLKSEL__PLLCLK     (0x0000u)  /* USB - Module Clock Select: PLLCLK */
#define UCLKSEL__XT1CLK     (0x0040u)  /* USB - Module Clock Select: XT1CLK */
#define UCLKSEL__XT2CLK     (0x0080u)  /* USB - Module Clock Select: XT2CLK */
/* USBPLLDIVB Control Bits */
#define UPMB0_L             (0x0001u)  /* USB - PLL feedback divider buffer Bit 0 */
#define UPMB1_L             (0x0002u)  /* USB - PLL feedback divider buffer Bit 1 */
#define UPMB2_L             (0x0004u)  /* USB - PLL feedback divider buffer Bit 2 */
#define UPMB3_L             (0x0008u)  /* USB - PLL feedback divider buffer Bit 3 */
#define UPMB4_L             (0x0010u)  /* USB - PLL feedback divider buffer Bit 4 */
#define UPMB5_L             (0x0020u)  /* USB - PLL feedback divider buffer Bit 5 */
#define UPQB0_H             (0x0001u)  /* USB - PLL prescale divider buffer Bit 0 */
#define UPQB1_H             (0x0002u)  /* USB - PLL prescale divider buffer Bit 1 */
#define UPQB2_H             (0x0004u)  /* USB - PLL prescale divider buffer Bit 2 */

#define USBPLL_SETCLK_1_5      (UPMB0*31 | UPQB0*0)  /* USB - PLL Set for 1.5 MHz input clock */
#define USBPLL_SETCLK_1_6      (UPMB0*29 | UPQB0*0)  /* USB - PLL Set for 1.6 MHz input clock */
#define USBPLL_SETCLK_1_7778   (UPMB0*26 | UPQB0*0)  /* USB - PLL Set for 1.7778 MHz input clock */
#define USBPLL_SETCLK_1_8432   (UPMB0*25 | UPQB0*0)  /* USB - PLL Set for 1.8432 MHz input clock */
#define USBPLL_SETCLK_1_8461   (UPMB0*25 | UPQB0*0)  /* USB - PLL Set for 1.8461 MHz input clock */
#define USBPLL_SETCLK_1_92     (UPMB0*24 | UPQB0*0)  /* USB - PLL Set for 1.92 MHz input clock */
#define USBPLL_SETCLK_2_0      (UPMB0*23 | UPQB0*0)  /* USB - PLL Set for 2.0 MHz input clock */
#define USBPLL_SETCLK_2_4      (UPMB0*19 | UPQB0*0)  /* USB - PLL Set for 2.4 MHz input clock */
#define USBPLL_SETCLK_2_6667   (UPMB0*17 | UPQB0*0)  /* USB - PLL Set for 2.6667 MHz input clock */
#define USBPLL_SETCLK_3_0      (UPMB0*15 | UPQB0*0)  /* USB - PLL Set for 3.0 MHz input clock */
#define USBPLL_SETCLK_3_2      (UPMB0*29 | UPQB0*1)  /* USB - PLL Set for 3.2 MHz input clock */
#define USBPLL_SETCLK_3_5556   (UPMB0*26 | UPQB0*1)  /* USB - PLL Set for 3.5556 MHz input clock */
#define USBPLL_SETCLK_3_579545 (UPMB0*26 | UPQB0*1)  /* USB - PLL Set for 3.579546 MHz input clock */
#define USBPLL_SETCLK_3_84     (UPMB0*24 | UPQB0*1)  /* USB - PLL Set for 3.84 MHz input clock */
#define USBPLL_SETCLK_4_0      (UPMB0*23 | UPQB0*1)  /* USB - PLL Set for 4.0 MHz input clock */
#define USBPLL_SETCLK_4_1739   (UPMB0*22 | UPQB0*1)  /* USB - PLL Set for 4.1739 MHz input clock */
#define USBPLL_SETCLK_4_1943   (UPMB0*22 | UPQB0*1)  /* USB - PLL Set for 4.1943 MHz input clock */
#define USBPLL_SETCLK_4_332    (UPMB0*21 | UPQB0*1)  /* USB - PLL Set for 4.332 MHz input clock */
#define USBPLL_SETCLK_4_3636   (UPMB0*21 | UPQB0*1)  /* USB - PLL Set for 4.3636 MHz input clock */
#define USBPLL_SETCLK_4_5      (UPMB0*31 | UPQB0*2)  /* USB - PLL Set for 4.5 MHz input clock */
#define USBPLL_SETCLK_4_8      (UPMB0*19 | UPQB0*1)  /* USB - PLL Set for 4.8 MHz input clock */
#define USBPLL_SETCLK_5_33     (UPMB0*17 | UPQB0*1)  /* USB - PLL Set for 5.33 MHz input clock */
#define USBPLL_SETCLK_5_76     (UPMB0*24 | UPQB0*2)  /* USB - PLL Set for 5.76 MHz input clock */
#define USBPLL_SETCLK_6_0      (UPMB0*23 | UPQB0*2)  /* USB - PLL Set for 6.0 MHz input clock */
#define USBPLL_SETCLK_6_4      (UPMB0*29 | UPQB0*3)  /* USB - PLL Set for 6.4 MHz input clock */
#define USBPLL_SETCLK_7_2      (UPMB0*19 | UPQB0*2)  /* USB - PLL Set for 7.2 MHz input clock */
#define USBPLL_SETCLK_7_68     (UPMB0*24 | UPQB0*3)  /* USB - PLL Set for 7.68 MHz input clock */
#define USBPLL_SETCLK_8_0      (UPMB0*17 | UPQB0*2)  /* USB - PLL Set for 8.0 MHz input clock */
#define USBPLL_SETCLK_9_0      (UPMB0*15 | UPQB0*2)  /* USB - PLL Set for 9.0 MHz input clock */
#define USBPLL_SETCLK_9_6      (UPMB0*19 | UPQB0*3)  /* USB - PLL Set for 9.6 MHz input clock */
#define USBPLL_SETCLK_10_66    (UPMB0*17 | UPQB0*3)  /* USB - PLL Set for 10.66 MHz input clock */
#define USBPLL_SETCLK_12_0     (UPMB0*15 | UPQB0*3)  /* USB - PLL Set for 12.0 MHz input clock */
#define USBPLL_SETCLK_12_8     (UPMB0*29 | UPQB0*5)  /* USB - PLL Set for 12.8 MHz input clock */
#define USBPLL_SETCLK_14_4     (UPMB0*19 | UPQB0*4)  /* USB - PLL Set for 14.4 MHz input clock */
#define USBPLL_SETCLK_16_0     (UPMB0*17 | UPQB0*4)  /* USB - PLL Set for 16.0 MHz input clock */
#define USBPLL_SETCLK_16_9344  (UPMB0*16 | UPQB0*4)  /* USB - PLL Set for 16.9344 MHz input clock */
#define USBPLL_SETCLK_16_94118 (UPMB0*16 | UPQB0*4)  /* USB - PLL Set for 16.94118 MHz input clock */
#define USBPLL_SETCLK_18_0     (UPMB0*15 | UPQB0*4)  /* USB - PLL Set for 18.0 MHz input clock */
#define USBPLL_SETCLK_19_2     (UPMB0*19 | UPQB0*5)  /* USB - PLL Set for 19.2 MHz input clock */
#define USBPLL_SETCLK_24_0     (UPMB0*15 | UPQB0*5)  /* USB - PLL Set for 24.0 MHz input clock */
#define USBPLL_SETCLK_25_6     (UPMB0*29 | UPQB0*7)  /* USB - PLL Set for 25.6 MHz input clock */
#define USBPLL_SETCLK_26_0     (UPMB0*23 | UPQB0*6)  /* USB - PLL Set for 26.0 MHz input clock */
#define USBPLL_SETCLK_32_0     (UPMB0*23 | UPQB0*7)  /* USB - PLL Set for 32.0 MHz input clock */
/* USBPLLIR Control Bits */
#define USBOOLIFG_L         (0x0001u)  /* USB - PLL out of lock Interrupt Flag */
#define USBLOSIFG_L         (0x0002u)  /* USB - PLL loss of signal Interrupt Flag */
#define USBOORIFG_L         (0x0004u)  /* USB - PLL out of range Interrupt Flag */
#define USBOOLIE_H          (0x0001u)  /* USB - PLL out of lock Interrupt enable */
#define USBLOSIE_H          (0x0002u)  /* USB - PLL loss of signal Interrupt enable */
#define USBOORIE_H          (0x0004u)  /* USB - PLL out of range Interrupt enable */

#define USBIV          USBVECINT   /* USB Vector interrupt register (alternate define) */
/* USBOEPBCNT_0 Control Bits */
#define CNT0           (0x0001u)  /* USB - Byte Count Bit 0 */
#define CNT1           (0x0001u)  /* USB - Byte Count Bit 1 */
#define CNT2           (0x0004u)  /* USB - Byte Count Bit 2 */
#define CNT3           (0x0008u)  /* USB - Byte Count Bit 3 */
#define NAK            (0x0080u)  /* USB - No Acknowledge Status Bit */
/* USBMAINT Control Bits */
#define UTIFG_L             (0x0001u)  /* USB - Timer Interrupt Flag */
#define UTIE_L              (0x0002u)  /* USB - Timer Interrupt Enable */
#define TSGEN_H             (0x0001u)  /* USB - Time Stamp Generator Enable */
#define TSESEL0_H           (0x0002u)  /* USB - Time Stamp Event Select Bit 0 */
#define TSESEL1_H           (0x0004u)  /* USB - Time Stamp Event Select Bit 1 */
#define TSE3_H              (0x0008u)  /* USB - Time Stamp Event #3 Bit */
#define UTSEL0_H            (0x0020u)  /* USB - Timer Select Bit 0 */
#define UTSEL1_H            (0x0040u)  /* USB - Timer Select Bit 1 */
#define UTSEL2_H            (0x0080u)  /* USB - Timer Select Bit 2 */

