snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
#define TSESEL_0       (0x0000u)  /* USB - Time Stamp Event Select: 0 */
#define TSESEL_1       (0x0200u)  /* USB - Time Stamp Event Select: 1 */
#define TSESEL_2       (0x0400u)  /* USB - Time Stamp Event Select: 2 */
#define TSESEL_3       (0x0600u)  /* USB - Time Stamp Event Select: 3 */

#define UTSEL_0        (0x0000u)  /* USB - Timer Select: 0 */
#define UTSEL_1        (0x2000u)  /* USB - Timer Select: 1 */
#define UTSEL_2        (0x4000u)  /* USB - Timer Select: 2 */
#define UTSEL_3        (0x6000u)  /* USB - Timer Select: 3 */
#define UTSEL_4        (0x8000u)  /* USB - Timer Select: 4 */
#define UTSEL_5        (0xA000u)  /* USB - Timer Select: 5 */
#define UTSEL_6        (0xC000u)  /* USB - Timer Select: 6 */
#define UTSEL_7        (0xE000u)  /* USB - Timer Select: 7 */
#define     USBVECINT_NONE                     0x00
#define     USBVECINT_PWR_DROP                 0x02
#define     USBVECINT_PLL_LOCK                 0x04
#define     USBVECINT_PLL_SIGNAL               0x06
#define     USBVECINT_PLL_RANGE                0x08
#define     USBVECINT_PWR_VBUSOn               0x0A
#define     USBVECINT_PWR_VBUSOff              0x0C
#define     USBVECINT_USB_TIMESTAMP            0x10
#define     USBVECINT_INPUT_ENDPOINT0          0x12
#define     USBVECINT_OUTPUT_ENDPOINT0         0x14
#define     USBVECINT_RSTR                     0x16
#define     USBVECINT_SUSR                     0x18
#define     USBVECINT_RESR                     0x1A
#define     USBVECINT_SETUP_PACKET_RECEIVED    0x20
#define     USBVECINT_STPOW_PACKET_RECEIVED    0x22
#define     USBVECINT_INPUT_ENDPOINT1          0x24
#define     USBVECINT_INPUT_ENDPOINT2          0x26
#define     USBVECINT_INPUT_ENDPOINT3          0x28
#define     USBVECINT_INPUT_ENDPOINT4          0x2A
#define     USBVECINT_INPUT_ENDPOINT5          0x2C
#define     USBVECINT_INPUT_ENDPOINT6          0x2E
#define     USBVECINT_INPUT_ENDPOINT7          0x30
#define     USBVECINT_OUTPUT_ENDPOINT1         0x32
#define     USBVECINT_OUTPUT_ENDPOINT2         0x34
#define     USBVECINT_OUTPUT_ENDPOINT3         0x36
#define     USBVECINT_OUTPUT_ENDPOINT4         0x38
#define     USBVECINT_OUTPUT_ENDPOINT5         0x3A
#define     USBVECINT_OUTPUT_ENDPOINT6         0x3C
#define     USBVECINT_OUTPUT_ENDPOINT7         0x3E
/* USBOEPBCNT_n Control Bits */
#define CNT4           (0x0010u)  /* USB - Byte Count Bit 3 */
#define CNT5           (0x0020u)  /* USB - Byte Count Bit 3 */
#define CNT6           (0x0040u)  /* USB - Byte Count Bit 3 */

/*-------------------------------------------------------------------------
 *   USB Operation
 *-------------------------------------------------------------------------*/



  /* Input Endpoint_7: X/Y-buffer size */
__no_init volatile unsigned char USBIEPSIZXY_7 @ 0x23FF;



  /* Input Endpoint_7: Y-byte count */
__no_init volatile unsigned char USBIEPBCTY_7 @ 0x23FE;



  /* Input Endpoint_7: Y-buffer base addr. */
__no_init volatile unsigned char USBIEPBBAY_7 @ 0x23FD;



  /* Input Endpoint_7: X-byte count */
__no_init volatile unsigned char USBIEPBCTX_7 @ 0x23FA;



  /* Input Endpoint_7: X-buffer base addr. */
__no_init volatile unsigned char USBIEPBBAX_7 @ 0x23F9;



__no_init volatile union
{
  unsigned char USBIEPCNF_7;   /* Input Endpoint_7: Configuration */

  struct
  {
    unsigned char                : 2;
    unsigned char USBIIE          : 1; /* USB - Transaction Interrupt indication enable */
    unsigned char STALL           : 1; /* USB - Stall Condition */
    unsigned char DBUF            : 1; /* USB - Double Buffer Enable */
    unsigned char TOGGLE          : 1; /* USB - Toggle Bit */
    unsigned char                : 1;
    unsigned char UBME            : 1; /* USB - UBM In-Endpoint Enable */
  }USBIEPCNF_7_bit;
} @0x23F8;


enum {
/*  USBIIE          = 0x0004, */
/*  STALL           = 0x0008, */
  DBUF            = 0x0010
/*  TOGGLE          = 0x0020, */
/*  UBME            = 0x0080, */
};


  /* Input Endpoint_6: X/Y-buffer size */
__no_init volatile unsigned char USBIEPSIZXY_6 @ 0x23F7;



  /* Input Endpoint_6: Y-byte count */
__no_init volatile unsigned char USBIEPBCTY_6 @ 0x23F6;



  /* Input Endpoint_6: Y-buffer base addr. */
__no_init volatile unsigned char USBIEPBBAY_6 @ 0x23F5;



  /* Input Endpoint_6: X-byte count */
__no_init volatile unsigned char USBIEPBCTX_6 @ 0x23F2;



  /* Input Endpoint_6: X-buffer base addr. */
__no_init volatile unsigned char USBIEPBBAX_6 @ 0x23F1;



__no_init volatile union
{
  unsigned char USBIEPCNF_6;   /* Input Endpoint_6: Configuration */

  struct
  {
    unsigned char                : 2;
    unsigned char USBIIE          : 1; /* USB - Transaction Interrupt indication enable */
    unsigned char STALL           : 1; /* USB - Stall Condition */
    unsigned char DBUF            : 1; /* USB - Double Buffer Enable */
    unsigned char TOGGLE          : 1; /* USB - Toggle Bit */
    unsigned char                : 1;
    unsigned char UBME            : 1; /* USB - UBM In-Endpoint Enable */
  }USBIEPCNF_6_bit;
} @0x23F0;


/*
enum {
  USBIIE          = 0x0004,
  STALL           = 0x0008,
  DBUF            = 0x0010,
  TOGGLE          = 0x0020,
  UBME            = 0x0080,
};

*/

  /* Input Endpoint_5: X/Y-buffer size */
__no_init volatile unsigned char USBIEPSIZXY_5 @ 0x23EF;



  /* Input Endpoint_5: Y-byte count */
__no_init volatile unsigned char USBIEPBCTY_5 @ 0x23EE;



  /* Input Endpoint_5: Y-buffer base addr. */
__no_init volatile unsigned char USBIEPBBAY_5 @ 0x23ED;



  /* Input Endpoint_5: X-byte count */
__no_init volatile unsigned char USBIEPBCTX_5 @ 0x23EA;



  /* Input Endpoint_5: X-buffer base addr. */
__no_init volatile unsigned char USBIEPBBAX_5 @ 0x23E9;



__no_init volatile union
{
  unsigned char USBIEPCNF_5;   /* Input Endpoint_5: Configuration */

  struct
  {
    unsigned char                : 2;
    unsigned char USBIIE          : 1; /* USB - Transaction Interrupt indication enable */
    unsigned char STALL           : 1; /* USB - Stall Condition */
    unsigned char DBUF            : 1; /* USB - Double Buffer Enable */
    unsigned char TOGGLE          : 1; /* USB - Toggle Bit */
    unsigned char                : 1;
    unsigned char UBME            : 1; /* USB - UBM In-Endpoint Enable */
  }USBIEPCNF_5_bit;
} @0x23E8;


