snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
/*
enum {
  USBIIE          = 0x0004,
  STALL           = 0x0008,
  DBUF            = 0x0010,
  TOGGLE          = 0x0020,
  UBME            = 0x0080,
};

*/

  /* Input Endpoint_4: X/Y-buffer size */
__no_init volatile unsigned char USBIEPSIZXY_4 @ 0x23E7;



  /* Input Endpoint_4: Y-byte count */
__no_init volatile unsigned char USBIEPBCTY_4 @ 0x23E6;



  /* Input Endpoint_4: Y-buffer base addr. */
__no_init volatile unsigned char USBIEPBBAY_4 @ 0x23E5;



  /* Input Endpoint_4: X-byte count */
__no_init volatile unsigned char USBIEPBCTX_4 @ 0x23E2;



  /* Input Endpoint_4: X-buffer base addr. */
__no_init volatile unsigned char USBIEPBBAX_4 @ 0x23E1;



__no_init volatile union
{
  unsigned char USBIEPCNF_4;   /* Input Endpoint_4: Configuration */

  struct
  {
    unsigned char                : 2;
    unsigned char USBIIE          : 1; /* USB - Transaction Interrupt indication enable */
    unsigned char STALL           : 1; /* USB - Stall Condition */
    unsigned char DBUF            : 1; /* USB - Double Buffer Enable */
    unsigned char TOGGLE          : 1; /* USB - Toggle Bit */
    unsigned char                : 1;
    unsigned char UBME            : 1; /* USB - UBM In-Endpoint Enable */
  }USBIEPCNF_4_bit;
} @0x23E0;


/*
enum {
  USBIIE          = 0x0004,
  STALL           = 0x0008,
  DBUF            = 0x0010,
  TOGGLE          = 0x0020,
  UBME            = 0x0080,
};

*/

  /* Input Endpoint_3: X/Y-buffer size */
__no_init volatile unsigned char USBIEPSIZXY_3 @ 0x23DF;



  /* Input Endpoint_3: Y-byte count */
__no_init volatile unsigned char USBIEPBCTY_3 @ 0x23DE;



  /* Input Endpoint_3: Y-buffer base addr. */
__no_init volatile unsigned char USBIEPBBAY_3 @ 0x23DD;



  /* Input Endpoint_3: X-byte count */
__no_init volatile unsigned char USBIEPBCTX_3 @ 0x23DA;



  /* Input Endpoint_3: X-buffer base addr. */
__no_init volatile unsigned char USBIEPBBAX_3 @ 0x23D9;



__no_init volatile union
{
  unsigned char USBIEPCNF_3;   /* Input Endpoint_3: Configuration */

  struct
  {
    unsigned char                : 2;
    unsigned char USBIIE          : 1; /* USB - Transaction Interrupt indication enable */
    unsigned char STALL           : 1; /* USB - Stall Condition */
    unsigned char DBUF            : 1; /* USB - Double Buffer Enable */
    unsigned char TOGGLE          : 1; /* USB - Toggle Bit */
    unsigned char                : 1;
    unsigned char UBME            : 1; /* USB - UBM In-Endpoint Enable */
  }USBIEPCNF_3_bit;
} @0x23D8;


/*
enum {
  USBIIE          = 0x0004,
  STALL           = 0x0008,
  DBUF            = 0x0010,
  TOGGLE          = 0x0020,
  UBME            = 0x0080,
};

*/

  /* Input Endpoint_2: X/Y-buffer size */
__no_init volatile unsigned char USBIEPSIZXY_2 @ 0x23D7;



  /* Input Endpoint_2: Y-byte count */
__no_init volatile unsigned char USBIEPBCTY_2 @ 0x23D6;



  /* Input Endpoint_2: Y-buffer base addr. */
__no_init volatile unsigned char USBIEPBBAY_2 @ 0x23D5;



  /* Input Endpoint_2: X-byte count */
__no_init volatile unsigned char USBIEPBCTX_2 @ 0x23D2;



  /* Input Endpoint_2: X-buffer base addr. */
__no_init volatile unsigned char USBIEPBBAX_2 @ 0x23D1;



__no_init volatile union
{
  unsigned char USBIEPCNF_2;   /* Input Endpoint_2: Configuration */

  struct
  {
    unsigned char                : 2;
    unsigned char USBIIE          : 1; /* USB - Transaction Interrupt indication enable */
    unsigned char STALL           : 1; /* USB - Stall Condition */
    unsigned char DBUF            : 1; /* USB - Double Buffer Enable */
    unsigned char TOGGLE          : 1; /* USB - Toggle Bit */
    unsigned char                : 1;
    unsigned char UBME            : 1; /* USB - UBM In-Endpoint Enable */
  }USBIEPCNF_2_bit;
} @0x23D0;


/*
enum {
  USBIIE          = 0x0004,
  STALL           = 0x0008,
  DBUF            = 0x0010,
  TOGGLE          = 0x0020,
  UBME            = 0x0080,
};

*/

  /* Input Endpoint_1: X/Y-buffer size */
__no_init volatile unsigned char USBIEPSIZXY_1 @ 0x23CF;



  /* Input Endpoint_1: Y-byte count */
__no_init volatile unsigned char USBIEPBCTY_1 @ 0x23CE;



  /* Input Endpoint_1: Y-buffer base addr. */
__no_init volatile unsigned char USBIEPBBAY_1 @ 0x23CD;



  /* Input Endpoint_1: X-byte count */
__no_init volatile unsigned char USBIEPBCTX_1 @ 0x23CA;



  /* Input Endpoint_1: X-buffer base addr. */
__no_init volatile unsigned char USBIEPBBAX_1 @ 0x23C9;



__no_init volatile union
{
  unsigned char USBIEPCNF_1;   /* Input Endpoint_1: Configuration */

  struct
  {
    unsigned char                : 2;
    unsigned char USBIIE          : 1; /* USB - Transaction Interrupt indication enable */
    unsigned char STALL           : 1; /* USB - Stall Condition */
    unsigned char DBUF            : 1; /* USB - Double Buffer Enable */
    unsigned char TOGGLE          : 1; /* USB - Toggle Bit */
    unsigned char                : 1;
    unsigned char UBME            : 1; /* USB - UBM In-Endpoint Enable */
  }USBIEPCNF_1_bit;
} @0x23C8;


/*
enum {
  USBIIE          = 0x0004,
  STALL           = 0x0008,
  DBUF            = 0x0010,
  TOGGLE          = 0x0020,
  UBME            = 0x0080,
};

*/

  /* Output Endpoint_7: X/Y-buffer size */
__no_init volatile unsigned char USBOEPSIZXY_7 @ 0x23BF;



  /* Output Endpoint_7: Y-byte count */
__no_init volatile unsigned char USBOEPBCTY_7 @ 0x23BE;



  /* Output Endpoint_7: Y-buffer base addr. */
__no_init volatile unsigned char USBOEPBBAY_7 @ 0x23BD;



  /* Output Endpoint_7: X-byte count */
__no_init volatile unsigned char USBOEPBCTX_7 @ 0x23BA;



  /* Output Endpoint_7: X-buffer base addr. */
__no_init volatile unsigned char USBOEPBBAX_7 @ 0x23B9;



__no_init volatile union
{
  unsigned char USBOEPCNF_7;   /* Output Endpoint_7: Configuration */

  struct
  {
    unsigned char                : 2;
    unsigned char USBIIE          : 1; /* USB - Transaction Interrupt indication enable */
    unsigned char STALL           : 1; /* USB - Stall Condition */
    unsigned char DBUF            : 1; /* USB - Double Buffer Enable */
    unsigned char TOGGLE          : 1; /* USB - Toggle Bit */
    unsigned char                : 1;
    unsigned char UBME            : 1; /* USB - UBM In-Endpoint Enable */
  }USBOEPCNF_7_bit;
} @0x23B8;


