snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
/*
enum {
  USBIIE          = 0x0004,
  STALL           = 0x0008,
  DBUF            = 0x0010,
  TOGGLE          = 0x0020,
  UBME            = 0x0080,
};

*/

  /* Output Endpoint_6: X/Y-buffer size */
__no_init volatile unsigned char USBOEPSIZXY_6 @ 0x23B7;



  /* Output Endpoint_6: Y-byte count */
__no_init volatile unsigned char USBOEPBCTY_6 @ 0x23B6;



  /* Output Endpoint_6: Y-buffer base addr. */
__no_init volatile unsigned char USBOEPBBAY_6 @ 0x23B5;



  /* Output Endpoint_6: X-byte count */
__no_init volatile unsigned char USBOEPBCTX_6 @ 0x23B2;



  /* Output Endpoint_6: X-buffer base addr. */
__no_init volatile unsigned char USBOEPBBAX_6 @ 0x23B1;



__no_init volatile union
{
  unsigned char USBOEPCNF_6;   /* Output Endpoint_6: Configuration */

  struct
  {
    unsigned char                : 2;
    unsigned char USBIIE          : 1; /* USB - Transaction Interrupt indication enable */
    unsigned char STALL           : 1; /* USB - Stall Condition */
    unsigned char DBUF            : 1; /* USB - Double Buffer Enable */
    unsigned char TOGGLE          : 1; /* USB - Toggle Bit */
    unsigned char                : 1;
    unsigned char UBME            : 1; /* USB - UBM In-Endpoint Enable */
  }USBOEPCNF_6_bit;
} @0x23B0;


/*
enum {
  USBIIE          = 0x0004,
  STALL           = 0x0008,
  DBUF            = 0x0010,
  TOGGLE          = 0x0020,
  UBME            = 0x0080,
};

*/

  /* Output Endpoint_5: X/Y-buffer size */
__no_init volatile unsigned char USBOEPSIZXY_5 @ 0x23AF;



  /* Output Endpoint_5: Y-byte count */
__no_init volatile unsigned char USBOEPBCTY_5 @ 0x23AE;



  /* Output Endpoint_5: Y-buffer base addr. */
__no_init volatile unsigned char USBOEPBBAY_5 @ 0x23AD;



  /* Output Endpoint_5: X-byte count */
__no_init volatile unsigned char USBOEPBCTX_5 @ 0x23AA;



  /* Output Endpoint_5: X-buffer base addr. */
__no_init volatile unsigned char USBOEPBBAX_5 @ 0x23A9;



__no_init volatile union
{
  unsigned char USBOEPCNF_5;   /* Output Endpoint_5: Configuration */

  struct
  {
    unsigned char                : 2;
    unsigned char USBIIE          : 1; /* USB - Transaction Interrupt indication enable */
    unsigned char STALL           : 1; /* USB - Stall Condition */
    unsigned char DBUF            : 1; /* USB - Double Buffer Enable */
    unsigned char TOGGLE          : 1; /* USB - Toggle Bit */
    unsigned char                : 1;
    unsigned char UBME            : 1; /* USB - UBM In-Endpoint Enable */
  }USBOEPCNF_5_bit;
} @0x23A8;


/*
enum {
  USBIIE          = 0x0004,
  STALL           = 0x0008,
  DBUF            = 0x0010,
  TOGGLE          = 0x0020,
  UBME            = 0x0080,
};

*/

  /* Output Endpoint_4: X/Y-buffer size */
__no_init volatile unsigned char USBOEPSIZXY_4 @ 0x23A7;



  /* Output Endpoint_4: Y-byte count */
__no_init volatile unsigned char USBOEPBCTY_4 @ 0x23A6;



  /* Output Endpoint_4: Y-buffer base addr. */
__no_init volatile unsigned char USBOEPBBAY_4 @ 0x23A5;



  /* Output Endpoint_4: X-byte count */
__no_init volatile unsigned char USBOEPBCTX_4 @ 0x23A2;



  /* Output Endpoint_4: X-buffer base addr. */
__no_init volatile unsigned char USBOEPBBAX_4 @ 0x23A1;



__no_init volatile union
{
  unsigned char USBOEPCNF_4;   /* Output Endpoint_4: Configuration */

  struct
  {
    unsigned char                : 2;
    unsigned char USBIIE          : 1; /* USB - Transaction Interrupt indication enable */
    unsigned char STALL           : 1; /* USB - Stall Condition */
    unsigned char DBUF            : 1; /* USB - Double Buffer Enable */
    unsigned char TOGGLE          : 1; /* USB - Toggle Bit */
    unsigned char                : 1;
    unsigned char UBME            : 1; /* USB - UBM In-Endpoint Enable */
  }USBOEPCNF_4_bit;
} @0x23A0;


/*
enum {
  USBIIE          = 0x0004,
  STALL           = 0x0008,
  DBUF            = 0x0010,
  TOGGLE          = 0x0020,
  UBME            = 0x0080,
};

*/

  /* Output Endpoint_3: X/Y-buffer size */
__no_init volatile unsigned char USBOEPSIZXY_3 @ 0x239F;



  /* Output Endpoint_3: Y-byte count */
__no_init volatile unsigned char USBOEPBCTY_3 @ 0x239E;



  /* Output Endpoint_3: Y-buffer base addr. */
__no_init volatile unsigned char USBOEPBBAY_3 @ 0x239D;



  /* Output Endpoint_3: X-byte count */
__no_init volatile unsigned char USBOEPBCTX_3 @ 0x239A;



  /* Output Endpoint_3: X-buffer base addr. */
__no_init volatile unsigned char USBOEPBBAX_3 @ 0x2399;



__no_init volatile union
{
  unsigned char USBOEPCNF_3;   /* Output Endpoint_3: Configuration */

  struct
  {
    unsigned char                : 2;
    unsigned char USBIIE          : 1; /* USB - Transaction Interrupt indication enable */
    unsigned char STALL           : 1; /* USB - Stall Condition */
    unsigned char DBUF            : 1; /* USB - Double Buffer Enable */
    unsigned char TOGGLE          : 1; /* USB - Toggle Bit */
    unsigned char                : 1;
    unsigned char UBME            : 1; /* USB - UBM In-Endpoint Enable */
  }USBOEPCNF_3_bit;
} @0x2398;


/*
enum {
  USBIIE          = 0x0004,
  STALL           = 0x0008,
  DBUF            = 0x0010,
  TOGGLE          = 0x0020,
  UBME            = 0x0080,
};

*/

  /* Output Endpoint_2: X/Y-buffer size */
__no_init volatile unsigned char USBOEPSIZXY_2 @ 0x2397;



  /* Output Endpoint_2: Y-byte count */
__no_init volatile unsigned char USBOEPBCTY_2 @ 0x2396;



  /* Output Endpoint_2: Y-buffer base addr. */
__no_init volatile unsigned char USBOEPBBAY_2 @ 0x2395;



  /* Output Endpoint_2: X-byte count */
__no_init volatile unsigned char USBOEPBCTX_2 @ 0x2392;



  /* Output Endpoint_2: X-buffer base addr. */
__no_init volatile unsigned char USBOEPBBAX_2 @ 0x2391;



__no_init volatile union
{
  unsigned char USBOEPCNF_2;   /* Output Endpoint_2: Configuration */

  struct
  {
    unsigned char                : 2;
    unsigned char USBIIE          : 1; /* USB - Transaction Interrupt indication enable */
    unsigned char STALL           : 1; /* USB - Stall Condition */
    unsigned char DBUF            : 1; /* USB - Double Buffer Enable */
    unsigned char TOGGLE          : 1; /* USB - Toggle Bit */
    unsigned char                : 1;
    unsigned char UBME            : 1; /* USB - UBM In-Endpoint Enable */
  }USBOEPCNF_2_bit;
} @0x2390;


