snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
/*
enum {
  USBIIE          = 0x0004,
  STALL           = 0x0008,
  DBUF            = 0x0010,
  TOGGLE          = 0x0020,
  UBME            = 0x0080,
};

*/

  /* Output Endpoint_1: X/Y-buffer size */
__no_init volatile unsigned char USBOEPSIZXY_1 @ 0x238F;



  /* Output Endpoint_1: Y-byte count */
__no_init volatile unsigned char USBOEPBCTY_1 @ 0x238E;



  /* Output Endpoint_1: Y-buffer base addr. */
__no_init volatile unsigned char USBOEPBBAY_1 @ 0x238D;



  /* Output Endpoint_1: X-byte count */
__no_init volatile unsigned char USBOEPBCTX_1 @ 0x238A;



  /* Output Endpoint_1: X-buffer base addr. */
__no_init volatile unsigned char USBOEPBBAX_1 @ 0x2389;



__no_init volatile union
{
  unsigned char USBOEPCNF_1;   /* Output Endpoint_1: Configuration */

  struct
  {
    unsigned char                : 2;
    unsigned char USBIIE          : 1; /* USB - Transaction Interrupt indication enable */
    unsigned char STALL           : 1; /* USB - Stall Condition */
    unsigned char DBUF            : 1; /* USB - Double Buffer Enable */
    unsigned char TOGGLE          : 1; /* USB - Toggle Bit */
    unsigned char                : 1;
    unsigned char UBME            : 1; /* USB - UBM In-Endpoint Enable */
  }USBOEPCNF_1_bit;
} @0x2388;


/*
enum {
  USBIIE          = 0x0004,
  STALL           = 0x0008,
  DBUF            = 0x0010,
  TOGGLE          = 0x0020,
  UBME            = 0x0080,
};

*/

  /* Setup Packet Block */
__no_init volatile unsigned char USBSUBLK @ 0x2380;



  /* Input endpoint_0 buffer */
__no_init volatile unsigned char USBIEP0BUF @ 0x2378;



  /* Output endpoint_0 buffer */
__no_init volatile unsigned char USBOEP0BUF @ 0x2370;



  /* Top of buffer space */
__no_init volatile unsigned char USBTOPBUFF @ 0x236F;



  /* Start of buffer space */
__no_init volatile unsigned char USBSTABUFF @ 0x1C00;


#define __MSP430_HAS_USB__            /* Definition to show that Module is available */

/*-------------------------------------------------------------------------
 *   UCS  Unified System Clock
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short UCSCTL0;   /* UCS Control Register 0 */

  struct
  {
    unsigned short                : 3;
    unsigned short MOD0            : 1; /* Modulation Bit Counter Bit : 0 */
    unsigned short MOD1            : 1; /* Modulation Bit Counter Bit : 1 */
    unsigned short MOD2            : 1; /* Modulation Bit Counter Bit : 2 */
    unsigned short MOD3            : 1; /* Modulation Bit Counter Bit : 3 */
    unsigned short MOD4            : 1; /* Modulation Bit Counter Bit : 4 */
    unsigned short DCO0            : 1; /* DCO TAP Bit : 0 */
    unsigned short DCO1            : 1; /* DCO TAP Bit : 1 */
    unsigned short DCO2            : 1; /* DCO TAP Bit : 2 */
    unsigned short DCO3            : 1; /* DCO TAP Bit : 3 */
    unsigned short DCO4            : 1; /* DCO TAP Bit : 4 */
  } UCSCTL0_bit;

  struct
  {
    unsigned char UCSCTL0_L;
    unsigned char UCSCTL0_H;
  };
} @0x0160;

enum {
  MOD0            = 0x0008,
  MOD1            = 0x0010,
  MOD2            = 0x0020,
  MOD3            = 0x0040,
  MOD4            = 0x0080,
  DCO0            = 0x0100,
  DCO1            = 0x0200,
  DCO2            = 0x0400,
  DCO3            = 0x0800,
  DCO4            = 0x1000
};

__no_init volatile union
{
  unsigned short UCSCTL1;   /* UCS Control Register 1 */

  struct
  {
    unsigned short DISMOD          : 1; /* Disable Modulation */
    unsigned short                : 3;
    unsigned short DCORSEL0        : 1; /* DCO Freq. Range Select Bit : 0 */
    unsigned short DCORSEL1        : 1; /* DCO Freq. Range Select Bit : 1 */
    unsigned short DCORSEL2        : 1; /* DCO Freq. Range Select Bit : 2 */
  } UCSCTL1_bit;

  struct
  {
    unsigned char UCSCTL1_L;
    unsigned char UCSCTL1_H;
  };
} @0x0162;

enum {
  DISMOD          = 0x0001,
  DCORSEL0        = 0x0010,
  DCORSEL1        = 0x0020,
  DCORSEL2        = 0x0040
};

__no_init volatile union
{
  unsigned short UCSCTL2;   /* UCS Control Register 2 */

  struct
  {
    unsigned short FLLN0           : 1; /* FLL Multipier Bit : 0 */
    unsigned short FLLN1           : 1; /* FLL Multipier Bit : 1 */
    unsigned short FLLN2           : 1; /* FLL Multipier Bit : 2 */
    unsigned short FLLN3           : 1; /* FLL Multipier Bit : 3 */
    unsigned short FLLN4           : 1; /* FLL Multipier Bit : 4 */
    unsigned short FLLN5           : 1; /* FLL Multipier Bit : 5 */
    unsigned short FLLN6           : 1; /* FLL Multipier Bit : 6 */
    unsigned short FLLN7           : 1; /* FLL Multipier Bit : 7 */
    unsigned short FLLN8           : 1; /* FLL Multipier Bit : 8 */
    unsigned short FLLN9           : 1; /* FLL Multipier Bit : 9 */
    unsigned short                : 2;
    unsigned short FLLD0           : 1; /* Loop Divider Bit : 0 */
    unsigned short FLLD1           : 1; /* Loop Divider Bit : 1 */
    unsigned short FLLD2           : 1; /* Loop Divider Bit : 1 */
  } UCSCTL2_bit;

  struct
  {
    unsigned char UCSCTL2_L;
    unsigned char UCSCTL2_H;
  };
} @0x0164;

enum {
  FLLN0           = 0x0001,
  FLLN1           = 0x0002,
  FLLN2           = 0x0004,
  FLLN3           = 0x0008,
  FLLN4           = 0x0010,
  FLLN5           = 0x0020,
  FLLN6           = 0x0040,
  FLLN7           = 0x0080,
  FLLN8           = 0x0100,
  FLLN9           = 0x0200,
  FLLD0           = 0x1000,
  FLLD1           = 0x2000,
  FLLD2           = 0x4000
};

__no_init volatile union
{
  unsigned short UCSCTL3;   /* UCS Control Register 3 */

  struct
  {
    unsigned short FLLREFDIV0      : 1; /* Reference Divider Bit : 0 */
    unsigned short FLLREFDIV1      : 1; /* Reference Divider Bit : 1 */
    unsigned short FLLREFDIV2      : 1; /* Reference Divider Bit : 2 */
    unsigned short                : 1;
    unsigned short SELREF0         : 1; /* FLL Reference Clock Select Bit : 0 */
    unsigned short SELREF1         : 1; /* FLL Reference Clock Select Bit : 1 */
    unsigned short SELREF2         : 1; /* FLL Reference Clock Select Bit : 2 */
  } UCSCTL3_bit;

  struct
  {
    unsigned char UCSCTL3_L;
    unsigned char UCSCTL3_H;
  };
} @0x0166;

enum {
  FLLREFDIV0      = 0x0001,
  FLLREFDIV1      = 0x0002,
  FLLREFDIV2      = 0x0004,
  SELREF0         = 0x0010,
  SELREF1         = 0x0020,
  SELREF2         = 0x0040
};

