snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short UCA0BRW;   /* USCI A0 Baud Word Rate 0 */
  struct
  {
    unsigned char UCA0BRW_L;
    unsigned char UCA0BRW_H;
  };
  struct
  {
    unsigned char UCA0BR0;   /* USCI A0 Baud Rate 0 */
    unsigned char UCA0BR1;   /* USCI A0 Baud Rate 1 */
  };
  unsigned short UCA0BRW__SPI;   /*  */
  struct
  {
    unsigned char UCA0BR0__SPI;   /*  */
    unsigned char UCA0BR1__SPI;   /*  */
  };
} @0x05C6;

__no_init volatile union
{
  unsigned char UCA0MCTL;   /* USCI A0 Modulation Control */

  struct
  {
    unsigned char UCOS16          : 1; /* USCI 16-times Oversampling enable */
    unsigned char UCBRS0          : 1; /* USCI Second Stage Modulation Select 0 */
    unsigned char UCBRS1          : 1; /* USCI Second Stage Modulation Select 1 */
    unsigned char UCBRS2          : 1; /* USCI Second Stage Modulation Select 2 */
    unsigned char UCBRF0          : 1; /* USCI First Stage Modulation Select 0 */
    unsigned char UCBRF1          : 1; /* USCI First Stage Modulation Select 1 */
    unsigned char UCBRF2          : 1; /* USCI First Stage Modulation Select 2 */
    unsigned char UCBRF3          : 1; /* USCI First Stage Modulation Select 3 */
  } UCA0MCTL_bit;

  unsigned char UCA0MCTL__SPI;   /*  */
} @0x05C8;

enum {
  UCOS16          = 0x0001,
  UCBRS0          = 0x0002,
  UCBRS1          = 0x0004,
  UCBRS2          = 0x0008,
  UCBRF0          = 0x0010,
  UCBRF1          = 0x0020,
  UCBRF2          = 0x0040,
  UCBRF3          = 0x0080
};

__no_init volatile union
{
  unsigned char UCA0STAT;   /* USCI A0 Status Register */

  struct
  {
    unsigned char UCBUSY          : 1; /* USCI Busy Flag */
    unsigned char UCADDR          : 1; /* USCI Address received Flag */
    unsigned char UCRXERR         : 1; /* USCI RX Error Flag */
    unsigned char UCBRK           : 1; /* USCI Break received */
    unsigned char UCPE            : 1; /* USCI Parity Error Flag */
    unsigned char UCOE            : 1; /* USCI Overrun Error Flag */
    unsigned char UCFE            : 1; /* USCI Frame Error Flag */
    unsigned char UCLISTEN        : 1; /* USCI Listen mode */
  } UCA0STAT_bit;

  unsigned char UCA0STAT__SPI;   /*  */
  struct
  {
    unsigned char UCBUSY          : 1; /* USCI Busy Flag */
    unsigned char                : 4;
    unsigned char UCOE            : 1; /* USCI Overrun Error Flag */
    unsigned char UCFE            : 1; /* USCI Frame Error Flag */
    unsigned char UCLISTEN        : 1; /* USCI Listen mode */
  } UCA0STAT__SPI_bit;

} @0x05CA;

enum {
  UCBUSY          = 0x0001,
  UCADDR          = 0x0002,
  UCRXERR         = 0x0004,
  UCBRK           = 0x0008,
  UCPE            = 0x0010,
  UCOE            = 0x0020,
  UCFE            = 0x0040,
  UCLISTEN        = 0x0080
};

__no_init volatile union
{
  unsigned __READ char UCA0RXBUF;   /* USCI A0 Receive Buffer */
  unsigned char UCA0RXBUF__SPI;   /*  */
} @0x05CC;

__no_init volatile union
{
  unsigned char UCA0TXBUF;   /* USCI A0 Transmit Buffer */
  unsigned char UCA0TXBUF__SPI;   /*  */
} @0x05CE;


__no_init volatile union
{
  unsigned char UCA0ABCTL;   /* USCI A0 LIN Control */

  struct
  {
    unsigned char UCABDEN         : 1; /* Auto Baud Rate detect enable */
    unsigned char                : 1;
    unsigned char UCBTOE          : 1; /* Break Timeout error */
    unsigned char UCSTOE          : 1; /* Sync-Field Timeout error */
    unsigned char UCDELIM0        : 1; /* Break Sync Delimiter 0 */
    unsigned char UCDELIM1        : 1; /* Break Sync Delimiter 1 */
  }UCA0ABCTL_bit;
} @0x05D0;


enum {
  UCABDEN         = 0x0001,
  UCBTOE          = 0x0004,
  UCSTOE          = 0x0008,
  UCDELIM0        = 0x0010,
  UCDELIM1        = 0x0020
};

__no_init volatile union
{
  unsigned short UCA0IRCTL;   /* USCI A0 IrDA Transmit Control */
  struct
  {
    unsigned char UCA0IRCTL_L;
    unsigned char UCA0IRCTL_H;
  };
  struct
  {
    unsigned char UCA0IRTCTL;   /* USCI A0 IrDA Transmit Control */
    unsigned char UCA0IRRCTL;   /* USCI A0 IrDA Receive Control */
  };
  struct
  {
    struct
    {
      unsigned char UCIREN          : 1; /* IRDA Encoder/Decoder enable */
      unsigned char UCIRTXCLK       : 1; /* IRDA Transmit Pulse Clock Select */
      unsigned char UCIRTXPL0       : 1; /* IRDA Transmit Pulse Length 0 */
      unsigned char UCIRTXPL1       : 1; /* IRDA Transmit Pulse Length 1 */
      unsigned char UCIRTXPL2       : 1; /* IRDA Transmit Pulse Length 2 */
      unsigned char UCIRTXPL3       : 1; /* IRDA Transmit Pulse Length 3 */
      unsigned char UCIRTXPL4       : 1; /* IRDA Transmit Pulse Length 4 */
      unsigned char UCIRTXPL5       : 1; /* IRDA Transmit Pulse Length 5 */
    } UCA0IRTCTL_bit;

    struct
    {
      unsigned char UCIRRXFE        : 1; /* IRDA Receive Filter enable */
      unsigned char UCIRRXPL        : 1; /* IRDA Receive Input Polarity */
      unsigned char UCIRRXFL0       : 1; /* IRDA Receive Filter Length 0 */
      unsigned char UCIRRXFL1       : 1; /* IRDA Receive Filter Length 1 */
      unsigned char UCIRRXFL2       : 1; /* IRDA Receive Filter Length 2 */
      unsigned char UCIRRXFL3       : 1; /* IRDA Receive Filter Length 3 */
      unsigned char UCIRRXFL4       : 1; /* IRDA Receive Filter Length 4 */
      unsigned char UCIRRXFL5       : 1; /* IRDA Receive Filter Length 5 */
    } UCA0IRRCTL_bit;
  }; 
} @0x05D2;

enum {
  UCIREN          = 0x0001,
  UCIRTXCLK       = 0x0002,
  UCIRTXPL0       = 0x0004,
  UCIRTXPL1       = 0x0008,
  UCIRTXPL2       = 0x0010,
  UCIRTXPL3       = 0x0020,
  UCIRTXPL4       = 0x0040,
  UCIRTXPL5       = 0x0080
};

enum {
  UCIRRXFE        = 0x0001,
  UCIRRXPL        = 0x0002,
  UCIRRXFL0       = 0x0004,
  UCIRRXFL1       = 0x0008,
  UCIRRXFL2       = 0x0010,
  UCIRRXFL3       = 0x0020,
  UCIRRXFL4       = 0x0040,
  UCIRRXFL5       = 0x0080
};

