snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned short UCA0ICTL;   /* USCI A0 Interrupt Enable Register */
  struct
  {
    unsigned char UCA0ICTL_L;
    unsigned char UCA0ICTL_H;
  };
  struct
  {
    unsigned char UCA0IE;   /* USCI A0 Interrupt Enable Register */
    unsigned char UCA0IFG;   /* USCI A0 Interrupt Flags Register */
  };
  struct
  {
    struct
    {
      unsigned char UCRXIE          : 1; /* USCI Receive Interrupt Enable */
      unsigned char UCTXIE          : 1; /* USCI Transmit Interrupt Enable */
    } UCA0IE_bit;

    struct
    {
      unsigned char UCRXIFG         : 1; /* USCI Receive Interrupt Flag */
      unsigned char UCTXIFG         : 1; /* USCI Transmit Interrupt Flag */
    } UCA0IFG_bit;
  }; 
  unsigned short UCA0ICTL__SPI;   /*  */
  struct
  {
    unsigned char UCA0IE__SPI;   /*  */
    unsigned char UCA0IFG__SPI;   /*  */
  };
  struct
  {
    struct
    {
      unsigned char UCRXIE          : 1; /* USCI Receive Interrupt Enable */
      unsigned char UCTXIE          : 1; /* USCI Transmit Interrupt Enable */
      unsigned char UCSTTIE         : 1; /* START Condition interrupt enable */
      unsigned char UCSTPIE         : 1; /* STOP Condition interrupt enable */
      unsigned char UCALIE          : 1; /* Arbitration Lost interrupt enable */
      unsigned char UCNACKIE        : 1; /* NACK Condition interrupt enable */
    } UCA0IE__SPI_bit;

    struct
    {
      unsigned char UCRXIFG         : 1; /* USCI Receive Interrupt Flag */
      unsigned char UCTXIFG         : 1; /* USCI Transmit Interrupt Flag */
    } UCA0IFG__SPI_bit;
  }; 
} @0x05DC;

enum {
  UCRXIE          = 0x0001,
  UCTXIE          = 0x0002
};

enum {
  UCRXIFG         = 0x0001,
  UCTXIFG         = 0x0002
};

__no_init volatile union
{
  unsigned short UCA0IV;   /* USCI A0 Interrupt Vector Register */
  unsigned short UCA0IV__SPI;   /*  */
} @0x05DE;

#define __MSP430_HAS_USCI_A0__       /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_A0__ 0x05C0
#define USCI_A0_BASE __MSP430_BASEADDRESS_USCI_A0__

/*-------------------------------------------------------------------------
 *   USCI_A0  SPI Mode
 *-------------------------------------------------------------------------*/


enum {
/*  UCSYNC          = 0x0001, */
/*  UCMODE0         = 0x0002, */
/*  UCMODE1         = 0x0004, */
  UCMST           = 0x0008,
/*  UC7BIT          = 0x0010, */
/*  UCMSB           = 0x0020, */
  UCCKPL          = 0x0040,
  UCCKPH          = 0x0080
};

/*
enum {
  UCSWRST         = 0x0001,
  UCSSEL0         = 0x0040,
  UCSSEL1         = 0x0080,
};

*/
/*
enum {
  UCBUSY          = 0x0001,
  UCOE            = 0x0020,
  UCFE            = 0x0040,
  UCLISTEN        = 0x0080,
};

*/
enum {
/*  UCRXIE          = 0x0001, */
/*  UCTXIE          = 0x0002, */
  UCSTTIE         = 0x0004,
  UCSTPIE         = 0x0008,
  UCALIE          = 0x0010,
  UCNACKIE        = 0x0020
};

/*
enum {
  UCRXIFG         = 0x0001,
  UCTXIFG         = 0x0002,
};

*/
/*-------------------------------------------------------------------------
 *   USCI_B0  SPI Mode
 *-------------------------------------------------------------------------*/


__no_init volatile union
{
  unsigned short UCB0CTLW0__SPI;   /*  */
  struct
  {
    unsigned char UCB0CTL1__SPI;   /*  */
    unsigned char UCB0CTL0__SPI;   /*  */
  };
  struct
  {
    struct
    {
      unsigned char UCSWRST         : 1; /* USCI Software Reset */
      unsigned char                : 5;
      unsigned char UCSSEL0         : 1; /* USCI 0 Clock Source Select 0 */
      unsigned char UCSSEL1         : 1; /* USCI 0 Clock Source Select 1 */
    } UCB0CTL1__SPI_bit;

    struct
    {
      unsigned char UCSYNC          : 1; /* Sync-Mode  0:UART-Mode / 1:SPI-Mode */
      unsigned char UCMODE0         : 1; /* Async. Mode: USCI Mode 0 */
      unsigned char UCMODE1         : 1; /* Async. Mode: USCI Mode 1 */
      unsigned char UCMST           : 1; /* Sync. Mode: Master Select */
      unsigned char UC7BIT          : 1; /* Async. Mode: Data Bits  0:8-bits / 1:7-bits */
      unsigned char UCMSB           : 1; /* Async. Mode: MSB first  0:LSB / 1:MSB */
      unsigned char UCCKPL          : 1; /* Sync. Mode: Clock Polarity */
      unsigned char UCCKPH          : 1; /* Sync. Mode: Clock Phase */
    } UCB0CTL0__SPI_bit;
  }; 
  unsigned short UCB0CTLW0;   /* USCI B0 Control Word Register 0 */
  struct
  {
    unsigned char UCB0CTL1;   /* USCI B0 Control Register 1 */
    unsigned char UCB0CTL0;   /* USCI B0 Control Register 0 */
  };
  struct
  {
    struct
    {
      unsigned char UCSWRST         : 1; /* USCI Software Reset */
      unsigned char UCTXSTT         : 1; /* Transmit START */
      unsigned char UCTXSTP         : 1; /* Transmit STOP */
      unsigned char UCTXNACK        : 1; /* Transmit NACK */
      unsigned char UCTR            : 1; /* Transmit/Receive Select/Flag */
      unsigned char                : 1;
      unsigned char UCSSEL0         : 1; /* USCI 0 Clock Source Select 0 */
      unsigned char UCSSEL1         : 1; /* USCI 0 Clock Source Select 1 */
    } UCB0CTL1_bit;

    struct
    {
      unsigned char UCSYNC          : 1; /* Sync-Mode  0:UART-Mode / 1:SPI-Mode */
      unsigned char UCMODE0         : 1; /* Async. Mode: USCI Mode 0 */
      unsigned char UCMODE1         : 1; /* Async. Mode: USCI Mode 1 */
      unsigned char UCMST           : 1; /* Sync. Mode: Master Select */
      unsigned char                : 1;
      unsigned char UCMM            : 1; /* Multi-Master Environment */
      unsigned char UCSLA10         : 1; /* 10-bit Slave Address Mode */
      unsigned char UCA10           : 1; /* 10-bit Address Mode */
    } UCB0CTL0_bit;
  }; 
} @0x05E0;

/*
enum {
  UCSYNC          = 0x0001,
  UCMODE0         = 0x0002,
  UCMODE1         = 0x0004,
  UCMST           = 0x0008,
  UC7BIT          = 0x0010,
  UCMSB           = 0x0020,
  UCCKPL          = 0x0040,
  UCCKPH          = 0x0080,
};

*/
/*
enum {
  UCSWRST         = 0x0001,
  UCSSEL0         = 0x0040,
  UCSSEL1         = 0x0080,
};

*/
__no_init volatile union
{
  unsigned short UCB0BRW__SPI;   /*  */
  struct
  {
    unsigned char UCB0BR0__SPI;   /*  */
    unsigned char UCB0BR1__SPI;   /*  */
  };
  unsigned short UCB0BRW;   /* USCI B0 Baud Word Rate 0 */
  struct
  {
    unsigned char UCB0BR0;   /* USCI B0 Baud Rate 0 */
    unsigned char UCB0BR1;   /* USCI B0 Baud Rate 1 */
  };
} @0x05E6;

