snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
__no_init volatile union
{
  unsigned char UCB0STAT__SPI;   /*  */

  struct
  {
    unsigned char UCBUSY          : 1; /* USCI Busy Flag */
    unsigned char                : 4;
    unsigned char UCOE            : 1; /* USCI Overrun Error Flag */
    unsigned char UCFE            : 1; /* USCI Frame Error Flag */
    unsigned char UCLISTEN        : 1; /* USCI Listen mode */
  } UCB0STAT__SPI_bit;

  unsigned char UCB0STAT;   /* USCI B0 Status Register */
  struct
  {
    unsigned char                : 4;
    unsigned char UCBBUSY         : 1; /* Bus Busy Flag */
    unsigned char UCGC            : 1; /* General Call address received Flag */
    unsigned char UCSCLLOW        : 1; /* SCL low */
    unsigned char UCLISTEN        : 1; /* USCI Listen mode */
  } UCB0STAT_bit;

} @0x05EA;

/*
enum {
  UCBUSY          = 0x0001,
  UCOE            = 0x0020,
  UCFE            = 0x0040,
  UCLISTEN        = 0x0080,
};

*/
__no_init volatile union
{
  unsigned char UCB0RXBUF__SPI;   /*  */
  unsigned __READ char UCB0RXBUF;   /* USCI B0 Receive Buffer */
} @0x05EC;

__no_init volatile union
{
  unsigned char UCB0TXBUF__SPI;   /*  */
  unsigned char UCB0TXBUF;   /* USCI B0 Transmit Buffer */
} @0x05EE;

__no_init volatile union
{
  unsigned short UCB0ICTL__SPI;   /*  */
  struct
  {
    unsigned char UCB0IE__SPI;   /*  */
    unsigned char UCB0IFG__SPI;   /*  */
  };
  struct
  {
    struct
    {
      unsigned char UCRXIE          : 1; /* USCI Receive Interrupt Enable */
      unsigned char UCTXIE          : 1; /* USCI Transmit Interrupt Enable */
      unsigned char UCSTTIE         : 1; /* START Condition interrupt enable */
      unsigned char UCSTPIE         : 1; /* STOP Condition interrupt enable */
      unsigned char UCALIE          : 1; /* Arbitration Lost interrupt enable */
      unsigned char UCNACKIE        : 1; /* NACK Condition interrupt enable */
    } UCB0IE__SPI_bit;

    struct
    {
      unsigned char UCRXIFG         : 1; /* USCI Receive Interrupt Flag */
      unsigned char UCTXIFG         : 1; /* USCI Transmit Interrupt Flag */
    } UCB0IFG__SPI_bit;
  }; 
  unsigned short UCB0ICTL;   /* USCI B0 Interrupt Enable Register */
  struct
  {
    unsigned char UCB0IE;   /* USCI B0 Interrupt Enable Register */
    unsigned char UCB0IFG;   /* USCI B0 Interrupt Flags Register */
  };
  struct
  {
    struct
    {
      unsigned char UCRXIE          : 1; /* USCI Receive Interrupt Enable */
      unsigned char UCTXIE          : 1; /* USCI Transmit Interrupt Enable */
      unsigned char UCSTTIE         : 1; /* START Condition interrupt enable */
      unsigned char UCSTPIE         : 1; /* STOP Condition interrupt enable */
      unsigned char UCALIE          : 1; /* Arbitration Lost interrupt enable */
      unsigned char UCNACKIE        : 1; /* NACK Condition interrupt enable */
    } UCB0IE_bit;

    struct
    {
      unsigned char UCRXIFG         : 1; /* USCI Receive Interrupt Flag */
      unsigned char UCTXIFG         : 1; /* USCI Transmit Interrupt Flag */
      unsigned char UCSTTIFG        : 1; /* START Condition interrupt Flag */
      unsigned char UCSTPIFG        : 1; /* STOP Condition interrupt Flag */
      unsigned char UCALIFG         : 1; /* Arbitration Lost interrupt Flag */
      unsigned char UCNACKIFG       : 1; /* NAK Condition interrupt Flag */
    } UCB0IFG_bit;
  }; 
} @0x05FC;

/*
enum {
  UCRXIE          = 0x0001,
  UCTXIE          = 0x0002,
  UCSTTIE         = 0x0004,
  UCSTPIE         = 0x0008,
  UCALIE          = 0x0010,
  UCNACKIE        = 0x0020,
};

*/
/*
enum {
  UCRXIFG         = 0x0001,
  UCTXIFG         = 0x0002,
};

*/
__no_init volatile union
{
  unsigned short UCB0IV__SPI;   /*  */
  unsigned short UCB0IV;   /* USCI B0 Interrupt Vector Register */
} @0x05FE;

/*-------------------------------------------------------------------------
 *   USCI_B0  I2C Mode
 *-------------------------------------------------------------------------*/


enum {
/*  UCSYNC          = 0x0001, */
/*  UCMODE0         = 0x0002, */
/*  UCMODE1         = 0x0004, */
/*  UCMST           = 0x0008, */
  UCMM            = 0x0020,
  UCSLA10         = 0x0040,
  UCA10           = 0x0080
};

enum {
/*  UCSWRST         = 0x0001, */
  UCTXSTT         = 0x0002,
  UCTXSTP         = 0x0004,
  UCTXNACK        = 0x0008,
  UCTR            = 0x0010
/*  UCSSEL0         = 0x0040, */
/*  UCSSEL1         = 0x0080, */
};

enum {
  UCBBUSY         = 0x0010,
  UCGC            = 0x0020,
  UCSCLLOW        = 0x0040
/*  UCLISTEN        = 0x0080, */
};

__no_init volatile union
{
  unsigned short UCB0I2COA;   /* USCI B0 I2C Own Address */

  struct
  {
    unsigned short UCOA0           : 1; /* I2C Own Address 0 */
    unsigned short UCOA1           : 1; /* I2C Own Address 1 */
    unsigned short UCOA2           : 1; /* I2C Own Address 2 */
    unsigned short UCOA3           : 1; /* I2C Own Address 3 */
    unsigned short UCOA4           : 1; /* I2C Own Address 4 */
    unsigned short UCOA5           : 1; /* I2C Own Address 5 */
    unsigned short UCOA6           : 1; /* I2C Own Address 6 */
    unsigned short UCOA7           : 1; /* I2C Own Address 7 */
    unsigned short UCOA8           : 1; /* I2C Own Address 8 */
    unsigned short UCOA9           : 1; /* I2C Own Address 9 */
    unsigned short                : 5;
    unsigned short UCGCEN          : 1; /* I2C General Call enable */
  } UCB0I2COA_bit;

  struct
  {
    unsigned char UCB0I2COA_L;
    unsigned char UCB0I2COA_H;
  };
} @0x05F0;

enum {
  UCOA0           = 0x0001,
  UCOA1           = 0x0002,
  UCOA2           = 0x0004,
  UCOA3           = 0x0008,
  UCOA4           = 0x0010,
  UCOA5           = 0x0020,
  UCOA6           = 0x0040,
  UCOA7           = 0x0080,
  UCOA8           = 0x0100,
  UCOA9           = 0x0200,
  UCGCEN          = 0x8000
};

__no_init volatile union
{
  unsigned short UCB0I2CSA;   /* USCI B0 I2C Slave Address */

  struct
  {
    unsigned short UCSA0           : 1; /* I2C Slave Address 0 */
    unsigned short UCSA1           : 1; /* I2C Slave Address 1 */
    unsigned short UCSA2           : 1; /* I2C Slave Address 2 */
    unsigned short UCSA3           : 1; /* I2C Slave Address 3 */
    unsigned short UCSA4           : 1; /* I2C Slave Address 4 */
    unsigned short UCSA5           : 1; /* I2C Slave Address 5 */
    unsigned short UCSA6           : 1; /* I2C Slave Address 6 */
    unsigned short UCSA7           : 1; /* I2C Slave Address 7 */
    unsigned short UCSA8           : 1; /* I2C Slave Address 8 */
    unsigned short UCSA9           : 1; /* I2C Slave Address 9 */
  } UCB0I2CSA_bit;

  struct
  {
    unsigned char UCB0I2CSA_L;
    unsigned char UCB0I2CSA_H;
  };
} @0x05F2;

enum {
  UCSA0           = 0x0001,
  UCSA1           = 0x0002,
  UCSA2           = 0x0004,
  UCSA3           = 0x0008,
  UCSA4           = 0x0010,
  UCSA5           = 0x0020,
  UCSA6           = 0x0040,
  UCSA7           = 0x0080,
  UCSA8           = 0x0100,
  UCSA9           = 0x0200
};

