snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
/*
enum {
  UCSYNC          = 0x0001,
  UCMODE0         = 0x0002,
  UCMODE1         = 0x0004,
  UCSPB           = 0x0008,
  UC7BIT          = 0x0010,
  UCMSB           = 0x0020,
  UCPAR           = 0x0040,
  UCPEN           = 0x0080,
};

*/
/*
enum {
  UCSWRST         = 0x0001,
  UCTXBRK         = 0x0002,
  UCTXADDR        = 0x0004,
  UCDORM          = 0x0008,
  UCBRKIE         = 0x0010,
  UCRXEIE         = 0x0020,
  UCSSEL0         = 0x0040,
  UCSSEL1         = 0x0080,
};

*/
__no_init volatile union
{
  unsigned short UCA1BRW;   /* USCI A1 Baud Word Rate 0 */
  struct
  {
    unsigned char UCA1BRW_L;
    unsigned char UCA1BRW_H;
  };
  struct
  {
    unsigned char UCA1BR0;   /* USCI A1 Baud Rate 0 */
    unsigned char UCA1BR1;   /* USCI A1 Baud Rate 1 */
  };
  unsigned short UCA1BRW__SPI;   /*  */
  struct
  {
    unsigned char UCA1BR0__SPI;   /*  */
    unsigned char UCA1BR1__SPI;   /*  */
  };
} @0x0606;

__no_init volatile union
{
  unsigned char UCA1MCTL;   /* USCI A1 Modulation Control */

  struct
  {
    unsigned char UCOS16          : 1; /* USCI 16-times Oversampling enable */
    unsigned char UCBRS0          : 1; /* USCI Second Stage Modulation Select 0 */
    unsigned char UCBRS1          : 1; /* USCI Second Stage Modulation Select 1 */
    unsigned char UCBRS2          : 1; /* USCI Second Stage Modulation Select 2 */
    unsigned char UCBRF0          : 1; /* USCI First Stage Modulation Select 0 */
    unsigned char UCBRF1          : 1; /* USCI First Stage Modulation Select 1 */
    unsigned char UCBRF2          : 1; /* USCI First Stage Modulation Select 2 */
    unsigned char UCBRF3          : 1; /* USCI First Stage Modulation Select 3 */
  } UCA1MCTL_bit;

  unsigned char UCA1MCTL__SPI;   /*  */
} @0x0608;

/*
enum {
  UCOS16          = 0x0001,
  UCBRS0          = 0x0002,
  UCBRS1          = 0x0004,
  UCBRS2          = 0x0008,
  UCBRF0          = 0x0010,
  UCBRF1          = 0x0020,
  UCBRF2          = 0x0040,
  UCBRF3          = 0x0080,
};

*/
__no_init volatile union
{
  unsigned char UCA1STAT;   /* USCI A1 Status Register */

  struct
  {
    unsigned char UCBUSY          : 1; /* USCI Busy Flag */
    unsigned char UCADDR          : 1; /* USCI Address received Flag */
    unsigned char UCRXERR         : 1; /* USCI RX Error Flag */
    unsigned char UCBRK           : 1; /* USCI Break received */
    unsigned char UCPE            : 1; /* USCI Parity Error Flag */
    unsigned char UCOE            : 1; /* USCI Overrun Error Flag */
    unsigned char UCFE            : 1; /* USCI Frame Error Flag */
    unsigned char UCLISTEN        : 1; /* USCI Listen mode */
  } UCA1STAT_bit;

  unsigned char UCA1STAT__SPI;   /*  */
  struct
  {
    unsigned char UCBUSY          : 1; /* USCI Busy Flag */
    unsigned char                : 4;
    unsigned char UCOE            : 1; /* USCI Overrun Error Flag */
    unsigned char UCFE            : 1; /* USCI Frame Error Flag */
    unsigned char UCLISTEN        : 1; /* USCI Listen mode */
  } UCA1STAT__SPI_bit;

} @0x060A;

/*
enum {
  UCBUSY          = 0x0001,
  UCADDR          = 0x0002,
  UCRXERR         = 0x0004,
  UCBRK           = 0x0008,
  UCPE            = 0x0010,
  UCOE            = 0x0020,
  UCFE            = 0x0040,
  UCLISTEN        = 0x0080,
};

*/
__no_init volatile union
{
  unsigned __READ char UCA1RXBUF;   /* USCI A1 Receive Buffer */
  unsigned char UCA1RXBUF__SPI;   /*  */
} @0x060C;

__no_init volatile union
{
  unsigned char UCA1TXBUF;   /* USCI A1 Transmit Buffer */
  unsigned char UCA1TXBUF__SPI;   /*  */
} @0x060E;


__no_init volatile union
{
  unsigned char UCA1ABCTL;   /* USCI A1 LIN Control */

  struct
  {
    unsigned char UCABDEN         : 1; /* Auto Baud Rate detect enable */
    unsigned char                : 1;
    unsigned char UCBTOE          : 1; /* Break Timeout error */
    unsigned char UCSTOE          : 1; /* Sync-Field Timeout error */
    unsigned char UCDELIM0        : 1; /* Break Sync Delimiter 0 */
    unsigned char UCDELIM1        : 1; /* Break Sync Delimiter 1 */
  }UCA1ABCTL_bit;
} @0x0610;


/*
enum {
  UCABDEN         = 0x0001,
  UCBTOE          = 0x0004,
  UCSTOE          = 0x0008,
  UCDELIM0        = 0x0010,
  UCDELIM1        = 0x0020,
};

*/
__no_init volatile union
{
  unsigned short UCA1IRCTL;   /* USCI A1 IrDA Transmit Control */
  struct
  {
    unsigned char UCA1IRCTL_L;
    unsigned char UCA1IRCTL_H;
  };
  struct
  {
    unsigned char UCA1IRTCTL;   /* USCI A1 IrDA Transmit Control */
    unsigned char UCA1IRRCTL;   /* USCI A1 IrDA Receive Control */
  };
  struct
  {
    struct
    {
      unsigned char UCIREN          : 1; /* IRDA Encoder/Decoder enable */
      unsigned char UCIRTXCLK       : 1; /* IRDA Transmit Pulse Clock Select */
      unsigned char UCIRTXPL0       : 1; /* IRDA Transmit Pulse Length 0 */
      unsigned char UCIRTXPL1       : 1; /* IRDA Transmit Pulse Length 1 */
      unsigned char UCIRTXPL2       : 1; /* IRDA Transmit Pulse Length 2 */
      unsigned char UCIRTXPL3       : 1; /* IRDA Transmit Pulse Length 3 */
      unsigned char UCIRTXPL4       : 1; /* IRDA Transmit Pulse Length 4 */
      unsigned char UCIRTXPL5       : 1; /* IRDA Transmit Pulse Length 5 */
    } UCA1IRTCTL_bit;

    struct
    {
      unsigned char UCIRRXFE        : 1; /* IRDA Receive Filter enable */
      unsigned char UCIRRXPL        : 1; /* IRDA Receive Input Polarity */
      unsigned char UCIRRXFL0       : 1; /* IRDA Receive Filter Length 0 */
      unsigned char UCIRRXFL1       : 1; /* IRDA Receive Filter Length 1 */
      unsigned char UCIRRXFL2       : 1; /* IRDA Receive Filter Length 2 */
      unsigned char UCIRRXFL3       : 1; /* IRDA Receive Filter Length 3 */
      unsigned char UCIRRXFL4       : 1; /* IRDA Receive Filter Length 4 */
      unsigned char UCIRRXFL5       : 1; /* IRDA Receive Filter Length 5 */
    } UCA1IRRCTL_bit;
  }; 
} @0x0612;

