snakeneedy/2015-MSP430-IAR/doc/io430f5521.h
/*
enum {
  UCSYNC          = 0x0001,
  UCMODE0         = 0x0002,
  UCMODE1         = 0x0004,
  UCMST           = 0x0008,
  UC7BIT          = 0x0010,
  UCMSB           = 0x0020,
  UCCKPL          = 0x0040,
  UCCKPH          = 0x0080,
};

*/
/*
enum {
  UCSWRST         = 0x0001,
  UCSSEL0         = 0x0040,
  UCSSEL1         = 0x0080,
};

*/
__no_init volatile union
{
  unsigned short UCB1BRW__SPI;   /*  */
  struct
  {
    unsigned char UCB1BR0__SPI;   /*  */
    unsigned char UCB1BR1__SPI;   /*  */
  };
  unsigned short UCB1BRW;   /* USCI B1 Baud Word Rate 0 */
  struct
  {
    unsigned char UCB1BR0;   /* USCI B1 Baud Rate 0 */
    unsigned char UCB1BR1;   /* USCI B1 Baud Rate 1 */
  };
} @0x0626;

__no_init volatile union
{
  unsigned char UCB1STAT__SPI;   /*  */

  struct
  {
    unsigned char UCBUSY          : 1; /* USCI Busy Flag */
    unsigned char                : 4;
    unsigned char UCOE            : 1; /* USCI Overrun Error Flag */
    unsigned char UCFE            : 1; /* USCI Frame Error Flag */
    unsigned char UCLISTEN        : 1; /* USCI Listen mode */
  } UCB1STAT__SPI_bit;

  unsigned char UCB1STAT;   /* USCI B1 Status Register */
  struct
  {
    unsigned char                : 4;
    unsigned char UCBBUSY         : 1; /* Bus Busy Flag */
    unsigned char UCGC            : 1; /* General Call address received Flag */
    unsigned char UCSCLLOW        : 1; /* SCL low */
    unsigned char UCLISTEN        : 1; /* USCI Listen mode */
  } UCB1STAT_bit;

} @0x062A;

/*
enum {
  UCBUSY          = 0x0001,
  UCOE            = 0x0020,
  UCFE            = 0x0040,
  UCLISTEN        = 0x0080,
};

*/
__no_init volatile union
{
  unsigned char UCB1RXBUF__SPI;   /*  */
  unsigned __READ char UCB1RXBUF;   /* USCI B1 Receive Buffer */
} @0x062C;

__no_init volatile union
{
  unsigned char UCB1TXBUF__SPI;   /*  */
  unsigned char UCB1TXBUF;   /* USCI B1 Transmit Buffer */
} @0x062E;

__no_init volatile union
{
  unsigned short UCB1ICTL__SPI;   /*  */
  struct
  {
    unsigned char UCB1IE__SPI;   /*  */
    unsigned char UCB1IFG__SPI;   /*  */
  };
  struct
  {
    struct
    {
      unsigned char UCRXIE          : 1; /* USCI Receive Interrupt Enable */
      unsigned char UCTXIE          : 1; /* USCI Transmit Interrupt Enable */
      unsigned char UCSTTIE         : 1; /* START Condition interrupt enable */
      unsigned char UCSTPIE         : 1; /* STOP Condition interrupt enable */
      unsigned char UCALIE          : 1; /* Arbitration Lost interrupt enable */
      unsigned char UCNACKIE        : 1; /* NACK Condition interrupt enable */
    } UCB1IE__SPI_bit;

    struct
    {
      unsigned char UCRXIFG         : 1; /* USCI Receive Interrupt Flag */
      unsigned char UCTXIFG         : 1; /* USCI Transmit Interrupt Flag */
    } UCB1IFG__SPI_bit;
  }; 
  unsigned short UCB1ICTL;   /* USCI B1 Interrupt Enable Register */
  struct
  {
    unsigned char UCB1IE;   /* USCI B1 Interrupt Enable Register */
    unsigned char UCB1IFG;   /* USCI B1 Interrupt Flags Register */
  };
  struct
  {
    struct
    {
      unsigned char UCRXIE          : 1; /* USCI Receive Interrupt Enable */
      unsigned char UCTXIE          : 1; /* USCI Transmit Interrupt Enable */
      unsigned char UCSTTIE         : 1; /* START Condition interrupt enable */
      unsigned char UCSTPIE         : 1; /* STOP Condition interrupt enable */
      unsigned char UCALIE          : 1; /* Arbitration Lost interrupt enable */
      unsigned char UCNACKIE        : 1; /* NACK Condition interrupt enable */
    } UCB1IE_bit;

    struct
    {
      unsigned char UCRXIFG         : 1; /* USCI Receive Interrupt Flag */
      unsigned char UCTXIFG         : 1; /* USCI Transmit Interrupt Flag */
      unsigned char UCSTTIFG        : 1; /* START Condition interrupt Flag */
      unsigned char UCSTPIFG        : 1; /* STOP Condition interrupt Flag */
      unsigned char UCALIFG         : 1; /* Arbitration Lost interrupt Flag */
      unsigned char UCNACKIFG       : 1; /* NAK Condition interrupt Flag */
    } UCB1IFG_bit;
  }; 
} @0x063C;

/*
enum {
  UCRXIE          = 0x0001,
  UCTXIE          = 0x0002,
  UCSTTIE         = 0x0004,
  UCSTPIE         = 0x0008,
  UCALIE          = 0x0010,
  UCNACKIE        = 0x0020,
};

*/
/*
enum {
  UCRXIFG         = 0x0001,
  UCTXIFG         = 0x0002,
};

*/
__no_init volatile union
{
  unsigned short UCB1IV__SPI;   /*  */
  unsigned short UCB1IV;   /* USCI B1 Interrupt Vector Register */
} @0x063E;

/*-------------------------------------------------------------------------
 *   USCI_B1  I2C Mode
 *-------------------------------------------------------------------------*/


/*
enum {
  UCSYNC          = 0x0001,
  UCMODE0         = 0x0002,
  UCMODE1         = 0x0004,
  UCMST           = 0x0008,
  UCMM            = 0x0020,
  UCSLA10         = 0x0040,
  UCA10           = 0x0080,
};

*/
/*
enum {
  UCSWRST         = 0x0001,
  UCTXSTT         = 0x0002,
  UCTXSTP         = 0x0004,
  UCTXNACK        = 0x0008,
  UCTR            = 0x0010,
  UCSSEL0         = 0x0040,
  UCSSEL1         = 0x0080,
};

*/
/*
enum {
  UCBBUSY         = 0x0010,
  UCGC            = 0x0020,
  UCSCLLOW        = 0x0040,
  UCLISTEN        = 0x0080,
};

*/
__no_init volatile union
{
  unsigned short UCB1I2COA;   /* USCI B1 I2C Own Address */

  struct
  {
    unsigned short UCOA0           : 1; /* I2C Own Address 0 */
    unsigned short UCOA1           : 1; /* I2C Own Address 1 */
    unsigned short UCOA2           : 1; /* I2C Own Address 2 */
    unsigned short UCOA3           : 1; /* I2C Own Address 3 */
    unsigned short UCOA4           : 1; /* I2C Own Address 4 */
    unsigned short UCOA5           : 1; /* I2C Own Address 5 */
    unsigned short UCOA6           : 1; /* I2C Own Address 6 */
    unsigned short UCOA7           : 1; /* I2C Own Address 7 */
    unsigned short UCOA8           : 1; /* I2C Own Address 8 */
    unsigned short UCOA9           : 1; /* I2C Own Address 9 */
    unsigned short                : 5;
    unsigned short UCGCEN          : 1; /* I2C General Call enable */
  } UCB1I2COA_bit;

  struct
  {
    unsigned char UCB1I2COA_L;
    unsigned char UCB1I2COA_H;
  };
} @0x0630;

